[
  {
    "title": "Crocs Unisex-Adult Men's and Women's on The Clock Clog | Slip Resistant Work Shoes",
    "asin": "B071P3PRSV",
    "brand": "Crocs",
    "stars": 4.3,
    "reviewsCount": 27276,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71Brb-Q3n-L._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "Calling all baristas, restaurant servers, and healthcare and service industry workers of every stripe. If you spend hours on your feet, you deserve a comfortable pair that works as hard (and looks as good) as you do. Think of these reinforced slip-ons as a caffeinated version of Crocs Classic Clogs, all geared up for the grind.",
    "price": {
      "value": 30.09,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B071P3PRSV"
  },
  {
    "title": "Crocs Unisex Adult Men's and Women's Bistro Graphic Clog | Slip Resistant Work Shoes",
    "asin": "B085RW2CV6",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 14932,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81wfNIc7qtL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": null,
    "price": {
      "value": 21.5,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B085RW2CV6"
  },
  {
    "title": "Crocs Unisex-Child Crocband Sandal",
    "asin": "B089KD298Q",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 17186,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71Mdhm4770L.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Sandals",
    "description": "Your little ones will love these sporty sandals with fun colors and a comfy fit. Jibbitz charm holes let them add a personal touch.",
    "price": {
      "value": 15.1,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B089KD298Q"
  },
  {
    "title": "Crocs Unisex-Child Kids' Superhero Clog",
    "asin": "B09KCJ4D2W",
    "brand": "Crocs",
    "stars": 4.9,
    "reviewsCount": 88,
    "thumbnailImage": "https://m.media-amazon.com/images/I/714WehN5QML.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Boys › Shoes › Clogs & Mules",
    "description": "Here’s a welcome return of the iconic Batman we all know and love, springing into action on these new clogs. Crocs Fun Lab styles feature original character-rich graphics, licensed characters from popular entertainments and other inspired designs to help kids express themselves and engage new friends. In the Fun Lab, we see shoes as a blank canvas, a place to create more fun for little ones.",
    "price": {
      "value": 16.6,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09KCJ4D2W"
  },
  {
    "title": "Crocs Men's Literide 360 Pacer Sneakers",
    "asin": "B0963XCWMH",
    "brand": "Crocs",
    "stars": 4.3,
    "reviewsCount": 2037,
    "thumbnailImage": "https://m.media-amazon.com/images/I/713NyiP9ngL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Fashion Sneakers",
    "description": "Go your own pace in these innovative and dynamic sneakers. In this next evolution of LiteRide, the plush LiteRide foam footbed delivers support and cushioning where your feet need it most. The Matlite Motion straps mimic the flexibility of a knit fabric, offering the ultimate in breathability and flexibility. Step into the world-class comfort and styling of these new LiteRide 360 Pacers and feel sensational and stylish wherever life takes you.",
    "price": {
      "value": 41.15,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0963XCWMH"
  },
  {
    "title": "Crocs Women's Kadie II Flip Flops",
    "asin": "B010123AFI",
    "brand": "Crocs",
    "stars": 4.4,
    "reviewsCount": 31314,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71vQGwPH4VL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Sandals › Flip-Flops",
    "description": "Everybody needs a casual, basic flip — we’ve just made the Kadee II a little prettier. It has sleeker, slimmer straps and the Croslite foam cushion you love. It’s light, versatile and ready for fun whenever you are.",
    "price": {
      "value": 19.68,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B010123AFI"
  },
  {
    "title": "Crocs Women's Literide Pacer Lace-up Sneakers",
    "asin": "B074H9M1X7",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 12709,
    "thumbnailImage": "https://m.media-amazon.com/images/I/610ziDojhNL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Fashion Sneakers",
    "description": "Switch up the day’s plans and get invigorated with these superbly cushioned hybrid sneakers. Inspired by your evolving lifestyle, the LiteRide Collection was created to be worn on your terms, at any pace. Featuring LiteRide foam footbeds, the next breakthrough in world-class comfort, these are engineered to make you feel sensational with every step along the winding path.",
    "price": {
      "value": 36.21,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B074H9M1X7"
  },
  {
    "title": "Crocs Unisex-Adult Literide 360 Clogs",
    "asin": "B09621NXP5",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 4968,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61O+BFagsfL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Discover a new level of comfort and ease in these innovative clogs. In this next evolution of LiteRide, the plush LiteRide foam footbed delivers support and cushioning where your feet need it most. The Matlite Motion upper features perforation patterns that mimic the flexibility of a knit fabric, offering the ultimate in breathability and flexibility. Step into the world-class comfort and styling of these new LiteRide 360 Clogs and feel sensational and stylish wherever life takes you.",
    "price": {
      "value": 38.51,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09621NXP5"
  },
  {
    "title": "Crocs Men's and Women's Classic Slide Sandals | Slip On Shoes | Water Shoes",
    "asin": "B07B89KMF6",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 5971,
    "thumbnailImage": "https://m.media-amazon.com/images/I/618ql8HaqpL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Sandals › Slides",
    "description": "The ever-comfortable Classic Crocs Slide gets the customization upgrade fans have been asking for in the Classic Crocs Slide: holes for Jibbitz charms! Each slide has room for 13 charms so you can load up your sandals with tons of personality. Original Croslite foam cushion will keep you comfortably supported from the beach to backyard gatherings and beyond. Choose your color and slide into a new favorite!",
    "price": {
      "value": 22.54,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07B89KMF6"
  },
  {
    "title": "Crocs Women's Slingback Open Toe Sandals",
    "asin": "B07S642662",
    "brand": "Crocs",
    "stars": 4.1,
    "reviewsCount": 10469,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61FcslbTrgL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Sandals › Flats",
    "description": "Take a ride in a new kind of footwear. Inspired by today’s on-the-go lifestyle, the LiteRide Collection was created to be worn on your terms, at any pace. LiteRide foam footbeds, the latest breakthrough in world-class comfort, add to the comfort and style of the soft, stretchy asymmetrical straps. It’s time to feel sensational with every step along life’s winding path.",
    "price": {
      "value": 33.06,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07S642662"
  },
  {
    "title": "Crocs Unisex-Child Classic Tie Dye Clogs (Little Big Kid)",
    "asin": "B09642L43T",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 2879,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61-zCo1xkDL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Boys › Shoes › Clogs & Mules",
    "description": "Timeless, fun and full of peaceful good vibes, the bright pops of tie-dye graphics on these clogs are the perfect way to help your little one make a groovy style statement. Grounded in comfort, spiked with personality. From the playground to family outings, they’re ready to rock wherever the kids choose to roll.",
    "price": {
      "value": 11.7,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09642L43T"
  },
  {
    "title": "Under Armour Men's Charged Assert 9 Running Shoe",
    "asin": "B08CF5Y5M2",
    "brand": "Under Armour",
    "stars": 4.6,
    "reviewsCount": 34907,
    "thumbnailImage": "https://m.media-amazon.com/images/I/41l2imvuWJL.__AC_SX395_SY395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Athletic › Running › Road Running",
    "description": "These running shoes are built to help anyone go faster-Charged Cushioning® helps protect against impact, leather overlays add durable stability, and a mesh upper keeps your feet cool for miles.. Lightweight mesh upper with 3-color digital print delivers complete breathability. Durable leather overlays for stability & that locks in your midfoot. EVA sockliner provides soft, step-in comfort. Charged Cushioning® midsole uses compression molded foam for ultimate responsiveness & durability. Solid rubber outsole covers high impact zones for greater durability with less weight. Offset: 10mm. NEUTRAL: For runners who need a balance of flexibility & cushioning. Lace type: Standard tie.",
    "price": {
      "value": 49.97,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08CF5Y5M2"
  },
  {
    "title": "Crocs Unisex-Child Classic Clogs",
    "asin": "B07N89PB1W",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 108557,
    "thumbnailImage": "https://m.media-amazon.com/images/I/614GpLfQGvL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "Easy on, easy off! Just like the adult Classic, the kids’ version offers amazing comfort and support, thanks to the light, durable Croslite material and design. Kids can customize their Crocs clog however they like; ventilation holes accommodate Jibbitz brand charms.",
    "price": {
      "value": 16,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07N89PB1W"
  },
  {
    "title": "Crocs Men's and Women's Classic Realtree Clog | Camo Shoes",
    "asin": "B074F7J25J",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 53142,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81f1TNOr3CL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "Crocs Unisex Men's and Women's Classic Realtree Clog | Camo Shoes, Walnut, 12 Women/10 MenCrocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the crocs brand. All crocs brand shoes feature crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables crocs to produce soft, comfortable, lightweight, superior-gripping, non-marking and odor-resistant shoes. These unique elements make crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled crocs to successfully market its products to a broad range of consumers.",
    "price": {
      "value": 30.44,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B074F7J25J"
  },
  {
    "title": "Crocs Unisex-Child Crocband Clogs",
    "asin": "B096438HPR",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 7686,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71SWNYEI-7L._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "A sporty racing stripe adds a pop of color to Crocs’ iconic clogs. Made with lightweight, durable Croslite material, the contoured footbeds and outsoles deliver incredible comfort and support for whatever the day has in store.",
    "price": {
      "value": 14,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B096438HPR"
  },
  {
    "title": "Crocs Women's Kadee Ballet Flats",
    "asin": "B003XDXMDS",
    "brand": "Crocs",
    "stars": 4.5,
    "reviewsCount": 18069,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61uOtvxkyhL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Flats",
    "description": "The kadee printed flat is a versatile basic that’s anything but boring. Inspired by the classic ballerina flat silhouette, This modern style includes subtle toe box ventilation and three new graphic options, including two floral patterns and leopard print. Lightweight, easy-to-clean comfort with feminine styling? Perfect!.Love your crocs clogs for fun and comfort, but looking for something a bit more fashionable and feminine? Crafted from the same soft, lightweight material, the Kadee ballet flat features an airy and foot-flattering low-cut vamp with cut-out detail and a bumpy footbed designed to cushion and massage your feet. Wear with this cute shoe with denim, leggings or casual skirts and dresses for a breezy look.Crocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, and non-marking shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.See more",
    "price": {
      "value": 27.97,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B003XDXMDS"
  },
  {
    "title": "Crocs Unisex-Child Kids' Superhero Clog",
    "asin": "B09643T9QS",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 1542,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71giv802CWL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "It may not come with a cape, but your little one will feel like saving the world in these ones. This new clog featuring a DC Super Hero graphic patch is sure to become your little one's new favorite go-to shoe for school, play days and adventures of all kinds. Crocs Fun Lab styles feature original character-rich graphics and other inspired designs to help kids express themselves and engage new friends, resulting in more fun for the little ones.",
    "price": {
      "value": 37.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09643T9QS"
  },
  {
    "title": "Crocs Kid's Disney Clog | Mickey Mouse and Minnie Mouse Shoes",
    "asin": "B0979JJRW3",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 5258,
    "thumbnailImage": "https://m.media-amazon.com/images/I/718LjyU2-rL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "Disney’s Minnie Mouse has been charming fans of all ages for more than 90 years, and this new clog is the perfect day-to-day summer hit for the little Disney fan in your life. Crocs Fun Lab styles feature original character-rich graphics and other inspired designs to help kids express themselves and engage new friends, resulting in more fun for the little ones.",
    "price": {
      "value": 20,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0979JJRW3"
  },
  {
    "title": "Crocs Men's and Women's Literide Clog",
    "asin": "B07DFSRMRZ",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 45550,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61Es3xDVGAL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Take a ride in a superbly cushioned new kind of clog. Inspired by your evolving lifestyle, the LiteRide Collection was created to be worn on your terms, at any pace. Featuring LiteRide foam footbeds, the latest breakthrough in world-class comfort, these are engineered to make you feel sensational with every step along life’s winding path.",
    "price": {
      "value": 43.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07DFSRMRZ"
  },
  {
    "title": "Crocs Unisex-Adult Men's and Women's Baya Lined Fuzz Strap Clog",
    "asin": "B08H2GLP63",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 3010,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81nHOVjGaML._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Now you can take the popular Baya Clog that so many love straight through the chilly season. The Baya Lined Fuzz-Strap Clog has a plush, fuzzy lining with a fuzz-lined back strap to keep toes and heels toasty warm, indoors or out, which makes it a reliable cold-weather comfort shoe. Multiple color options make this the comfiest, most stylish solution for your chilly feet.",
    "price": {
      "value": 32.97,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08H2GLP63"
  },
  {
    "title": "Crocs Unisex-Adult Classic Sparkly Clog | Metallic and Glitter Shoes",
    "asin": "B097J2837Z",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 6279,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81e9KuztVuL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "The iconic clog that started a comfort revolution around the world receives a stylish metallic makeover! Still the irreverent go-to comfort shoe that you’re sure to fall deeper in love with day after day, Crocs Classic Clogs offer lightweight Iconic Crocs Comfort , a color for every personality, and an ongoing invitation to be comfortable in your own shoes.",
    "price": {
      "value": 39.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B097J2837Z"
  },
  {
    "title": "Crocs Men's and Women's Specialist II Vent Clog | Work Shoes",
    "asin": "B07CN6CR9C",
    "brand": "Crocs",
    "stars": 4.5,
    "reviewsCount": 13530,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81ZCAJQk4xL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Do your shoes live up to your career specialty? Everything that makes Crocs so comfortable works overtime in these clogs from our Crocs At Work Collection, now featuring ventilating ports around the toe box to increase airflow and drain water or debris. Crocs has added thicker construction at the toe and metatarsal areas, increased arch support, and nubbed Croslite foam footbeds that soothe with every step.",
    "price": {
      "value": 25.14,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07CN6CR9C"
  },
  {
    "title": "Crocs Kids' Mickey Mouse Clog | Disney Light Up Shoes",
    "asin": "B09641VVS1",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 840,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61Ig4HJhioL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Boys › Shoes › Clogs & Mules",
    "description": "Everyone's favorite talking mouse can be on your little one's shoes. It even features long-lasting LEDs that light up with every step. Crocs Fun Lab styles feature original character-rich graphics and other inspired designs to help kids express themselves and engage new friends, resulting in more fun for the little ones.",
    "price": {
      "value": 16.11,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09641VVS1"
  },
  {
    "title": "Crocs Unisex Men's and Women's Baya Graphic Clog",
    "asin": "B003BLPRL2",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 75044,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81vH+QBAkqL._AC_SY395_SX395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Make a comfy Crocs statement with the Crocs Baya Clog. A twist on the signature Classic Clog, it features the lightweight, durable build you love with advanced ventilation for breathability and to help drain water and debris.",
    "price": {
      "value": 29.49,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B003BLPRL2"
  },
  {
    "title": "Crocs Unisex-Adult Bayaband Clogs",
    "asin": "B077G94XTK",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 27256,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71kgEwRMHuL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "We took two of our most iconic clog silhouettes — baya and crocband — and combined them to create a special pair that elevates the sleek fashion-athletic spirit of the Originals to another level The result is a go-anywhere style staple that lets you slide in and stay cool while throwing off an extra pop of Crocs spirit.",
    "price": {
      "value": 33.4,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B077G94XTK"
  },
  {
    "title": "Crocs Unisex-Child Classic Littles Clogs |Baby Shoes",
    "asin": "B0BP5X3G2S",
    "brand": "Crocs",
    "stars": 4.5,
    "reviewsCount": 144,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71EUPaFmVsL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Baby › Baby Girls › Shoes › Clogs & Mules",
    "description": "Easy on, easy off! Just like the adult Classic, the kids’ version offers amazing comfort and support, thanks to the light, durable Croslite material and design. Kids can customize their Crocs clog however they like; ventilation holes accommodate Jibbitz brand charms.",
    "price": {
      "value": 19.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BP5X3G2S"
  },
  {
    "title": "Crocs Unisex-Adult Classic Clog (Retired Colors) | Slip on Water Shoes",
    "asin": "B0725RV7G2",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 77637,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71OvcmaovbL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Clog.Looking for the ultimate warm-weather shoe? Crocs' Classic clog has a ventilated upper and a traction outsole to make it a top wet-dry performer--perfect for the beach--but we can think of a zillion other places you'll want to wear it.Crocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, non-marking and odor-resistant shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.See more",
    "price": {
      "value": 29.35,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0725RV7G2"
  },
  {
    "title": "Crocs Women's Neria Pro Ii Clog | Slip Resistant Work Shoes",
    "asin": "B08PSW19X1",
    "brand": "Crocs",
    "stars": 4,
    "reviewsCount": 16691,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81liOUBVFDL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Who is Neria? She’s dependable and ready to make the rounds with protection and comfort every step of the way. This updated version includes removable, washable footbed liners. Designed for a relaxed fit — a little movement in the heel is normal — adding a dose of freedom without sacrificing the security of a closed shoe. Perfect for workers in healthcare, restaurant, retail and any other demanding, \"on-your-feet\" industry. Try Neria on your next shift or wherever the day takes you.",
    "price": {
      "value": 38.84,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08PSW19X1"
  },
  {
    "title": "Crocs Kids' Classic Clog",
    "asin": "B09643TSV7",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 27601,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71S0gx5fpYL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "Easy on, easy off! Just like the adult Classic, the kids’ version offers amazing comfort and support, thanks to the light, durable Croslite material and design. Kids can customize their Crocs clog however they like; ventilation holes accommodate Jibbitz brand charms.",
    "price": {
      "value": 16,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09643TSV7"
  },
  {
    "title": "Crocs Women's Mercy Work Clog | Work Shoes, Nurse Shoes, Chef Shoes",
    "asin": "B004029JWO",
    "brand": "Crocs",
    "stars": 3.7,
    "reviewsCount": 89,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71-ik3WciOL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Gemacht für Komfort bei der Arbeit. Geräumig durch Design wie der Original Classic Clog, bietet der Mercy Work Clog großzügigen Raum rund um den Fuß. Sie hat Crocs Lock-Profil für Rutschfestigkeit, einen Fersenumschmeichelnden Rückengurt und eine geschlossene Ferse.מיוצר לנוחות בעבודה. קבקב עבודה Mercy מרווח לפי עיצוב כמו הקבקב הקלאסי המקורי, מציע מקום נדיב מסביב לכף הרגל. הנעל כוללת נעל קרוקס לעמידות בפני החלקה, רצועה אחורית המחבקת עקב ועקב סגור.مصنوع من أجل الراحة أثناء العمل. فسيح من خلال التصميم مثل القبقاب الكلاسيكي الأصلي، يوفر حذاء ميرسي وورك مساحة واسعة حول القدم. يتميز بنعل كروكس لوك لمقاومة الانزلاق، وحزام خلفي يعانق الكعب وكعب مغلق.Feito para conforto no trabalho. Espaçoso por design como o clássico clog original, o tamanco Mercy Work oferece espaço generoso ao redor do pé. Possui sola Crocs Lock para resistência a escorregões, uma alça traseira que abraça o calcanhar e um salto fechado.专为工作时舒适而设计。 Mercy Work Clog 像原版经典洞洞鞋一样宽大的设计提供了宽敞的脚部空间。 它拥有 Crocs 卡骆驰 Lock 鞋底防滑、包覆鞋跟的背带和封闭式鞋跟。專為工作舒適而設計。 Mercy Work Clog 像原始經典木屐一樣寬敞的設計,四周提供寬敞的空間。 它有防滑的 Crocs Lock 胎面,一個擁抱鞋跟的背帶和一個封閉鞋跟。작업 중에도 편안하게 사용할 수 있도록 제작되었습니다. 오리지널 클래식 클로그와 같은 디자인의 넉넉한 Mercy Work 클로그는 발 전체에 넉넉한 공간을 제공합니다. 미끄럼 방지를 위한 크록스 락 트레드, 뒤꿈치를 감싸는 백스트랩, 닫힌 힐이 있습니다.Crocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, and non-marking shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.",
    "price": {
      "value": 31.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B004029JWO"
  },
  {
    "title": "Crocs Women's Classic Clog | Platform Shoes",
    "asin": "B097742CX9",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 4450,
    "thumbnailImage": "https://m.media-amazon.com/images/I/91-5QNnRzOL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "We created a style-relevant version of our Classic icon for her. Introducing the Classic Platform, featuring a heightened, contoured outsole that supports the upper you know and love with a slimmer, sleeker look — but there’s more. The customizable backstrap also holds Jibbitz charms, so you can personalize your look even more. When you’re in the mood for a little extra boost, style it up with the Classic Platform.",
    "price": {
      "value": 39.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B097742CX9"
  },
  {
    "title": "Crocs Men's Swiftwater Mesh Deck Sandals",
    "asin": "B0786QYJHY",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 12033,
    "thumbnailImage": "https://m.media-amazon.com/images/I/819FeQE1NXL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Sandals",
    "description": "A refreshing styling update meets these popular amphibious shoes. Stretchy mesh uppers keep you cool, the large ports help shed water and dirt, and channeled outsoles provide traction. Adjustable hook and loop straps offer a secure fit. Outdoor playtime just got seriously awesome.",
    "price": {
      "value": 43.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0786QYJHY"
  },
  {
    "title": "Crocs Unisex-Adult Classic Tie Dye Clogs",
    "asin": "B07JN5SQSQ",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 78213,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71AYNRI23IL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "Timeless, fun and full of peaceful good vibes, the bright pops of tie-dye graphics on these clogs are the perfect way to make a groovy style statement. On the go or just hangin’ out. Grounded in comfort, spiked with personality for all ages. From downtime to downtown, these are ready to rock wherever you choose to roll.",
    "price": {
      "value": 20,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07JN5SQSQ"
  },
  {
    "title": "Crocs Kid's Classic Realtree Clog | Camo Shoes",
    "asin": "B09642P1PS",
    "brand": "Crocs",
    "stars": 4.9,
    "reviewsCount": 11117,
    "thumbnailImage": "https://m.media-amazon.com/images/I/719JUt0FwAL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "The perfect footwear for any outdoorsy kid! This soft, lightweight clog gets the Realtree camouflage treatment. Made with light, supportive Croslite foam, the orthotic footbeds promise long-lasting comfort. Whether the kids are hanging out in camp or running around the house, they’ll love the support and ease of these clogs.",
    "price": {
      "value": 25.64,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09642P1PS"
  },
  {
    "title": "Crocs Men's Yukon Vista Ii Literide Clogs",
    "asin": "B088BD2HDZ",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 12297,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61EaEg3esKL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "Faux leather uppers and adjustable heel straps add a dose of ruggedness to the Men’s Classic Yukon Vista II Clogs. With a hook-and-loop closure system that also pivots forward, you’re free to choose between a hands-free slide or secured fit. Croslite foam outsoles and the superbly cushioned LiteRide footbeds can handle the outdoor elements while providing true comfort around the campfire, on the trail, or back home.",
    "price": {
      "value": 30,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B088BD2HDZ"
  },
  {
    "title": "Crocs Unisex-Child Classic Littles Clogs |Baby Shoes",
    "asin": "B00RGP9FHG",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 7055,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71nk54RT0AL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "Easy on, easy off! Just like the adult Classic, the kids’ version offers amazing comfort and support, thanks to the light, durable Croslite material and design. Kids can customize their Crocs clog however they like; ventilation holes accommodate Jibbitz brand charms.Crocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, non-marking and odor-resistant shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.",
    "price": {
      "value": 16.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B00RGP9FHG"
  },
  {
    "title": "Crocs Unisex-Adult Men's and Women's Classic Lined Clog | Fuzzy Slippers",
    "asin": "B078VWS71L",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 91808,
    "thumbnailImage": "https://m.media-amazon.com/images/I/616tYcfQz6L.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Everybody loves the comfort of the Crocs Classic Clog — and now there’s a toasty lined version to keep the feeling going all season. The soft, fuzzy liner adds to the cushion and comfort, indoors or out. Great as a slipper, yet capable to run errands, too. Croslite foam construction keeps them light and easy to wear. The pivoting heel strap gives you a secure fit, or push it forward to just step in and go.",
    "price": {
      "value": 37.53,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B078VWS71L"
  },
  {
    "title": "ASICS Men's Gel-Venture 7",
    "asin": "B07JWFYM25",
    "brand": "ASICS",
    "stars": 4.6,
    "reviewsCount": 41830,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61j3gD4AWHL.__AC_SX395_SY395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Athletic › Running › Trail Running",
    "description": "Take on the toughest terrain in confidence with the men's GEL-VENTURE 7 performance trail running shoe by ASICS. Featuring GEL technology and an EVA midsole, this shoe is made for athletes who love to run in the great outdoors. GEL technology in the rearfoot area of the shoe provides shock absorption where you need it most, while the ORTHOLITE sockliner provides an additional layer of cushioning underfoot. It even molds to the shape of your feet, making each run even more comfortable than the last. Extra support comes from the sturdy upper crafted from synthetic leather, while the internal heel counter gently helps your foot remain in its natural line of motion, making for a more efficient stride. Meanwhile the EVA midsole protects your feet against impact and increases rebound, giving you an energetic feeling as you clock up the miles. Durable and practical, the GEL-VENTURE 7 shoe makes an excellent training partner whether you're new to trail running or a seasoned pro.",
    "price": {
      "value": 34.75,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07JWFYM25"
  },
  {
    "title": "Crocs Unisex Adult Men's and Women's Bistro Clog | Slip Resistant Work Shoes",
    "asin": "B0010T3UV6",
    "brand": "Crocs",
    "stars": 4.5,
    "reviewsCount": 53831,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71iTBQ6XIML._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "Choose your culinary inspiration and serve up some serious comfort with these Bistro Clogs. Designed with food service, hospitality and healthcare workers in mind, they’re light and supportive enough to get you through even the longest shifts. Crocs Lock slip-resistant treads, extra protection at the toes, and a variety of color options come together to help you serve up your best.",
    "price": {
      "value": 28.55,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0010T3UV6"
  },
  {
    "title": "Crocs Unisex-Adult Classic Tie Dye Lined Clogs | Fuzzy Slippers",
    "asin": "B07L993LMH",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 9917,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71NGIBlA73L.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Mules & Clogs",
    "description": "Timeless, fun and full of peaceful good vibes, the bright pops of tie-dye graphics on these clogs are the perfect way to make a groovy style statement on the go or while you’re just hangin’ out. Snuggle-ready linings are sure to inspire warm and fuzzy feelings when the temperatures drop. Grounded in comfort, spiked with personality for all ages. From downtime to downtown, these are ready to rock wherever you choose to roll.",
    "price": {
      "value": 24.9,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07L993LMH"
  },
  {
    "title": "Crocs Unisex Crocband Flip Flops",
    "asin": "B002SNA7VY",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 76694,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61x0j2-AsuL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Sandals › Flip-Flops",
    "description": "Fully molded croc band styleCrocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, non-marking and odor-resistant shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.",
    "price": {
      "value": 17.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B002SNA7VY"
  },
  {
    "title": "Crocs Unisex-Adult Classic Marbled Tie-Dye Clog",
    "asin": "B0014C0LSY",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 415039,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81Vekenn4lL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "The Classic that started a comfort revolution around the world is a do-it-all style that you’re sure to fall deeper in love with day after day, and it’s time to go wild with bright animal graphics. Lifelong wardrobe staples beloved by millions of all ages, Crocs Classic Clogs offer lightweight Iconic Crocs Comfort , a color for every personality, and an ongoing invitation to be comfortable in your own shoes.Looking for the ultimate warm-weather shoe? Crocs' Classic clog has a ventilated upper and a traction outsole to make it a top wet-dry performer--perfect for the beach--but we can think of a zillion other places you'll want to wear it.Crocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, non-marking and odor-resistant shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.See more",
    "price": {
      "value": 28,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0014C0LSY"
  },
  {
    "title": "Crocs Unisex-Adult Classic Camo Clogs",
    "asin": "B089K8BH5V",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 5628,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61QXD+ym-AL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "It’s the iconic clog that started a comfort revolution around the world, now in an adventurous new camo print. Crocs Classic Clogs offer lightweight Iconic Crocs Comfort™, a print for every personality, and an ongoing invitation to be comfortable in your own shoes.",
    "price": {
      "value": 29.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B089K8BH5V"
  },
  {
    "title": "Crocs Women's at Work Ballet Flats| Slip Resistant Work Shoes",
    "asin": "B071P3PRNZ",
    "brand": "Crocs",
    "stars": 4.2,
    "reviewsCount": 6329,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61wC6rjFlML.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Flats",
    "description": "If you work on your feet all day, get more comfortable in the Kadee Work Flat. It’s based on one of Crocs’ most popular flats — it’s light, cushiony and made with Croslite foam for signature Crocs comfort. And it includes Crocs Lock slip-resistant tread to meet the demands of your job.",
    "price": {
      "value": 35.82,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B071P3PRNZ"
  },
  {
    "title": "Crocs Men's and Women's Crocband Clog",
    "asin": "B002JCST14",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 104969,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81MROkpW7IL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Mules & Clogs",
    "description": "The Crocband Collection features original Croslite foam construction for reliable cushioned comfort, a sporty design that’s easy to step into and out of, and a variety of energy-boosting colors and graphic designs. Show your stripes!",
    "price": {
      "value": 24.47,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B002JCST14"
  },
  {
    "title": "Crocs Unisex-Child Rain Boot",
    "asin": "B01HUVK2MW",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 27287,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71o70G1n4qL.__AC_SX395_SY395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Boots",
    "description": "Now kids can enjoy classic Crocs comfort — even on the rainiest days. This kids’ rain boot is available in bright colors with a waterproof build that keeps puddle-jumping feet cozy and dry. Plus, oversized handles make them easy for kids to put on and take off.",
    "price": {
      "value": 22.53,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B01HUVK2MW"
  },
  {
    "title": "Crocs Women's Literide 360 Pacer Sneakers",
    "asin": "B0961Z9JWM",
    "brand": "Crocs",
    "stars": 4.2,
    "reviewsCount": 2078,
    "thumbnailImage": "https://m.media-amazon.com/images/I/713NyiP9ngL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Fashion Sneakers",
    "description": "Go your own pace in these innovative and dynamic sneakers. In this next evolution of LiteRide, the plush LiteRide foam footbed delivers support and cushioning where your feet need it most. The Matlite Motion  upper features perforation patterns that mimic the flexibility of a knit fabric, offering the ultimate in breathability and flexibility. Step into the world-class comfort and styling of these new LiteRide 360 Pacers and feel sensational and stylish wherever life takes you.",
    "price": {
      "value": 33.29,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0961Z9JWM"
  },
  {
    "title": "Crocs Women's Brooklyn Low Wedges Sandal",
    "asin": "B07YQRHTG4",
    "brand": "Crocs",
    "stars": 4.6,
    "reviewsCount": 5440,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71NC3CKHUAL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Women › Shoes › Sandals › Platforms & Wedges",
    "description": "Effortless style, superior all-day comfort and ultimate wardrobe versatility come together in the new Crocs Brooklyn Collection. Available in a variety of heel heights and sophisticated yet simple silhouettes, each wedge features sensationally comfortable LiteRide foam technology inside — because you should never have to choose between looking and feeling your best. Crocs Brooklyn’s lightweight construction, intuitive upper straps and revolutionary comfort technology allow you to move confidently from work to play, up or downtown, without a fuss. When you can look fabulous and stay light on your feet from the day’s first step to the last, why would you settle for anything less?",
    "price": {
      "value": 39.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07YQRHTG4"
  },
  {
    "title": "Crocs Men's Santa Cruz Loafers",
    "asin": "B0017U7CIK",
    "brand": "Crocs",
    "stars": 4.7,
    "reviewsCount": 26271,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81qp3jVm9AL.__AC_SY395_SX395_QL70_FMwebp_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Men › Shoes › Loafers & Slip-Ons",
    "description": "This is a slip-on loafer you’ll love for everything from casual days in the office to easygoing outings around town. Built on a Croslite material sole with canvas uppers, the Men's Santa Cruz Slip-On is lightweight and offers all of the comfort you expect from Crocs.Crocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, non-marking and odor-resistant shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.",
    "price": {
      "value": 27.5,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0017U7CIK"
  },
  {
    "title": "Crocs Unisex-Child Classic Glitter Clog (Little Big Kid)",
    "asin": "B096KSLHT8",
    "brand": "Crocs",
    "stars": 4.8,
    "reviewsCount": 1458,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81yb24K7BPL._AC_SX395_SY395_.jpg",
    "breadCrumbs": "Clothing, Shoes & Jewelry › Girls › Shoes › Clogs & Mules",
    "description": "If your little one can’t seem to get enough glitter in his or her daily routine, these glittery clogs will be the perfect accent to their outfits. A brightly colored pair of socks will only up the adorability factor and earn them compliments during school, holiday events and any family outing. Sparkle away!",
    "price": {
      "value": 24.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B096KSLHT8"
  }
]
