[
  {
    "title": "Acer Nitro 5 AN517-55-72R4 Gaming Laptop | Intel Core i7-12700H | NVIDIA GeForce RTX 3050 Ti Laptop GPU | 17.3\" FHD 144Hz IPS Display | 16GB DDR4 | 1TB PCIe Gen 4 SSD | Killer Wi-Fi 6 | Red Backlit KB",
    "asin": "B089YCM116",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 5306,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71WyZCc9HYL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer gaming laptops deliver advanced performance for all gamers. The Nitro lineup of gaming PCs and accessories are ideal for casual gamers who are ready for something better. The Acer Nitro 5 AN517-55 is equipped with a beautiful 17.3 inch FHD 144Hz display to help you visualize the win. The NVIDIA GeForce RTX 3050 Ti laptop GPU supports 2nd Gen Ray Tracing Cores, 3rd Gen Tensor Cores, DLSS, Resizable BAR, Microsoft DirectX 12 Ultimate, and so much more. With Killer's DoubleShot Pro and Wi-Fi 6, get quicker matchmaking and never worry about disconnecting during a game. The Acer Nitro 5 12th Gen Intel Core i7 processing power enables impressive performance whether you're challenging your buddies to battle or focusing on a new hobby. This Acer Nitro laptop is configured with 16GB DDR4 RAM memory and 1TB PCIe Gen 4 solid-state drive storage space, and the ability to upgrade as needed. Use the HDMI 2.1 port for a monitor, use power-off USB charging, and get the best of USB with the USB-Type-C port. (NH.QG2AA.001).",
    "price": {
      "value": 1299.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B089YCM116"
  },
  {
    "title": "Acer Aspire 5 Notebook Laptop, 15.6 inch FHD Display, Intel Core i7-1165G7, 20GB RAM, 1TB PCIe SSD, Webcam, Backlit Keyboard, Fingerprint Reader, HDMI, Wi-Fi 6, Windows 11 Home, Black",
    "asin": "B0BP9LWT76",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 119,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71TXpNwdrsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Key Features and Benefits:CPU: Intel Core i7-1165G7 Processor (4 Cores, 8 threads, 12MB L3 Cache, base at 2.80GHz, up to 4.70GHz)Memory: Up to 36GB DDR4 RAMHard Drive: Up to 2TB PCIe NVMe M.2 Solid State Drive, or 1TB PCIe NVMe M.2 Solid State Drive + 1TB Hard Disk DriveOperating System: Windows 11 HomeDisplay: 15.6-inch FHDScreen Resolution: 1920 x 1080Backlit Keyboard: YesNumeric Keyboard: Yes (F8)Fingerprint Reader: YesPorts: 1 x USB 3.0 Type-C, 2 x USB 3.0 Type-A, 1 x USB 2.0 Type-A, 1 x HDMI, 1 x RJ-45, 1 x Headphone/microphone combo, 1 x AC smart pinGraphics: Iris Xe GraphicsMedia Drive: NoneOptical Drive: NoneWireless Connectivity: Wi-Fi 6 and Bluetooth comboPower supply: 45WWebcam: HDBluetooth: YesWeight: 3.60lbsColor: Black",
    "price": {
      "value": 759,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BP9LWT76"
  },
  {
    "title": "Acer 2022 15inch HD IPS Chromebook, Intel Dual-Core Celeron Processor Up to 2.55GHz, 4GB RAM, 32GB Storage, Super-Fast WiFi Up to 1300 Mbps, Chrome OS-(Renewed) (Dale Silver)",
    "asin": "B0B3L3YB4N",
    "brand": "Amazon Renewed",
    "stars": 4.4,
    "reviewsCount": 775,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71-QYvMpwGL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The product is refurbished and is fully functional. Backed by the 90-day Amazon Renewed Guarantee. - This pre-owned product has been professionally inspected, tested and cleaned by Amazon qualified vendors. - This product is in \"Excellent condition\". It shows no signs of cosmetic damage visible from a distance of 12 inches. - This product will have a battery that exceeds 80% capacity relative to new. - Accessories may not be original, but will be compatible and fully functional. Product may come in generic box. - This product is eligible for a replacement or refund within 90 days of receipt if it does not work as expected.",
    "price": {
      "value": 160.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B3L3YB4N"
  },
  {
    "title": "Acer Predator 17 Gaming Laptop, Core i7, GeForce GTX 1070, 17.3\" Full HD G-SYNC, 16GB DDR4, 256GB SSD, 1TB HDD, G9-793-79V5",
    "asin": "B01N6S4A2U",
    "brand": "Acer",
    "stars": 4.2,
    "reviewsCount": 171,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81SDAwjPZcL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Predator 17 G9-793-79V5 Gaming Notebook comes with these high level specs: 7th Generation Intel Core i7-7700HQ Processor 2.8GHz with Turbo Boost Technology up to 3.8GHz, 17.3\" Full HD (1920 x 1080) widescreen LED-backlit IPS display with NVIDIA G-SYNC technology, NVIDIA GeForce GTX 1070 with 8 GB of dedicated GDDR5 VRAM, 16GB DDR4 2400MHz Memory, 256GB SSD in RAID 0 configuration (2 x 128GB), 1TB SATA 7200 RPM Hard Drive, 8X DVD Double-Layer Drive RW (M-DISCTM enabled), Acer True Harmony Premium High-Performance Sound System, Four Built-in Stereo Speakers and Two Subwoofer, Built-in Digital Microphone, Secure Digital (SD) card reader, Killer Wireless-AC 1535 802.11ac Wi-Fi featuring 2x2 MU-MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.1, Killer Ethernet E2400 10/100/1000 Gigabit Ethernet LAN (RJ-45 port), Built-In HD Webcam, 1 - Thunderbolt 3 (Full USB 3.1 Type C) Port, 4 - USB 3.0 Ports (One with Power-off Charging), 1 - HDMI 2.0 Port with HDCP Support, 1 - Display 1.3 Port, 8-cell Li-ion Battery (6000 mash), Up to 3-hours Battery Life, 9.26 lbs. | 4.2 kg (system unit only) (NH.Q1TAA.001).",
    "price": {
      "value": 2100,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B01N6S4A2U"
  },
  {
    "title": "Acer Aspire 5 A515-56-347N Slim Laptop - 15.6\" Full HD IPS Display - 11th Gen Intel i3-1115G4 Dual Core Processor - 8GB DDR4 - 128GB NVMe SSD - WiFi 6 - Amazon Alexa - Windows 11 Home in S Mode",
    "asin": "B0BL86VM7F",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 4161,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71pvhTrmZDL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "It's all about the innovation. Acer products are designed for your needs and accessibility with powerful features fit for your lifestyle. The Aspire 5 packs a lot of power into the portable design to suit the multi-tasking needs of you and your family. Break the boundaries of performance every time you fire up Acer’s new Aspire 5, which features the latest 11th Gen Intel Core i3 processor and faster Wi-Fi 6 connectivity for an awesome computing experience. This finely tuned design offers unmatched speed and reliability, making it ideal for things like photo and video editing, gaming, and work-related functionality. The narrow-bezel design provides plenty of screen so you can focus on what's in front of you, while the Full HD IPS display ensures crisp, true-to-life colors! With Windows 11 Home in S mode, you’ll experience fast start-ups, a familiar yet expanded Start menu, and great new ways to get stuff done. And with automatic updates enabled, you get all the latest features and security hassle-free. Work, play and share all in one device! (NX.AASAA.005)",
    "price": {
      "value": 349.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BL86VM7F"
  },
  {
    "title": "Acer Aspire 5 A515-46-R3UB | 15.6\" Full HD IPS Display | AMD Ryzen 3 3350U Quad-Core Mobile Processor | 4GB DDR4 | 128GB NVMe SSD | WiFi 6 | Backlit KB | FPR | Amazon Alexa | Windows 11 Home in S mode",
    "asin": "B09HVC79PC",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 39503,
    "thumbnailImage": "https://m.media-amazon.com/images/I/7189iXimfWL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "It's all about the innovation. Acer products are designed for your needs and accessibility with powerful features fit for your lifestyle. The Aspire 5 packs a lot of power into the portable design to suit the multi-tasking needs of you and your family. The desktop-class performance of this Acer Aspire 5 laptop with an AMD Ryzen 3 processor boosting performance while giving you amazing battery life. Enjoy photo and video editing on the color-rich 15.6-inch Full HD IPS display with AMD Radeon Vega 6 Graphics. All your creations and files stay secure with the bio-protected fingerprint reader and Windows Hello Certification ensuring protected access to your Acer Aspire 5. You can turn this Acer Aspire 5 into a virtual meeting room with an HD webcam and dual built-in microphones using Acer Purified.Voice Technology to carry your conversation clearly. Whether video chatting, streaming entertainment, or working in the home office, you'll stay connected to your network with dual-band Wi-Fi 6 working intelligently with your router to increase network efficiency. (NX.ABRAA.007).The product is multiple voltage compatible, that voltage arrange is 100-240V.",
    "price": {
      "value": 299.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09HVC79PC"
  },
  {
    "title": "Acer Aspire 15.6” Laptop (Latest Model), Full HD IPS Display, Intel Core i3-1115G4, 20GB RAM, 1TB SSD, RJ-45 Ethernet Port, USB Type-C, Wi-Fi 6, HDMI, NLY MP, Windows 11",
    "asin": "B0BKK6RDD7",
    "brand": "Acer",
    "stars": 4.6,
    "reviewsCount": 5,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71t+QUMoFPL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: 11th Generation Intel Core i3-1115G4 Processor (Dual-Core, 3.0 GHz Up to 4.1 GHz, 6 MB Cache)Graphics: Intel UHD GraphicsOperating system: Windows 11 in S mode, How to switch s mode to windows 11 On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation. In Switch to Windows 11 Home, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.) On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.Memory: 20GB DDR4 SDRAMHard Drive: 1TB Solid State DriveDisplay: 15.6\" Full HD (1920 x 1080) widescreen LED-backlit DisplayOptical Drive: NoWLAN Connectivity: IEEE 802.11ax | Gigabit Ethernet | Bluetooth 5.1Audio: Stereo Dual speakersKeyboard: Ergonomically-designed hinge lifts the keyboard for comfortable typing, improved cooling, and a better sound experience, with numeric keypadBuilt-in HD Webcam: HP TrueVision HD Camera with integrated dual array digital microphonesPorts: 1 USB 3.2 Gen 1 Type-C ; 2 USB 3.2 Gen 1 Type-A (Data Transfer Only); 1 AC smart pin; 1 HDMI 2.0; 1 headphone/microphone comboColor: SilverDimensions L x W x H (inches): ‎14.31 x 9.39 x 0.7 inchesWeight: 4.19 lb",
    "price": {
      "value": 499.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BKK6RDD7"
  },
  {
    "title": "ASUS Chromebook CX1, 11.6\" HD NanoEdge Display, Intel Celeron N3350 Processor, 32GB eMMC,  4GB RAM, Chrome OS, Transparent Silver, CX1100CNA-AS42",
    "asin": "B08XTB1NNH",
    "brand": "ASUS",
    "stars": 4.2,
    "reviewsCount": 1239,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81eGCvMr3uS._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "ASUS Chromebook CX1100 is made for boosting productivity and having more fun while on the move — all day, every day. This lightweight, ultraportable device is powered by Intel processor and gives you the freedom of up to 12-hour battery life. The slim-bezel design fits more screen into the compact chassis for easy multitasking and incredibly immersive entertainment, and the device is your gateway to the best of Google, including the rich library of apps for work or play on the Google Play Store. With speedy performance, robust security and intuitive features, ASUS Chromebook CX1 is ideal for anyone on the go!",
    "price": {
      "value": 79.68,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08XTB1NNH"
  },
  {
    "title": "Acer Aspire 5 A515-56-32DK Slim Laptop - 15.6\" Full HD IPS Display - 11th Gen Intel i3-1115G4 Dual Core Processor - 4GB DDR4 - 128GB NVMe SSD - WiFi 6 - Amazon Alexa - Windows 11 Home in S mode.",
    "asin": "B09R5VYRVN",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 4161,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71pvhTrmZDL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "It's all about the innovation. Acer products are designed for your needs and accessibility with powerful features fit for your lifestyle. The Aspire 5 packs a lot of power into the portable design to suit the multi-tasking needs of you and your family. Break the boundaries of performance every time you fire up Acer’s new Aspire 5, which features the latest 11th Gen Intel Core i3 processor and faster Wi-Fi 6 connectivity for an awesome computing experience. This finely tuned design offers unmatched speed and reliability, making it ideal for things like photo and video editing, gaming, and work-related functionality. The narrow-bezel design provides plenty of screen so you can focus on what's in front of you, while the Full HD IPS display ensures crisp, true-to-life colors! With Windows 11 Home in S mode, you’ll experience fast start-ups, a familiar yet expanded Start menu, and great new ways to get stuff done. And with automatic updates enabled, you get all the latest features and security hassle-free. Work, play and share all in one device!",
    "price": {
      "value": 269.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09R5VYRVN"
  },
  {
    "title": "Acer Predator Helios 300 Gaming Laptop, 15.6\" FHD 144Hz 3ms IPS Display, Core i7-11800H, GeForce RTX 3060, 32GB 3200MHz RAM, 1TB PCIe SSD, Thunderbolt 4, HDMI, Mini DP, RJ45, WiFi 6, RGB KB, Win 11",
    "asin": "B0B6KX822X",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 11,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61B2PK2y7SL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The computer is professionally upgraded and customized. The manufacturer box will be opened by our professional engineers for customizing and testing. Factory defects & blemishes are significantly reduced by our in-depth inspection & testing. We offer a 12-month warranty, please feel free to contact us if you need any support from our team. Processor Model Core i7-11800H  # of Cores 8  Max Turbo Frequency Up to 4.60 GHz  Processor Base Frequency 2.30 GHz  Dedicated Graphics GeForce RTX 3060 6GB  Integrated Graphics UHD Graphics  Display 15.6\" Full HD (1920 x 1080) IPS 144Hz 3ms SlimBezel 72%NTSC display  Interface 1 x Thunderbolt 4 3 x USB Type-A 1 x HDMI 1 x RJ45 1 x mini DP 1 x Audio combo jack  Connectivity Wi-Fi 6 + BT  Operating System Windows 11  Others Dimensions: ‎14.31 x 10.04 x 0.9 inch Weight: 5.07 lbs",
    "price": {
      "value": 1359,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B6KX822X"
  },
  {
    "title": "Acer Aspire 5 A517-52-75N6 Laptop | 17.3\" Full HD IPS Display | 11th Gen Intel Core i7-1165G7 | Intel Iris Xe Graphics | 16GB DDR4 | 512GB SSD | WiFi 6 | Fingerprint Reader | BL Keyboard | Windows 11",
    "asin": "B09JHGHF7Y",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 31,
    "thumbnailImage": "https://m.media-amazon.com/images/I/710nRkDlreL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Aspire 5 A517-56-75N6 comes with these high level specs: 11th Generation Intel Core i7-1165G7 Processor 2.8GHz with Turbo Boost Technology up to 4.7GHz (12MB Smart cache), Windows 11 Home, 17.3\" Full HD (1920 x 1080) widescreen LED-backlit IPS Display, Intel Iris Xe Graphics, 16GB DDR4 Memory, 512GB NVMe SSD, 1 - Available Hard Drive Bay, True Harmony Technology, Two Built-in Stereo Speakers, Acer Purified.Voice Technology with Two Built-in Microphones, 802.11ax Wi-Fi 6 Dual-Band 2.4GHz and 5GHz featuring 2x2 MU-MIMO technology, 10/100/1000 Gigabit Ethernet LAN (RJ-45 port), Bluetooth 5.1, Back-lit Keyboard, Acer Fingerprint Reader supporting Windows Hello, HD Webcam (1280 x 720), 1 - USB 3.2 (Type-C) Gen 1 port (up to 5 Gbps), 2 - USB 3.2 Gen 1 Port (one with Power-off Charging), 1 - USB 2.0 Port, 1 - HDMI Port with HDCP support, Lithium-Ion Battery, Up to 8-hours Battery Life, 4.72 lbs. | 2.14 kg (system unit only) (NX.A5CAA.00E)",
    "price": {
      "value": 728,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09JHGHF7Y"
  },
  {
    "title": "Acer Chromebook Spin 511 2-in-1 with Intel Celeron N4000 1.1GHz (11.6-inch, 4GB RAM, 32GB Flash) Black (Renewed)",
    "asin": "B081Z7PGWQ",
    "brand": "Amazon Renewed",
    "stars": 4.8,
    "reviewsCount": 12,
    "thumbnailImage": "https://m.media-amazon.com/images/I/41qbOTfKg5L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Acer Chromebook Spin 511 is the ideal laptop for education. With its 4-usage modes, world-facing camera, state-of-the art low power processor, military standard specs and a long battery life it’s ideal for all educational establishments.",
    "price": {
      "value": 78.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B081Z7PGWQ"
  },
  {
    "title": "Newest Acer Aspire 5 15.6\" FHD Laptop Computer Ryzen 3 3350U Quad-Core Mobile Processor 16GB RAM 512GB SSD, Backlit KB, Fingerprint Reader, WiFi6, HDMI, Windows 11 S Model , E.S 32GB USB Card",
    "asin": "B08C7P8WNK",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 120,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71qmmfeibgL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Display:15.6\" FHD LCD Display, 1920 x 1080 resolution boasts impressive color and clarity, Anti-glare Energy-efficient LED screen. Processor:AMD Ryzen 3-3350U Processor, Ultra-low-voltage platform. Dual-core, four-way processing provides maximum high-efficiency power to go. Memory RAM:Upgraded 16GB DDR4 RAM, Plenty of high-bandwidth RAM to smoothly run your games as well as multiple programs. Storage Drive:Upgraded512GB PCIe SSD Save files fast and store more data. With plenty of storage and advanced communication power, great for major gaming, multiple servers, backups, and more. Graphics:AMD Radeon Vega 6 Graphics with shared video memory provide image quality for Internet use, photo editing and casual gaming. Keyboard:Backlit Full keyboard with 10-key numeric keypad, allows you to enjoy comfortable and accurate typing. Audio:Dolby Audio with Stereo speakers deliver breathtaking, three-dimensional audio that flows above and around you with depth and precision. Webcam:Built-in 0.3MP Webcam with microphone with microphone makes it easy to video chat with family, friends or teleconference over popular applications. Battery:3-cell lithium-ion Dimensions (WxDxH)14.3\" x 10\" x 0.8\" Weight:4.1 lbs Color:Platinum Gray Ports:2x USB 3.1 Type A Ports, 1x USB 2.0 Type A Port, 1x HDMI 1.4 Output, 1x headphone/microphone combo jack, 1x Media card reader Network: Wireless-AC",
    "price": {
      "value": 499,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08C7P8WNK"
  },
  {
    "title": "Acer Chromebook Spin 311 Convertible Laptop | Intel Celeron N4000 | 11.6\" HD Touch Corning Gorilla Glass Display | 4GB LPDDR4 | 64GB eMMC | Intel 802.11ac Gigabit WiFi 5 | Chrome OS | CP311-2H-C7QD",
    "asin": "B08NTP5RTN",
    "brand": "Acer",
    "stars": 4.6,
    "reviewsCount": 11302,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71c5W9NxN5L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Chromebook Spin 311 CP311-2H-C7QD Convertible Laptop comes with these high level specs: Intel Celeron N4000 Dual-Core Processor 1.1GHz with Intel Burst Technology up to 2.6GHz (4MB L2 cache), Chrome OS, 11.6\" HD 1366 x 768 resolution, high-brightness, LED-backlit IPS (In-Plane Switching) technology with Antimicrobial Corning Gorilla Glass multi-touch, supporting finger touch and image auto rotation (16:9 aspect ratio), Intel UHD Graphics 600, 4GB LPDDR4 On-Board Memory, 64GB eMMC, Intel Wireless-AC 9560 802.11ac Gigabit WiFi 5 which can deliver up to 1.73Gbps throughput when using 160Mhz channels (Dual-Band 2.4GHz and 5GHz), Bluetooth 5.0, HD Webcam (1280 x 720) 88-Degree Wide Angle Lens supporting High Dynamic Range (HDR), Two Built-in Stereo Speakers, Two Built-in Microphones, 2 - USB Type-C ports USB 3.1 Gen 1 (up to 5 Gbps) DisplayPort over USB Type-C & USB Charging, 2 - USB 3.1 Gen 1 ports, Lithium-Ion Battery, Up to 10-hours Battery Life, 2.62 lbs. | 1.09 kg (system unit only) (NX.HKKAA.006).",
    "price": null,
    "url": "https://www.amazon.com/dp/B08NTP5RTN"
  },
  {
    "title": "Acer Nitro 5 Gaming Laptop, 10th Gen Intel Core i5-10300H,NVIDIA GeForce GTX 1650 Ti, 15.6\" Full HD IPS 144Hz Display, 8GB DDR4,256GB NVMe SSD,WiFi 6, DTS X Ultra,Backlit Keyboard,AN515-55-59KS",
    "asin": "B08H2H89K1",
    "brand": "Acer",
    "stars": 4.6,
    "reviewsCount": 1694,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81Z8NvO2TFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "\"Acer Nitro 5 AN515-55-59KS Gaming Laptop comes with these high level specs: 10th Generation Intel Core i5-10300H Processor 2.5GHz with Turbo Boost Technology up to 4.5GHz, 15.6\"\" Full HD (1920 x 1080) widescreen LED-backlit IPS display, NVIDIA GeForce GTX 1650 Ti with 4GB of dedicated GDDR6 VRAM, 8GB DDR4 2933MHz Memory, 256GB NVMe SSD (2 x PCIe M.2 Slots 1 Slot Available), 1 - Available Hard Drive Bay, DTS: X Ultra Audio, Acer True Harmony Technology, Two Built-in Stereo Speakers, Acer Purified.Voice technology with two built-in microphones, Intel Wireless Wi-Fi 6 AX201 802.11ax Dual-Band 2.4GHz and 5GHz featuring 2x2 MU-MIMO technology (Max Speed up to 2.4Gbps), Killer Ethernet E2600 10/100/1000 Gigabit Ethernet LAN, HD Webcam (1280 x 720) supporting Super High Dynamic Range (SHDR), 1 - USB 3.2 Type C Gen 2 port (up to 10 Gbps), 1 - USB 3.2 Gen 2 Port (Feauring Power-off Charging), 2 - USB 3.2 ports, 1 - HDMI 2.0 Port with HDCP Support, Backlit Keyboard, Lithium Polymer Battery, Up to 9-hours Battery Life, 5.07 lbs. 2.3 kg (system unit only) (NH.Q7JAA.009)\".",
    "price": {
      "value": 699,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08H2H89K1"
  },
  {
    "title": "Acer Swift 5 Intel Evo Thin & Light Laptop | 14\" WXGA IPS 100% sRGB Touch | 12th Gen Intel i7-1260P | Intel Iris Xe Graphics | 16GB LPDDR5 | 1TB Gen 4 SSD | Killer HDMI,Wi-Fi 6E AX1675 |SF514-56T-797T",
    "asin": "B09TCH74C1",
    "brand": "Acer",
    "stars": 4,
    "reviewsCount": 4,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71NkCJwRoNL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Swift 5 carries immense power and outstanding thermal design within a premium, aerospace-grade aluminum chassis, which harnesses the time-tested performance of the Intel Evo 12th Gen lntel Core processor inside to deliver a stellar computing experience. Super thin and light, this PC has a 14” WQXGA IPS touch display with an incredible 92.22% screen-to-chassis ratio. It features amazing graphics and antimicrobial Corning Gorilla Glass touch display to ensure the utmost in computing protection. Simply put, the Swift 5 notebook is the perfect companion to take anywhere! (NX.K0HAA.001).",
    "price": {
      "value": 1199.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09TCH74C1"
  },
  {
    "title": "Acer Swift 3 Intel Evo Thin & Light Laptop, 13.5\" 2256 x 1504 IPS, Intel Core i7-1165G7, Intel Iris Xe Graphics, 8GB LPDDR4X, 512GB NVMe SSD, Wi-Fi 6, Fingerprint Reader, Back-lit KB, SF313-53-78UG",
    "asin": "B08P5724PZ",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 86,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71yzH5zadZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Swift 3 SF313-53-78UG comes with these high level specs: 11th Generation Intel Core i7-1165G7 Processor 2.8GHz with Turbo Boost Technology up to 4.7GHz (12MB Smart Cache), Windows 10 Home, 13.5\" Acer VertiView 2K 2256 x 1504 Widescreen IPS LED-backlit Display (3:2 aspect ratio), Intel Iris Xe Graphics, 8GB LPDDR4X Onboard Memory, 512GB NVMe SSD, DTS Audio, featuring optimized bass response and micro-speaker distortion prevention, Two built-in front facing stereo speakers, Acer Purified.Voice technology with two built-in microphones, Intel Wireless Wi-Fi 6 AX201 802. 11ax Dual-Band 2.4GHz and 5GHz featuring 2x2 MU-MIMO technology (Max Speed up to 2.4Gbps), Bluetooth 5.1, Back-lit Keyboard, Acer Bio-Protection Fingerprint Solution, featuring Computer Protection and Windows Hello Certification, HD Webcam (1280 x 720) supporting Super High Dynamic Range (SHDR), 1 - USB Type-C Port USB 3.2 Gen 2 (up to 10 Gbps) DisplayPort over USB Type-C, Thunderbolt 4 & USB Charging, 2 - USB 3.2 Gen 1 port (one featuring power-off charging), 1 - HDMI 2.0 port, Lithium-Ion Battery, Up to 14-hours Battery Life, 2.62 lbs. | 1.19 kg (system unit only) (NX.A4KAA.003)",
    "price": {
      "value": 592.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08P5724PZ"
  },
  {
    "title": "Lenovo - 2022 - IdeaPad Flex 5i - 2-in-1 Chromebook Laptop Computer - Intel Core i3-1115G4 - 13.3\" FHD Touch Display - 8GB Memory - 128GB Storage - Chrome OS",
    "asin": "B09RNCN3YV",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 658,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81uDDuBAwpL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Hit the ground running with the IdeaPad Flex 5i Chromebook, one of the most versatile Chromebooks on the market. This 13\" notebook computer merges accessibility with power, with an 11th Generation Intel® Core™ i3 processor to handle even the most arduous tasks without a hint of strain. With the slim and light 360° convertible design, you can use it as a laptop, in tablet mode for an intuitive touchscreen experience, or in stand or tent mode to show off your latest photo slideshow or stream your favorite movies. The 10 hours* of battery life means that you can take it with you wherever you go without worry while playing games or browsing the Internet via WiFi. The IdeaPad Flex 5i Chromebook is designed with a physical privacy shutter. When you're not on a video call, simply slide the shutter over the webcam to secure your privacy. And as a Chromebook, you can quickly access all your files, photos, music, and more with ease – just login to your Google account and you're ready to go! Talk to Google to help you multitask, control your smart home devices, and manage your day. Stay connected with built-in WiFi and Bluetooth®, 2 USB-C ports, a USB-A port, a microSD™ card reader, and an audio combo jack.* Battery life based on testing with PLT (power load test). Battery life varies significantly with settings, usage, and other factors.",
    "price": {
      "value": 299.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09RNCN3YV"
  },
  {
    "title": "Acer Aspire 5 A515-56 Slim Laptop 15.6\" Full HD IPS LCD Intel i3-1115G4 Processor 4GB DDR4 128GB NVMe SSD WiFi 6 Amazon Alexa Windows 11 Home in S Mode (Renewed)",
    "asin": "B0BNWBJ5LG",
    "brand": "Amazon Renewed",
    "stars": 5,
    "reviewsCount": 1,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71pvhTrmZDL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
    "price": {
      "value": 239.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BNWBJ5LG"
  },
  {
    "title": "Acer Swift 3 SF314-43-R6NE Laptop | 14\" Full HD IPS | AMD Ryzen 7 5700U Octa-Core Processor | AMD Radeon Graphics | 16GB LPDDR4X | 512GB SSD | Wi-Fi 6 | Fingerprint Reader | Backlit KB | Windows 11",
    "asin": "B0BCMF8MNM",
    "brand": "Acer",
    "stars": 3.6,
    "reviewsCount": 4,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71Q9lRFU4VL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "It's all about the innovation. Acer products are designed for your needs and accessibility with powerful features fit for your lifestyle. The Acer Swift 3 SF314-43 laptop is a sleek machine ready for a full day. This Acer laptop is designed to be lightweight at under 3 pounds and is designed with an all-metal aluminum chassis for your carrying convenience. With a powerful AMD Ryzen 5000 Series Mobile Processor, you never have to worry about your PC keeping up with your work-related tasks. The impressive 14 inch Full HD display has a 16:9 aspect ratio for widescreen entertainment on a portable Swift 3 laptop. You can take on whatever the day brings when the latest Acer Swift laptop is your companion. In a day full of appointments and meetings, rely on the long 12.5 hour battery life from a full charge. Need more? A short 30 minute charge gives you 4 hours of video playback, and even when switched off, the Swift 3 can charge external devices through the USB Type-A port. When you're connecting at home, a public workspace, or a cafe, you can expect a fast and reliable dual-band Wi-Fi 6 connection. With a full day of productivity and entertainment ahead, the Acer Swift 3 14\" laptop can maximize cooling efficiency with a stereo ring fan that draws in a larger volume of air and a wider air vent that delivers 5–10% improvement in airflow. The air inlet keyboard expels 8–10% more heat. When you need quiet, choose the Silent fan mode that gives you cooling action at a low volume. Normal and Performance modes up the cooling efficiency of this Acer Swift 3 notebook. (NX.AB1AA.00B).",
    "price": {
      "value": 799.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BCMF8MNM"
  },
  {
    "title": "Acer 2022 Nitro 5 Gaming Laptop, 17.3\" FHD IPS 144Hz, 12th Gen 12-Core i5-12500H, GeForce RTX 3050, 16GB RAM, 512GB PCIe SSD, Thunderbolt 4, HDMI, RJ45, WiFi 6, Backlit, SPS HDMI 2.1 Cable, Win 11",
    "asin": "B0BM2WZ7QW",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 12,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61KRr2aPxaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The computer is professionally upgraded and customized. The manufacturer box will be opened by our professional engineers for customizing and testing. Factory defects & blemishes are significantly reduced by our in-depth inspection & testing. We offer a 12-month warranty, please feel free to contact us if you need any support from our team.Processor ModelIntel Core i5-12500H# of Cores12Max Turbo FrequencyUp to 4.50 GHzEfficient-core Max Turbo Frequency3.30 GHzDedicated GraphicsGeForce RTX 3050Display17.3 inch FHD (1920 x 1080) IPS 144Hz SimBezelInterface1 x Thunderbolt 43 x USB Type-A1 x HDMI1 x RJ45ConnectivityWiFi 6 + BluetoothOperating SystemWindows 11 HomeOthersDimensions: ‎15.77\" x 11.59\" x 1.1\"Weight: 6.6 lbs",
    "price": {
      "value": 869.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BM2WZ7QW"
  },
  {
    "title": "2022 Newest Acer 311 Chromebook Laptop Student Business, MediaTek MT8183C 8-Core Processor,11.6\" HD Display, 4GB RAM, 32GB eMMC, Wi-Fi 5, Bluetooth 5, Upto 15 Hours Battery, Chrome OS +MarxsolCables",
    "asin": "B09RDQGTT8",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 106,
    "thumbnailImage": "https://m.media-amazon.com/images/I/7183K6XIaeL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The 2022 Newest Acer Chromebook 311 is the ideal laptop for all ages from the very young upwards. Weighing in at just 2.2lbs., it’s ultra-light and easily transported in a backpack or bag. The power efficient MediaTek MT8183C processor and generous battery give it up to 15 hours of battery life, meaning a full charge will easily last the working day and all evening.DisplayScreen Size:11.6 inchesScreen Resolution:1366 x 768 (HD)Touch Screen:NoProcessorProcessor: MediaTek MT8183C Processor, Ultra-low-voltage platform. Octal-core, eight-way processing provides maximum high-efficiency power to go.StorageStorage Type:eMMCTotal Storage Capacity:32 GBeMMC Capacity:32 GBMemorySystem Memory (RAM):4 GBType of Memory (RAM):LPDDR4XGraphics: MediaTek Integrated Graphics provide solid image quality for Internet use, movies, basic photo editing and casual gaming.Keyboard: Standard keyboard, Allows you to enjoy comfortable and accurate typing.CompatibilityOperating System:Chrome OSConnectivityInternet Connectivity:Wi-FiBluetooth Enabled:YesNumber of USB 2.0 Type A Ports:1Number of USB 2.0 Type C Ports:1PowerBattery Life (up to):15 hoursBattery Type:Lithium-ionCameraFront-Facing Camera:YesFront Facing Camera Video Resolution:720pBuilt-In Microphone:YesAccessory:MarxsolCable Accessories ($39.99 Value)",
    "price": {
      "value": 179,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09RDQGTT8"
  },
  {
    "title": "Acer Nitro 5 AN515-58-725A Gaming Laptop | Intel Core i7-12700H | NVIDIA GeForce RTX 3060 GPU | 15.6\" FHD 144Hz 3ms IPS Display | 16GB DDR4 | 512GB Gen 4 SSD | Killer Wi-Fi 6 | RGB Keyboard",
    "asin": "B09TWYSVPM",
    "brand": "Acer",
    "stars": 4.6,
    "reviewsCount": 5263,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71SCp57uORL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer gaming laptops deliver advanced performance for all gamers. The Nitro lineup of gaming PCs and accessories are ideal for casual gamers who are ready for something better. The Acer Nitro 5 AN515-58 is equipped with a beautiful 15.6 inch FHD 144Hz 3ms display to help you visualize the win. The latest NVIDIA GeForce RTX 3060 laptop GPU supports 2nd Gen Ray Tracing Cores, 3rd Gen Tensor Cores, DLSS, Resizable BAR, Microsoft DirectX 12 Ultimate, and so much more. With Killer's DoubleShot Pro and Wi-Fi 6, get quicker matchmaking and never worry about disconnecting during a game. The Acer Nitro 5 12th Gen Intel Core i7 processing power enables impressive performance whether you're challenging your buddies to battle or focusing on a new hobby. This Acer Nitro laptop is configured with 16GB DDR4 RAM memory and 512GB PCIe Gen 4 solid-state drive storage space, and the ability to upgrade as needed. Use the HDMI 2.1 port for a monitor, use power-off USB charging, and get the best of USB with the USB-Type-C port. (NH.QFMAA.003).",
    "price": {
      "value": 1357.23,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09TWYSVPM"
  },
  {
    "title": "Dell Inspiron 14 5420 14 inch Student Laptop - 2.2K Display, Intel Core i7-1255U, 16GB DDR4 RAM, 512GB SSD, NVIDIA GeForce MX570, HDMI, USB-C, Bluetooth, Wi-Fi 6, Windows 11 Pro - Silver",
    "asin": "B09VCSW1N1",
    "brand": "Dell",
    "stars": 4.3,
    "reviewsCount": 113,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71o41XLXydL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Inspiron 14 5420 14 inch student laptop features an Intel Core i7-1255U processor that is optimized for fast and smooth performance to keep you connected to what matters most. With a fluid dynamic bearing system, your lightweight laptop's fan is not only long-lasting, but it also runs quietly while keeping your device performing at its best. Our all-new mechanical camera shutter protects against anyone invading your privacy or accidental embarrassments on video calls; so you can read, watch, or chat all day with peace of mind. Your always-ready experience starts as soon as you open your device. Turn on, boot-up, and log-in quickly. A lid-open sensor gets this small laptop started when opened, even if completely off or hibernating, and an optional fingerprint reader will verify identity quickly for login using Windows Hello. ExpressCharge minimizes the time you spend tethered to an outlet and will recharge your battery in a flash.",
    "price": {
      "value": 930,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09VCSW1N1"
  },
  {
    "title": "Acer Predator Helios 300 PH315-54-760S Gaming Laptop | Intel i7-11800H | NVIDIA GeForce RTX 3060 GPU | 15.6\" FHD 144Hz 3ms IPS Display | 16GB DDR4 | 512GB SSD | Killer WiFi 6 | RGB Keyboard",
    "asin": "B092YHJLS6",
    "brand": "Acer",
    "stars": 4.6,
    "reviewsCount": 3622,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71nz3cIcFOL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer gaming laptops deliver advanced performance for all gamers. The Predator lineup of gaming PCs and accessories are ideal for everyday gamers who need powerful products that can handle daily use and overclocking. The Acer Predator Helios 300 PH315-54 is powered up with the latest 11th Generation Intel Core i7 processor, giving you power, speed, and intelligent processing when you need it most. The new NVIDIA GeForce 30 Series graphics card is powered by award-winning Ampere architecture, and boasts new Ray Tracing cores, Tensor cores, and streaming multiprocessors for realistic graphics. The incredibly fast 144Hz refresh rate will keep up with your beautiful graphics in crisp Full HD for high-octane gameplay. When you're playing online, Intel Killer DoubleShot Pro keeps you connected to your match or chatroom by allowing your Predator laptop to use both Ethernet and Wi-Fi at the same time. This Predator gaming notebook is also equipped with hardware that can keep up with the powerful internal specs. Our specially engineered 5th Generation AeroBlade 3D Fan uses wind-guiding Vortex Flow to increase airflow and cooling from intake to exhaust, so your computer stays cool no matter the task. Our customized keyboard has see-through concave-shaped WASD keycaps, and dedicated keys for Turbo overclocking and PredatorSense. PredatorSense is the ultimate tool to let you control and customize your gaming laptop, from overclocking to fan speed to game profiles and more. (NH.QC2AA.003).",
    "price": {
      "value": 1193.9,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B092YHJLS6"
  },
  {
    "title": "Dell Inspiron 14 Plus 7420 Laptop - 14 inch, 2.2K 16:10, Intel Core i7-12700H, 16GB DDR5 RAM, 1TB SSD, Intel Iris Xe, 2 Yr Onsite + AntiVirus, Migrate, Windows 11 Pro + Office 365 - Atlantic Blue",
    "asin": "B09YBS4TVK",
    "brand": "Dell",
    "stars": 4.1,
    "reviewsCount": 112,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71ONP9xl3bL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Dell 14 Plus 7420 Notebook - 14-inch 2.2K 16:10 (2240x1400) Non-Touch Display, Intel Core i7-12700H, 16GB DDR5 RAM, 1TB SSD, Intel Iris Xe Graphics, Windows 11 Pro - Atlantic Blue.",
    "price": {
      "value": 1099.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YBS4TVK"
  },
  {
    "title": "Acer 2022 Chromebook 315 15.6\" Full HD 1080p IPS Touchscreen Laptop PC, Intel Celeron N4020 Dual-Core Processor, 4GB DDR4 RAM, 64GB eMMC, Webcam, WiFi, 12 Hrs Battery Life, Chrome OS, Silver",
    "asin": "B08LBZRVLG",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 279,
    "thumbnailImage": "https://m.media-amazon.com/images/I/41jLIFi2GXS._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Google Chrome OS  15.6\" Full HD (1920 x 1080) Widescreen IPS LED-backlit Multi-Touch Display.  Intel Celeron Processor N4020 1.10GHz (2 Core, 2M Cache, up to 2.8GHz)  4GB system memory for basic multitasking  64GB eMMC flash memory  Built-in cloud support  Intel HD Graphics 400  Bluetooth 4.2 interface syncs with compatible devices  2 - USB Type-C ports USB 3.1 Gen 1 (up to 5 Gbps) DisplayPort over USB Type-C 2 - USB 3.0 Ports  Next-Gen Intel Wireless-AC connectivity: Connect to a Wireless-AC router for nearly 3x the speed, more capacity and wider coverage than Wireless-N. Backward-compatible with all other Wi-Fi networks and hotspots.  Built-in HD webcam with microphone  Built-in virus protection and Google products  Headphone output.   Note: This Chromebook does not include a built-in DVD/CD drive.",
    "price": {
      "value": 298,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08LBZRVLG"
  },
  {
    "title": "Acer Aspire 5 A515-56-32DK Slim Laptop | 15.6\" FHD IPS | Core i3-1115G4 Processor | 4GB DDR4 | 128GB NVMe SSD | WiFi 6 | Windows 11 Home in S Mode 15.6\" Protective Laptop Sleeve",
    "asin": "B09WKXSLTH",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 4161,
    "thumbnailImage": "https://m.media-amazon.com/images/I/31gn-mSANcL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Laptop Accessories › Bags, Cases & Sleeves › Sleeves",
    "description": null,
    "price": {
      "value": 289.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09WKXSLTH"
  },
  {
    "title": "Acer 15.6\" Aspire 3 Laptop with Windows 11 in S Mode - Intel Core i3 - 8GB RAM - 256GB SSD Storage - Silver (A315-58-350L)",
    "asin": "B0BNPFWV77",
    "brand": "Acer",
    "stars": 5,
    "reviewsCount": 1,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51UXyRkPkjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Get a Fresh Perspective. Family, friends, obsessions, music, creations—Windows 11 Home in S mode is the one place for it all. With a fresh new feel and tools that make it easier to be efficient, it has what you need for whatever’s next. Less noise, clutter, or chaos. Microsoft reimagined the way a PC should work for you and with you. Windows 11 is redefining productivity.",
    "price": {
      "value": 332.8,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BNPFWV77"
  },
  {
    "title": "Acer Swift X SFX14-41G-R1S6 Creator Laptop | 14\" Full HD 100% sRGB | AMD Ryzen 7 5800U | NVIDIA RTX 3050Ti GPU | 16GB LPDDR4X | 512GB SSD | Wi-Fi 6 | Backlit KB | Amazon Alexa | Windows 10 Home",
    "asin": "B093TK1PXF",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 685,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71d5rAq4YaL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The product is multiple voltage compatible, that voltage arrange is 100-240V.",
    "price": {
      "value": 779.75,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B093TK1PXF"
  },
  {
    "title": "Acer 2022 11.6\" Convertible Touchscreen Chromebook Laptop, AMD A-Series A6-9220C Processor, 4GB RAM, 32GB Flash Storage, AMD RadeonTM R5 Graphics, Chrome OS, Black, 128GB USB Card",
    "asin": "B0BLVHR6PG",
    "brand": "Acer",
    "stars": 5,
    "reviewsCount": 4,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61r0dgi7lCL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 179,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BLVHR6PG"
  },
  {
    "title": "Acer 2022 Newest Aspire 5 Slim 15.6\" FHD Laptop, 11th Gen Intel Core i3-1115G4(Up to 4.1GHz,Beat i5-7200U), 20GB DDR4 RAM, 1TB SSD, WiFi 6, USB-C, Webcam, HDMI, Windows 11S+JVQ MP",
    "asin": "B09ZVNRT36",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 83,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71CB4URbSqL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "We sells computers with professional upgrade and customization. The manufacturer box will be opened by our engineers for customizing and testing. Defects & blemishes are significantly reduced by our in depth inspection & testing.  Processor: 11th Generation Intel Core i3-1115G4 Processor (Dual-Core, 3.0 GHz Up to 4.1 GHz, 6 MB Cache)  Graphics: Intel UHD Graphics  Operating system: Windows 11 in S mode, How to switch s mode to windows 11 On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation. In the Switch to Windows 11 Home , select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.) On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.  Memory: 20GB DDR4 SDRAM  Hard Drive: 1TB Solid State Drive  Display: 15.6\" Full HD (1920 x 1080) widescreen LED-backlit Display  Optical Drive: No  WLAN Connectivity: IEEE 802.11ax | Gigabit Ethernet | Bluetooth 5.1  Audio: Stereo Dual speakers Keyboard: Ergonomically-designed hinge lifts the keyboard for comfortable typing, improved cooling, and a better sound experience, with numeric keypad  Built-in HD Webcam: HP TrueVision HD Camera with integrated dual array digital microphones  Ports:  1 USB 3.2 Gen 1 Type-C ;  2 USB 3.2 Gen 1 Type-A (Data Transfer Only);  1 AC smart pin;  1 HDMI 2.0;  1 headphone/microphone combo  Color: Silver  Dimensions L x W x H (inches):  ‎14.31 x 9.39 x 0.7 inches  Weight: 4.19 lb",
    "price": {
      "value": 499,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09ZVNRT36"
  },
  {
    "title": "Acer Aspire A514-54-501Z 14\" 8GB 256GB SSD Core  i5-1135G7 2.4GHz, Gold",
    "asin": "B09NJWJL85",
    "brand": "Acer",
    "stars": 4.2,
    "reviewsCount": 9,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61PIRIOTQZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The slim 17.95mm and aluminum top cover give the Aspire 5 a premium feel and appearance. An ergonomic hinge design lifts the body of Aspire 5 and tilts the keyboard for comfortable typing, improved cooling and a better sound experience. Experience crisp, lifelike colors and sharp details on the 14.0 FHD IPS display. You also have more space to work with thanks to narrow bezels. More intense shades and distinctions are possible with Acer Color Intelligence. The latest 11th Gen Core i5 processor from Intel delivers unmatched speed and intelligence, enabling impressive gaming, productivity and creating experiences with faster Wi-Fi 6 connectivity. The new Intel Iris Xe Graphics provides performance and crisp, stunning visuals with the convenience of a thin & light laptop",
    "price": {
      "value": 448.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09NJWJL85"
  },
  {
    "title": "Acer 2023 Newest Aspire 5 Slim Essential Laptop, 15.6\" Full HD IPS Display, 20GB RAM, 1TB SSD, Intel Dual-Core i3 Processor Up to 4.1 GHz, HDMI, Windows 11 S",
    "asin": "B0BSJ28F59",
    "brand": "Acer",
    "stars": 4,
    "reviewsCount": 81,
    "thumbnailImage": "https://m.media-amazon.com/images/I/816+HixNiyL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Core i3-1115G4 (up to 4.1 GHz max boost clock, 6 MB Intel Smart Cache, 2 cores, 4 threads)Graphics: Intel UHD GraphicsDisplay: 15.6\" IPS Micro-Edge BrightView FHD (1920 x 1080)Operating system: Windows 11 Home-64 Operating SystemMemory: 20GB DDR4 SDRAMHard Drive: 1TB SSDKeyboard: Full-size Keyboard with Numeric KeypadBluetooth: Bluetooth 5WLAN Connectivity: Realtek Wi-Fi 6 and Bluetooth 5 comboBuilt-in HD Webcam: True Vision 720p HD camera with integrated dual array digital microphonesPorts:1 x USB 2.0 Port1 x USB 2.0 Port3 x USB 3.0 Ports3 x USB 3.0 Ports1x HDMI1x HDMI1x Headphone/Microphone Combination Jack1x Headphone/Microphone Combination JackColor: SilverBattery: Up to 8.5hr, 3-Cell 41WHr Li-ion BatteryDimensions L x W x H (inches): ‎ 14.31\" W x 9.39\" L x 0.70\" HWeight: 5.44 pounds",
    "price": {
      "value": 439.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BSJ28F59"
  },
  {
    "title": "Acer 2023 Newest Aspire 5 15.6\" FHD IPS Slim Laptop, Intel Core i3-1115G4(Up to 4.1GHz), 20GB RAM, 512GB NVMe SSD, WiFi 6, USB, RJ-45, Webcam, Amazon Alexa, Windows 11 S, w/GM Accessories",
    "asin": "B0B71BHLTF",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 196,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71dBVJ8R3AL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "How to switch s mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store. Specifications Processor Intel Core i3-1115G4 (Base 3 GHz, up to 4.1 GHz with Intel Turbo Boost Technology, 6 MB L3 cache, 2 cores) Operating System Windows 11 Home in S mode Display 15.6\" Full HD (1920 x 1080) Widescreen LED-backlit IPS ComfyView Anti-glare Memory Upgraded to 20GB DDR4 Memory Storage Upgraded to 512GB PCI NVMe SSD Graphics Intel UHD Graphics Keyboard Non-Backlight Keyboard Front Camera 720p HD Webcam Audio Built-in 2 digital Microphones, Acer TrueHarmony, Compatible with Alexa Communication Intel Wireless Wi-Fi 6 AX201 802.11ax Interfaces/Ports · 1x USB-C 3.1 Gen 1 (up to 5 Gbps) · 2x USB-A 3.1 Gen 1 (one with Power-off Charging) · 1x USB-A 2.0 · 1x HDMI Port with HDCP Support · 1x Ethernet port Memory Card Reader No Optical Drive Type No Battery 3-cell, Up to 8.5 hours Battery life, 45 W Power Supply . Dimensions 14.31\" x 9.39\" x 0.70” Weight (Approximate) 3.64 lb Color Pure Silver Bundle with Ghost Manta 3 in 1 Accessories.",
    "price": {
      "value": 419,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B71BHLTF"
  },
  {
    "title": "Acer Chromebook 314 14\" FHD Laptop Computer, Intel Celeron N4020 up to 2.8GHz, 4GB LPDDR4 RAM, 64GB eMMC, 802.11AC WiFi, Bluetooth 5.0, USB Type-C, Silver, Chrome OS, BROAGE 3 Feet USB Extension Cable",
    "asin": "B0BPM4NT7T",
    "brand": "Acer",
    "stars": 5,
    "reviewsCount": 4,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61Kj3PwPJ1L._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Operating SystemChrome OSChrome OSProcessorIntel Celeron Processor N4020 @ 1.10GHz (2 Cores, 4M Cache, up to 2.80 GHz)Intel Celeron Processor N4020 @ 1.10GHz (2 Cores, 4M Cache, up to 2.80 GHz)Display & GraphicsGraphics: Intel UHD Graphics 600Graphics: Intel UHD Graphics 600Screen Size: 14\"Screen Size: 14\"Display Screen Type: LCDDisplay Screen Type: LCDDisplay Screen Technology: In-plane Switching (IPS) TechnologyDisplay Screen Technology: In-plane Switching (IPS) TechnologyDisplay Screen Technology: ComfyViewDisplay Screen Technology: ComfyViewBacklight Technology: LEDBacklight Technology: LEDScreen Resolution: 1920 x 1080Screen Resolution: 1920 x 1080MemoryTotal Installed System Memory: 4 GBTotal Installed System Memory: 4 GBSystem Memory Technology: LPDDR4System Memory Technology: LPDDR4StorageOptical Drive Type: NoOptical Drive Type: NoFlash Memory Capacity: 64 GBFlash Memory Capacity: 64 GBNetwork & CommunicationNetwork & CommunicationWireless LAN Standard: IEEE 802.11a/b/g/n/acWireless LAN Standard: IEEE 802.11a/b/g/n/acWireless LAN Model: Wireless-AC 9560Wireless LAN Model: Wireless-AC 9560Bluetooth Standard: Bluetooth 5.0Bluetooth Standard: Bluetooth 5.0Built-in DevicesMicrophone: YesMicrophone: YesNumber of Speakers: 2Number of Speakers: 2Sound Mode: StereoSound Mode: StereoInterfaces/PortsNumber of USB 3.1 Gen 1 Type-A Ports: 2Number of USB 3.1 Gen 1 Type-A Ports: 2Number of USB 3.1 Gen 1 Type-C Ports: 2Number of USB 3.1 Gen 1 Type-C Ports: 2Total Number of USB Ports: 4Total Number of USB Ports: 4USB Type-C: YesUSB Type-C: YesUSB Type-C Detail: USB Type-C port supporting: USB 3.1 Gen 1 (up to 5 Gbps), DisplayPort over USB-C, USB charging 5/9/15/20 V; 3 A, DC-in port 20 V; 45 WUSB Type-C Detail: USB Type-C port supporting: USB 3.1 Gen 1 (up to 5 Gbps), DisplayPort over USB-C, USB charging 5/9/15/20 V; 3 A, DC-in port 20 V; 45 WInput DevicesPointing Device Type: TouchPadPointing Device Type: TouchPadKeyboard: YesKeyboard: YesBattery InformationNumber of Cells: 3-cellNumber of Cells: 3-cellBattery Chemistry: Lithium Ion (Li-Ion)Battery Chemistry: Lithium Ion (Li-Ion)Maximum Battery Run Time: 12.50 HoursMaximum Battery Run Time: 12.50 HoursPower DescriptionMaximum Power Supply Wattage: 45 WMaximum Power Supply Wattage: 45 WPhysical CharacteristicsHeight: 0.78\"Height: 0.78\"Width: 12.8\"Width: 12.8\"Depth: 9.1\"Depth: 9.1\"Weight (Approximate): 3.75 lbWeight (Approximate): 3.75 lbProduct Color: SilverProduct Color: Silver",
    "price": {
      "value": 199,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BPM4NT7T"
  },
  {
    "title": "Acer 2022 Chromebook, 17\" IPS Full HD(1920x1080) Screen, Intel Celeron Processor Up to 2.80 GHz, 4GB DDR4 Ram, 64GB SSD, Super-Fast 6th Gen WiFi, Chrome OS, Natural Silver(Renewed)",
    "asin": "B09ZDSZVJS",
    "brand": "Amazon Renewed",
    "stars": 4.1,
    "reviewsCount": 134,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61KLhS3E3QL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Product works and looks like new. Backed by the 90-day Amazon Renewed Guarantee. - This pre-owned product has been professionally inspected, tested and cleaned by Amazon-qualified suppliers. - There will be no visible cosmetic imperfections when held at an arm’s length. - Products with batteries will exceed 80% capacity relative to new. - Accessories may not be original, but will be compatible and fully functional. Product may come in generic box. - This product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied under the Amazon Renewed Guarante",
    "price": {
      "value": 175.9,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09ZDSZVJS"
  },
  {
    "title": "Acer Aspire 5 Slim 15.6\" FHD IPS Laptop 2023 Newest, Intel Core i3-1115G4, 20GB RAM 512GB NVMe SSD, Wi-Fi 6, HDMI, USB A&C, Ethernet RJ-45, Webcam, Windows 11 S, w/3in1 Accessories",
    "asin": "B0BSNV136X",
    "brand": "Acer",
    "stars": 5,
    "reviewsCount": 1,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81fPG5fwPvL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "How to switch s mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store. Specifications Processor:  Intel Core i3-1115G4 (Base 3 GHz, up to 4.1 GHz with Intel Turbo Boost Technology, 6 MB L3 cache, 2 cores) Display:  15.6 inch Full HD display with 82.58% screen-to-body, 16:9 aspect ratio and narrow bezels  Operating System:  Windows 11 Home in S mode Memory:  Upgraded to 20GB DDR4 Memory Storage:  Upgraded to 512GB PCIe NVMe SSD Graphics:  Intel UHD Graphics Keyboard:  Non-Backlit Front Camera:  720p HD Webcam Speaker:  High Definition Audio, Acer TrueHarmony, Compatible with Amazon Alexa Communication:  Intel Wireless Wi-Fi 6 AX201 802.11ax  Interfaces/Ports:  · 1x USB-C 3.1 Gen 1 (up to 5 Gbps) · 2x USB-A 3.1 Gen 1 (one with Power-off Charging) · 1x USB-A 2.0 · 1x HDMI Port with HDCP Support · 1x Ethernet port ( (RJ-45)) Memory Card Reader:  No Optical Drive Type:  No Battery:  3-cell, Up to 8.5 hours Battery life, 45 W Power Supply . Dimensions:  14.31\" x 9.39\" x 0.70\" Weight :  4.19 lb Color:  Pure Silver",
    "price": {
      "value": 449,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BSNV136X"
  },
  {
    "title": "Acer Nitro 5 AN517-54-79L1 Gaming Laptop | Intel Core i7-11800H | NVIDIA GeForce RTX 3050Ti GPU | 17.3\" FHD 144Hz IPS Display | 16GB DDR4 | 1TB NVMe SSD | Killer Wi-Fi 6 | Backlit KB | Win 11",
    "asin": "B09HJKGK5V",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 5306,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81Ivn5DIxhL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer gaming laptops deliver advanced performance for all gamers. The Nitro lineup of gaming PCs and accessories are ideal for casual gamers who are ready for something better. The Acer Nitro 5 AN517-54 is equipped with a beautiful 17.3 inch FHD display to help you visualize the win. The latest NVIDIA GeForce RTX 30 series GPU supports 2nd Gen Ray Tracing Cores, 3rd Gen Tensor Cores, DLSS, Resizable BAR, Microsoft DirectX 12 Ultimate, and so much more. With Killer's DoubleShot Pro and Wi-Fi 6, get quicker matchmaking and never worry about disconnecting during a game. The Acer Nitro 5 Intel Core i7 processing power enables impressive performance whether you're challenging your buddies to battle or focusing on a new hobby. This Acer Nitro laptop is configured with 16GB RAM memory and 1TB solid-state drive storage space, and the ability to upgrade as needed. (NH.QF6AA.002).",
    "price": {
      "value": 1239,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09HJKGK5V"
  },
  {
    "title": "Acer Chromebook 311 Laptop | AMD A-Series Dual-Core A4-9120C | 11.6\" HD Display | AMD Radeon R4 Graphics | 4GB DDR4 | 64GB eMMC | 802.11ac WiFi 5 | Bluetooth 4.2 | Chrome OS | CB311-10H-42LY",
    "asin": "B098JCH27M",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 546,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81EgKlXl7JL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Chromebook 311 CB311-10H-42LY Laptop comes with these high level specs: AMD A-Series Dual-Core Processor A4-9120C 1.6GHz with TurboCORE Technology up to 2.4GHz, Chrome OS, 11.6\" HD Widescreen ComfyView LED-backlit Display (1366 x 768 resolution, 16:9 aspect ratio), Integrated AMD Radeon R4 Graphics, 4GB DDR4 Memory, 64GB eMMC, 802.11ac WiFi 5 featuring 2x2 MU-MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.2, HD Webcam (1280 x 720) 88-Degree Wide Angle Lens supporting High Dynamic Range (HDR), High-Definition Audio Support, Two Built-in Stereo Speakers, Built-in Microphone, 2 - USB Type-C ports USB 3.1 Gen 1 (up to 5 Gbps) DisplayPort over USB Type-C & USB Charging, 2 - USB 3.0 ports, Lithium-Ion Battery, Up to 10-hours Battery Life, 2.87 lbs. | 1.3 kg (system unit only) (NX.A2NAA.004)",
    "price": {
      "value": 141.94,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B098JCH27M"
  },
  {
    "title": "Acer Aspire Vero AV15-51-7617 Green PC | 15.6\" FHD IPS 100% sRGB-Display | 11th Gen Intel Core i7-1195G7 | Intel Iris Xe Graphics | 16GB DDR4 | 512GB NVMe SSD | Wi-Fi 6 | PCR Materials | Vero-Sleeve",
    "asin": "B09R63Z5L7",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 309,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81XIwlF8sxL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Aspire Vero AV15-51-7617 comes with these high level specs: 11th Generation Intel Core i7-1195G7 Processor 2.9GHz with Turbo Boost Technology up to 5.0GHz (12MB Smart Cache), 15.6\" Full HD (1920 x 1080) Widescreen LED-backlit IPS Display (100% sRGB and 300nit Brightness), Intel Iris Xe Graphics, 16GB DDR4 Memory, 512GB NVMe SSD, True Harmony Technology, Two Built-in Stereo Speakers, Acer Purified.Voice Technology with AI Noise Reduction & Two Built-in Microphones, 802.11ax Wi-Fi 6 Dual-Band 2.4GHz and 5GHz featuring 2x2 MU-MIMO technology, 10/100/1000 Gigabit Ethernet LAN (RJ-45 port), Bluetooth 5.0, Acer Bio-Protection Fingerprint Solution, featuring Computer Protection and Windows Hello Certification, Back-lit Keyboard, HD Webcam (1280 x 720), 1 - USB 3.2 (Type-C) Gen 1 port (up to 5 Gbps), 2 - USB 3.2 Gen 1 Ports (one with Power-off Charging), 1 - USB 2.0 Port, 1 - HDMI 2.0Port with HDCP support, Lithium-Ion Battery, Up to 7.0-hours Battery Life, Amazon Alexa, Acer Vero Protective Sleeve, Windows 11 Home, EPEAT Silver Certified, 3.97 lbs. | 1.8 kg (system unit only) (NX.AYCAA.006).",
    "price": {
      "value": 509.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09R63Z5L7"
  },
  {
    "title": "Acer Nitro Gaming Laptop 17.3\" FHD IPS 144Hz Gamer Laptops Newest, Intel 12Cores i5-12500H Up to 4.5GHz, 24GB RAM 1TB SSD,GeForce RTX 3050, Backlit Keyboard, Thunderbolt 4, Win 11 +CUE Accessories",
    "asin": "B0BS9HG6FM",
    "brand": "Acer",
    "stars": null,
    "reviewsCount": null,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71RkbC7I5DL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Fire it up then go full throttle faster and more effectively than ever with Acer's next evolution of its Nitro gaming laptop. The new Nitro soars to new levels of performance for gamers and creators, courtesy of its 12th Gen Intel Core processor and NVIDIA GeForce RTX 3050 graphics—powered by Ampere NVIDIA's RTX architecture! Next, toss in the vivid, crystal-clear 17.3” Full HD display with a 144Hz IPS panel, ample cooling and a red backlit keyboard and you can see why the Nitro 5 is a knockout hit for gamers of every level! MemoryUpgraded to 24GB DDR4 RAM  Hard Drive Size Upgraded to 1TB NVMe Solid State DriveProcessor 12th Gen Intel Core i5-12500H(12C / 16T, 2.5 / 4.5GHz, 24MB L3)  Screen Size 17.3-inch diagonal, FHD (1920 x 1080), 144Hz IPS, edge-to-edge glass, microedge  Video (Graphics)   NVIDIA GeForce RTX 3050 Laptop GPU Operating System  Windows 11 Home  Interfaces/Ports  1x USB Type-A 3.2 Gen 1 (5 Gbps) (Left side port) 1x USB Type-A 3.2 Gen 2 (10 Gbps) (Right side port) 1x USB Type-A 3.2 Gen 2 (10 Gbps), Sleep and Charge (Right side port) 1x USB Type-C 3.2 Gen 2 (up to 10 Gbps), DisplayPort over USB-C, Thunderbolt 4, USB charging 5 V; 3 A (Rear port) 1x HDMI 2.1 1x Network (RJ-45)Connectivity   Ethernet LAN 10, 100, 1000 Mbit/s Wi-Fi 802.11ax Bluetooth 5.2 Audio jack 3.5mm Combo Jack Features   Web camera: HD Backlit keyboard: Keyboard Backlight Microphone: Microphone with Acer Purified Voice, support for Cortana Speakers: Audio by DTS:X Ultra Optical drive: No Security Lock slot: Kensington Lock Dimensions  15.77\" x 11.59\" x 1.10\" Weight  6.6 lbs",
    "price": {
      "value": 949,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BS9HG6FM"
  },
  {
    "title": "Acer Chromebook 311 Laptop | AMD A-Series Dual-Core A4-9120C | 11.6\" HD Display | AMD Radeon R4 Graphics | 4GB DDR4 | 64GB eMMC | 802.11ac WiFi 5 | Bluetooth 4.2 | Chrome OS | CB311-10H-41M9",
    "asin": "B0BN2K2PPH",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 546,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81EgKlXl7JL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Chromebook 311 CB311-10H-41M9 Laptop comes with these high level specs: AMD A-Series Dual-Core Processor A4-9120C 1.6GHz with TurboCORE Technology up to 2.4GHz, Chrome OS, 11.6\" HD Widescreen ComfyView LED-backlit Display (1366 x 768 resolution, 16:9 aspect ratio), Integrated AMD Radeon R4 Graphics, 4GB DDR4 Memory, 64GB eMMC, 802.11ac WiFi 5 featuring 2x2 MU-MIMO technology (Dual-Band 2.4GHz and 5GHz), Bluetooth 4.2, HD Webcam (1280 x 720) 88-Degree Wide Angle Lens supporting High Dynamic Range (HDR), High-Definition Audio Support, Two Built-in Stereo Speakers, Built-in Microphone, 2 - USB Type-C ports USB 3.1 Gen 1 (up to 5 Gbps) DisplayPort over USB Type-C & USB Charging, 2 - USB 3.0 ports, Lithium-Ion Battery, Up to 10-hours Battery Life, 2.87 lbs. | 1.3 kg (system unit only) (NX.A2NAA.003)",
    "price": {
      "value": 155.5,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BN2K2PPH"
  },
  {
    "title": "Acer Nitro 5 15 Gaming Laptop | 15.6\" Full HD IPS 144Hz | AMD 6-core Ryzen 5 5600H | 16GB DDR4 512GB SSD + 1TB HDD | GeForce RTX 3060 6GB Graphic | Backlit HDMI USB-C Win11 Black + 32GB MicroSD Card",
    "asin": "B0BL8DNYP1",
    "brand": "Acer",
    "stars": 4.5,
    "reviewsCount": 3,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81lOhjkNtUL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "PRODUCT OVERVIEW: KEY SPECIFICATIONS:  PC Type: Gaming Laptop Computer PC Series: Acer Nitro 5 Processor: AMD 6-core Ryzen 5 5600H Processor | Base Frequency 3.3GHz, Max Boost Frequency Up to 4.2GHz, 16MB Smart Cache, 12 Threads Memory: 16GB DDR4 Storage: 512GB SSD + 1TB HDD Graphics: NVIDIA GeForce RTX 3060 6GB Graphic Dedicated, AMD Radeon Graphics Integrated, Display: 15.6\" Full HD (1920 x 1080) IPS 144Hz Display Communications: Bluetooth 5.1 Keyboard: Backlit Keyboard Camera: 720p HD Webcam Operating system: Windows 11 Home Ports & Slots: 3 x USB-A 3.2, 1 x USB-C 3.2 (Up to 10 Gbps), 1 x HDMI, 1 x Gigabit Ethernet, 1 x Audio Jack Additional Information:  Dimensions: 10\" x 14.3\" x 0.94\" Approximate Weight: 4.86 pounds Accessory:  32GB MicroSD Card",
    "price": {
      "value": 899,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BL8DNYP1"
  },
  {
    "title": "Acer Swift 3 Intel Evo Thin & Light Laptop, 14\" Full HD, Intel Core i7-1165G7, Iris Xe Graphics, 8GB LPDDR4X, 256GB NVMe SSD, Wi-Fi 6, Fingerprint Reader, Back-lit KB, SF314-59-75QC",
    "asin": "B08JQJ5RKK",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 437,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51CyZhzk0bL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Acer Swift 3 SF314-59-75QC comes with these high level specs: 11th Generation Intel Core i7-1165G7 Processor 2.8GHz with Turbo Boost Technology up to 4.7GHz (12MB Smart Cache), Windows 10 Home, 14\" Full HD Widescreen IPS LED-backlit Display 1920 x 1080 resolution, 100% sRGB, 16:9 aspect ratio, Intel Iris Xe Graphics, 8GB LPDDR4X Onboard Memory, 256GB NVMe SSD, DTS Audio, featuring optimized bass response and micro-speaker distortion prevention, Two built-in front facing stereo speakers, Acer Purified.Voice technology with two built-in microphones, Intel Wireless Wi-Fi 6 AX201 802. 11ax Dual-Band 2.4GHz and 5GHz featuring 2x2 MU-MIMO technology (Max Speed up to 2.4Gbps), Bluetooth 5.1, Back-lit Keyboard, Acer Bio-Protection Fingerprint Solution, featuring Computer Protection and Windows Hello Certification, HD Webcam (1280 x 720) supporting Super High Dynamic Range (SHDR), 1 - USB Type-C Port USB 3.2 Gen 2 (up to 10 Gbps) DisplayPort over USB Type-C, Thunderbolt 4 & USB Charging, 1 - USB 3.2 Gen 1 port (featuring power-off charging), 1 - USB 2.0 port, 1 - HDMI 2.0 port, Lithium-Ion Battery, Up to 16-hours Battery Life, 2.65 lbs. | 1.2 kg (system unit only) (NX.A5UAA.006).",
    "price": {
      "value": 559,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08JQJ5RKK"
  },
  {
    "title": "Acer 2022 Newest Nitro 5 AN515-57-79TD Gaming Laptop, 15.6\" FHD 144Hz IPS-Display, Intel Core i7-11800H, NVIDIA GeForce RTX 3050 Ti, 32GB DDR4, 2TB SSD, Backlit KB, Win 11, Bundle with JAWFOAL",
    "asin": "B0B8CDNN6Z",
    "brand": "Acer",
    "stars": 4.3,
    "reviewsCount": 38,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71lBfSJZi1L._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: 11th Gen Intel Core i7-11800H processor (up to 4.6 GHz with Intel Turbo Boost Technology, 8 cores)Graphics: NVIDIA GeForce RTX 3050 TiOperating system: Windows 11 HomeMemory: Up to 64GB DDR4 SDRAM Hard Drive:Up to 2TB Solid State DriveOptical Drive: NoneDisplay: 15.6-inch diagonal, FHD (1920 x 1080), 144 Hz, IPS, 80% screen-to-body, 16:9 aspect ratioConnectivity: Wi-Fi 6 (2x2) and Bluetooth 5.0Keyboard:Backlit KeyboardBuilt-in HD Webcam: 720P Camera with MicrophonesPorts: 1 x USB Type-C Port USB 3.2 Gen 2 (up to 10 Gbps) DisplayPort over USB Type-C2 x USB 3.2 Gen 11 x HDMI 2.0 with HDCP Support1 x Headphone/Speaker/Line-out JackEthernet (RJ-45)Dimensions L x W x H (inches): 14.31\" W x 10.04\" D x 0.94\" Weight: 4.85 lbs",
    "price": {
      "value": 1199.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B8CDNN6Z"
  },
  {
    "title": "Acer 2023 Newest Aspire 515.6\" FHD IPS Slim Laptop, AMD Ryzen 3 3350U 4-Core Processor(Up to 3.5GHz) 20GB RAM, 512GB NVMe SSD, Backlit KB, Fingerprint Reader, Amazon Alexa, Win 11 S, 3in1 Accessories",
    "asin": "B09S9SZ8CV",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 549,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71DhkHs4pqL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "How to switch s mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store. Specifications Processor :  AMD Ryzen 3 3350U Quad-Core Processor (Base Frequency at 2.10GHz, Up to 3.50GHz at Maximum Boost Clock, 4 Cores, 4MB Cache, 4 Threads) Display : 15.6\" Full HD (1920 x 1080) non-touch LED-backlit IPS Display with 82.58% screen-to-body, 16:9 aspect ratio and narrow bezels Graphics: AMD Radeon Vega 6 Graphics Integrated Graphics Card Memory (RAM):  Upgraded to 20GB DDR4  Hard Drive: Upgraded to 512GB PCIe SSD  Optical Drive: NO Audio: Stereo Dual speakers Operating System: Windows 11 Home in S mode Keyboard:  Backlit Keyboard with integrated numeric pad Touchscreen： NO Webcam:  HP TrueVision HD Camera with integrated dual array digital microphones Connectivity： IEEE 802.11ax；Gigabit Ethernet；Bluetooth 5.1 Ports & Slot:  1 USB 3.2 Gen 1 Type-C ; 2 USB 3.2 Gen 1 Type-A (Data Transfer Only);  1 USB 2.0;  1 DC-In Jack for AC Adapter;  1 HDMI 2.0;  1 RJ-45;  1 headphone/microphone combo Dimensions: 14.31 in (W) x 9.86 in (D) x 0.71 in (H) Weight: 3.99 lb Color: Natural Silver",
    "price": {
      "value": 499.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09S9SZ8CV"
  },
  {
    "title": "2022 Newest Acer Aspire 5 Slim Laptop, 15.6\" Full HD IPS, AMD Ryzen 3 3350U Quad-Core Processor, 12 GB DDR4 RAM, 512 GB SSD, Intel WiFi 6, Backlit KB, Fingerprint Reader, Amazon Alexa, Windows 11",
    "asin": "B09RNG4XDP",
    "brand": "Acer",
    "stars": 4.4,
    "reviewsCount": 326,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81Uc3Mfg6RL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "We sells computers with professional upgrade and customization. The manufacturer box will be opened by our engineers for customizing and testing. Defects & blemishes are significantly reduced by our in depth inspection & testing. Processor: AMD Ryzen 3 3350U Quad-Core Processor (Base Frequency at 2.10GHz, Up to 3.50GHz at Maximum Boost Clock, 4 Cores, 4MB Cache, 4 Threads)Graphics: Radeon™ Vega 6 GraphicsOperating system: Windows 11 Home 64-bitMemory: Up to 36GB DDR4 SDRAMHard Drive: Up to 2TB PCIe NVMe M.2 Solid State DriveDisplay: 15.6\" Full HD (1920 x 1080) widescreen LED-backlit IPS DisplayNonTouch ScreenOptical Drive: NoWLAN Connectivity: IEEE 802.11ax | Gigabit Ethernet | Bluetooth 5.1Audio: Stereo Dual speakersFinger Print Reader: YesBacklit Keyboard: Yes, with numeric keypadBuilt-in HD Webcam: HP TrueVision HD Camera with integrated dual array digital microphonesPorts: 1 USB 3.1 Gen 1 Type-C™ ; 2 USB 3.1 Gen 1 Type-A (Data Transfer Only); 1 AC smart pin; 1 HDMI 1.4b; 1 headphone/microphone comboColor: SilverDimensions L x W x H (inches): 14.3 x 9.9 x 0.71 inchesWeight: 3.97 lb",
    "price": {
      "value": 469.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09RNG4XDP"
  },
  {
    "title": "Dell Inspiron 15 3520 Laptop - 15.6-inch FHD (1920x1080) 120Hz Display, Core i5-1235U Processor, 16GB DDR4 RAM, 512GB SSD, WiFi 6, Iris Xe Graphics, Win 11 Home - Carbon Black",
    "asin": "B09PHB7CS2",
    "brand": "Dell",
    "stars": 4,
    "reviewsCount": 44,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81x8wuiiloS._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Dell Inspiron 15 3520 Laptop - 15.6-inch FHD (1920x1080) 120Hz Display, Intel Core i5-1235U Processor, 16GB DDR4 RAM, 512GB SSD, Intel Wifi 6, Intel Iris Xe Graphics, Win 11 Home - Carbon Black",
    "price": {
      "value": 674.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09PHB7CS2"
  },
  {
    "title": "ASUS Chromebook C203XA Rugged & Spill Resistant Laptop, 11.6\" HD, 180 Degree, MediaTek Quad-Core Processor, 4GB RAM, 32GB eMMC, MIL-STD 810G Durability, Dark Grey, Education, Chrome OS, C203XA-YS02-GR",
    "asin": "B07YXZ1CP3",
    "brand": "ASUS",
    "stars": 4.4,
    "reviewsCount": 441,
    "thumbnailImage": "https://m.media-amazon.com/images/I/810-GBKxQaL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The ASUS Chromebook C203, a rugged K-12 11.6” Chromebook featuring a 180-degree screen, spill-resistant keyboard, and USB Type-A / Type-C connections.",
    "price": {
      "value": 120,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07YXZ1CP3"
  }
]
