[
  {
    "title": "HP Pavilion Laptop, 15.6\" HD Display, Intel Pentium Quad-Core Processor, Online Conferencing, Webcam, HDMI, WiFi, Bluetooth, Windows 11 (8GB RAM | 512GB SSD)",
    "asin": "B09XZ3PHTW",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 569,
    "thumbnailImage": "https://m.media-amazon.com/images/I/711yMY-peLL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Pentium Silver N5000 1.1GHz Quad-Core Processor (4MB Intel Smart Cache, up to 2.70GHz)Graphics: Intel UHD Graphics 600Operating system: Windows 11 Home 64-bitMemory: 8GB DDR4 SDRAM Hard Drive: 512GB Solid State DriveOptical Drive: NoDisplay: 15.6\" diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSCConnectivity: Realtek RTL8821CE 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 combo Miracast compatible; MU-MIMO supportedAudio: Dual SpeakersKeyboard: US English,  Non-Backlit Full Size Keyboard with Numeric KeypadBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesMedia Drive: Multi-format SD media card readerPorts: 1 x SuperSpeed USB Type-C 5Gbps signaling rate1 x SuperSpeed USB Type-C 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate1 x AC smart pin1 x AC smart pin1 x HDMI 1.4b1 x HDMI 1.4b1 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo JackBattery: Up to 10.5 HoursColor: Scarlet RedDimensions L x W x H (inches): 14.11 x 9.53 x 0.78Weight: 3.92 lbs",
    "price": {
      "value": 449,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09XZ3PHTW"
  },
  {
    "title": "HP 15.6in Laptop (Intel Pentium Quad-Core N5000, 4GB RAM, 128GB SSD, HDMI, WiFi, Bluetooth, HD Webcam, Windows 10 S) (Renewed)",
    "asin": "B08CQCSM7F",
    "brand": "Amazon Renewed",
    "stars": 4.4,
    "reviewsCount": 1255,
    "thumbnailImage": "https://m.media-amazon.com/images/I/717ywJDnAHL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "HP 15.6in Laptop (Intel Pentium Quad-Core N5000, 4GB RAM, 128GB SSD, HDMI, WiFi, Bluetooth, HD Webcam, Windows 10 S",
    "price": {
      "value": 239.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08CQCSM7F"
  },
  {
    "title": "2022 HP 15.6\" HD BrightView Laptop, Intel Pentium Silver N5030 Processor, 16GB RAM, 1TB PCIe SSD, Intel HD Graphics 605, 720p HD Webcam, Stereo Speakers, Silver, Windows 11, 32GB USB Card",
    "asin": "B0BK9ZCRGN",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 169,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71zBGwi8X7L._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 519,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BK9ZCRGN"
  },
  {
    "title": "HP 2022 15.6\" HD BrightView Laptop, Intel Pentium Silver N5030 Processor, 8GB RAM, 256GB PCIe SSD, Intel HD Graphics 605, 720p HD Webcam, Stereo Speakers, Silver, Windows 11, 32GB USB Card",
    "asin": "B0BK9WT2DK",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 169,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71zBGwi8X7L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "2022 HP 15.6\" HD BrightView Laptop, Intel Pentium Silver N5030 Processor, 8GB RAM, 256GB PCIe SSD, Intel HD Graphics 605, 720p HD Webcam, Stereo Speakers, Silver, Windows 11, 32GB USB Card",
    "price": {
      "value": 389,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BK9WT2DK"
  },
  {
    "title": "2021 HP Stream 14\" HD SVA Laptop Computer, Intel Celeron N4000 Processor, 4GB RAM, 64GB eMMC flash memory, Intel UHD Graphics 600, 1-Year Office, Bluetooth, Win 10S, Rose Pink, 128GB SnowBell USB Card",
    "asin": "B08KSMGQGK",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 799,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51t0befUGiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Operating System:Windows 10 Home in S mode,Experience the most secure Windows ever built with fast boot times, increased responsiveness, and added protection against phishing and malware. Display:14\" diagonal HD SVA BrightView Display, 1366 x 768 resolution boasts impressive color and clarity, Anti-glare Energy-efficient WLED screen. Processor:Intel Celeron N4000 Processor, Ultra-low-voltage platform. Dual-core, two-way processing provides maximum high-efficiency power to go. Memory RAM:4GB DDR4 RAM, Plenty of high-bandwidth RAM to smoothly run your games as well as multiple programs. Storage Drive:64GB eMMC flash memory, This ultracompact memory system is ideal for mobile devices and applications, providing enhanced storage capabilities, streamlined data management, quick boot-up times and support for high-definition video playback. Graphics:Intel UHD Graphics 600 with shared video memory provide solid image quality for Internet use, movies, basic photo editing and casual gaming. Keyboard:Standard Keyboard, Allows you to enjoy comfortable and accurate typing. Audio:Stereo speakers deliver breathtaking, three-dimensional audio that flows above and around you with depth and precision. Webcam:HP Webcam with integrated digital microphone makes it easy to video chat with family, friends or teleconference over popular applications. Battery:Battery life Up to 11 hours (video playback) Dimensions (WxDxH):13.27\" x 8.9\" x 0.7\" Weight:3.17 lbs Color:Rose Pink Ports:3x USB Type-A Ports, 1x HDMI, 1x Media Card Reader, 1x Headphone Jack. Network:Wireless-AC + Bluetooth 4.2",
    "price": {
      "value": 299,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08KSMGQGK"
  },
  {
    "title": "2022 HP Premium 14-inch HD Thin and Light Laptop, Intel Quad-Core Processor, 16GB RAM, 64GB Storage, Long Battery Life, Webcam, Bluetooth, HDMI, Wi-Fi, Rose Gold, Windows 11 + 1 Year Microsoft 365",
    "asin": "B0B2F6P8LT",
    "brand": "HP",
    "stars": 4.2,
    "reviewsCount": 297,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71-htOI+ZxL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Celeron N4120 1.1GHz Quad-Core Processor (4MB Cache, Up to 2.6GHz)Graphics: Intel UHD GraphicsOperating system: Windows 11 Home 64-bitMemory: 16GB DDR4 SDRAM Hard Drive: 64GB eMMCOptical Drive: NoDisplay: 14\" diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSCConnectivity: Realtek 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth 5 comboAudio: Dual SpeakersKeyboard: US English,  Non-Backlit Full Size KeyboardBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesMedia Drive: Multi-format SD media card readerPorts: 1 x SuperSpeed USB Type-C 5Gbps signaling rate1 x SuperSpeed USB Type-C 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate1 x AC smart pin1 x AC smart pin1 x HDMI 1.4b1 x HDMI 1.4b1 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo JackBattery: Up to 11 HoursColor: Rose GoldDimensions L x W x H (inches): 12.7 x 8.8 x 0.7Weight: 3.2 lbs",
    "price": {
      "value": 369,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B2F6P8LT"
  },
  {
    "title": "2022 HP Stream 14in HD Display, Intel Celeron N4020 Dual-Core Processor, 4GB DDR4 Memory, 128GB Storage (64GB eMMC+64GB Card), HDMI, WiFi, Webcam, Bluetooth,1-Year Microsoft 365 Win10 S | TGCD Bundle",
    "asin": "B09QH6131Z",
    "brand": "HP",
    "stars": 4.5,
    "reviewsCount": 143,
    "thumbnailImage": "https://m.media-amazon.com/images/I/812JfgK9fdL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Capacity:Rose Gold/N4020/64GB/14 inch✔Intel Celeron N4020 (1.1 GHz base frequency, up to 2.8 GHz burst frequency, 4 MB L2 cache, 2 cores),✔4 GB DDR4-2400 SDRAM (onboard), 64GB eMMC Storage✔14\" HD (1366 x 768) SVA WLED-Backlit Display with BrightView Micro-edge Technology, Intel Integrated UHD Graphics 600✔1 USB 3.1 Gen 1 Type-C (Data transfer only, data 5 Gb/s signaling rate); 2 USB 3.1 Gen 1 (Data transfer only); 1 HDMI; 1 headphone/microphone combo; Realtek RTL8822CE 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth 5 combo; 1 media card reader; NO Optical Drive✔Office 365 for one year: Get full access to Microsoft Excel, Word, PowerPoint, OneNote, Access, and 1 TB of One Drive storage for 1 year✔Windows 10 S OS, Free upgrade to windows 11, 3-cell Lithium Ion BatteryTGCD bundle: 64GB ADATA microSDXC memory card",
    "price": {
      "value": 329.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09QH6131Z"
  },
  {
    "title": "HP Pavilion Laptop (2022 Model), 15.6\" HD Display, Intel Celeron Quad-Core Processor, 16GB DDR4 RAM, 1TB SSD, Online Conferencing, Webcam, HDMI, WiFi, Bluetooth, Windows 11",
    "asin": "B09XZ93TXL",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 263,
    "thumbnailImage": "https://m.media-amazon.com/images/I/711yMY-peLL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "laptop",
    "price": {
      "value": 419,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09XZ93TXL"
  },
  {
    "title": "HP Stream 11 Laptop, Intel Celeron N4020, 4 GB RAM, 64 GB Storage, 11.6” HD Anti-Glare Display, Windows 11, Long Battery Life, Thin & Portable, Includes Microsoft 365 (11-ak0040nr, 2021 Diamond White)",
    "asin": "B09F8JJDLW",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 1151,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81hR1tPG+ZL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Live your best life on the go and in style with the slim and expressive HP Stream 11 Laptop. With its smooth finish, vertical brushed pattern, and pop of Diamond White color, this windows laptop perfectly fits your personality. The design isn't only for looks; the ultra-thin laptop is super portable and its high-definition display contains an anti-glare panel—perfect for travel and computing out in the sun (1). This affordable HP laptop features powerful and reliable hardware, such as the dual-core Intel Celeron N4020 processor (2) and Intel UHD Graphics 600 (3). Plus, with an embedded Multimedia Card, you’ll enjoy 64 GB of storage for greater content security, fewer moving parts, and at a great value (4). Additionally, experience a boost to your 11.6-inch laptop’s overall performance and bandwidth thanks to 4 GB of RAM. And with up to 13 hours and 15 minutes of battery life, you’ll enjoy all that processing power and storage options from the start of your workday to the end of your evening streaming (5). Experience quicker boot-ups and strong protection against phishing and malware with the Windows 11 Home in S Mode (6). Plus, your device's 1-year limited hardware warranty provides even more peace of mind. Whether you’re at home, the office, or in class, the dependable Realtek RTL8822CE 802.11a/b/g/n/ac (2x2) Wi-Fi (7) and Bluetooth 5.0 (8) combo is just the solution for preventing unwanted connection drops or waiting on endless load screens. Take advantage of a free 1-year subscription to Microsoft 365 and utilize the many new smart assistance tools and other creativity promoting features this HP laptop computer has to offer (9). Stay productive anywhere while shrinking your carbon footprint with a PC laptop that's not only built with sustainability in mind, but is also ENERGY STAR certified (10) and EPEAT Silver registered (11). (1) High-definition (HD) content is required to view high-definition images. (2) Multi-core is designed to improve the performance of certain software products. Not all customers or software applications will necessarily benefit from the use of this technology. Performance and clock frequency will vary depending on application workload and your hardware and software configurations. Intel’s numbering, branding, and/or naming is not a measurement of higher performance. Intel, Pentium, Intel Core, Celeron, Iris Xe, Intel logo, and the Intel Inside logo are trademarks of Intel Corporation in the U.S. and other countries. (3) Shared video memory (UMA) uses part of the total system memory for video performance. System memory dedicated to video performance is not available for other use by other programs. (4) For storage drives, GB = 1 billion bytes. The actual formatted capacity is less. Up to 5.1GB of disk is reserved for system recovery software. (5) Battery life tested by HP using continuous FHD video playback, 1080p (1920x1080) resolution, 150 nits brightness, system audio level at 17%, player audio level at 100%, played full-screen from local storage, headphone attached, wireless on but not connected. Actual battery life will vary depending on configuration and maximum capacity will naturally decrease with time and usage. (6) Not all features are available in all editions or versions of Windows. Systems may require upgraded and/or separately purchased hardware, drivers, software, or BIOS update to take full advantage of Windows functionality. Windows 11 is automatically updated, which is always enabled. ISP fees may apply and additional requirements may apply over time for updates. Windows 11 in S mode works exclusively with apps from the Microsoft Store within Windows. Certain default settings, features, and apps cannot be changed. Some accessories and apps compatible with Windows 11 may not work (including some antivirus, PDF Writers, driver utilities, and accessibility apps) and performance may vary, even if you switch out of S mode. If you switch to Windows 11, you can’t switch back to S mode. (7) Wireless access point and internet service required and sold separately. The availability of public wireless access points is limited. Wi-Fi 5 (802.11ac) is backward compatible with prior Wi-Fi 5 specs. (8) Bluetooth is a trademark owned by its proprietor and used by HP Inc. under license. (9) Microsoft 365 Personal 1-year subscription included. Activation is required within 180 days of the Windows activation date. Microsoft 365 Family and Microsoft 365 Personal have non-commercial rights and are meant for personal use only. See microsoft.com for full details. (10) ENERGY STAR and the ENERGY STAR mark are registered trademarks owned by the U.S. Environmental Protection Agency. (11) Based on U.S. EPEAT registration according to IEEE 1680.1-2018 EPEAT. EPEAT status varies by country.",
    "price": {
      "value": 125.06,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09F8JJDLW"
  },
  {
    "title": "2022 HP Flagship 15inch HD Laptop, Intel Dual-Core Processor up to 2.65GHz, 4GB DDR4, 128GB SSD, Ultra-Fast WiFi, Windows 11, Dale Red(Renewed)",
    "asin": "B0B477ZSYN",
    "brand": "Amazon Renewed",
    "stars": 4.2,
    "reviewsCount": 39,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81MeVw9AGXL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The product is refurbished and is fully functional. Backed by the 90-day Amazon Renewed Guarantee. - This pre-owned product has been professionally inspected, tested and cleaned by Amazon qualified vendors. - Products correspond to one of the following cosmetic conditions: Excellent condition - no signs of cosmetic damage when held 12 inches away. Good condition - Light scratches, barely visible when holding the device 12 inches away. Acceptable condition - Scratches visible when holding the device 12 inches away and perceptible to the touch. - This product will have a battery that exceeds 80% capacity relative to new. - Accessories may not be original, but will be compatible and fully functional. Product may come in generic box. - This product is eligible for a replacement or refund within 90 days of receipt if it does not work as expected.",
    "price": {
      "value": 249.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B477ZSYN"
  },
  {
    "title": "HP 15 Laptop, AMD Ryzen 3 3250U Processor, 8 GB RAM, 256 GB SSD Storage, 15.6-inch HD Micro-Edge Display, Windows 11 Home, Long-Lasting Battery, Fast Charge, 720p Webcam (15-ef2024nr)",
    "asin": "B09J1PS4TG",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 233,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81aOUjF9LOL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The HP 15 Laptop is designed to keep you productive and entertained from anywhere. Take your 15.6-inch laptop wherever you go and see more of your entertainment on an HD, micro-edge display (1). Not only do your games and movies look better, but with the AMD Radeon™ Graphics card, everything you do gets a performance boost (2). The AMD Ryzen 3 3250U Mobile Processor accelerates your power and efficiency, keeping you productive wherever your work takes you (3). Out-class traditional hard drives with 256 GB of PCIe NVMe M.2 SSD storage and experience improved multitasking with higher bandwidth thanks to 8 GB of RAM (4). This laptop computer gives you reliable power all day with 7 hours and 15 minutes of battery life (5). Plus, HP Fast Charge gets you from 0 to 50% charge in approximately 45 minutes to get you back up and running in a pinch (6). Enjoy fast and reliable internet connections with the Wi-Fi 6 (2x2) and Bluetooth 5.0 combo (8) (9). Work or learn remotely with MU-MIMO support for smoother Wi-Fi in multi-device homes, a full-sized keyboard, an HD web-camera (12), and the familiar feel of the Windows 10 Home operating system (7). Beyond the familiar feel, your laptop is also set for some improvements thanks to the guaranteed free upgrade to Windows 11 when available (8). Stay environmentally responsible with an ENERGY STAR certified (13), EPEAT Silver registered (14), and low halogen (15) Windows 10 laptop. Get right to work and your entertainment with a laptop backed by a 1-year limited hardware warranty. (1) High-definition (HD) content is required to view high-definition images. (2) Shared video memory (UMA) uses part of the total system memory for video performance. System memory dedicated to video performance is not available for other use by other programs. (3) Multi-core is designed to improve performance of certain software products. Not all customers or software applications will necessarily benefit from the use of this technology. Performance and clock frequency will vary depending on the application workload and your hardware and software configurations. AMD’s numbering is not a measurement of clock speed. AMD and Radeon are trademarks of Advanced Micro Devices, Inc. (4) Actual formatted capacity is less. A portion of internal storage is reserved for preloaded content. Based on HP internal testing using CrystalDiskMark benchmarking software. Performance is sequentially faster (read-only) compared to traditional 5,400 rpm HDD. (5) Windows 10 MobileMark 18 battery life will vary depending on various factors including product model, configuration, loaded applications, features, use, wireless functionality, and power management settings. The maximum capacity of the battery will naturally decrease with time and usage. See bapco.com/products/mobilemark-2018/ for additional details. (6) Based on HP internal testing using CrystalDiskMark benchmarking software. Performance is sequentially faster (read-only) compared to traditional 5,400 rpm HDD. (7) Not all features are available in all editions or versions of Windows. Systems may require upgraded and/or separately purchased hardware, drivers, software, or BIOS update to take full advantage of Windows functionality. Windows 10 is automatically updated, which is always enabled. ISP fees may apply and additional requirements may apply over time for updates. See microsoft.com (8) Wireless access point and internet service required and sold separately. Availability of public wireless access points limited. Wi-Fi 6 (802.11ax) is backwards compatible with prior 802.11 specs. The specifications for Wi-Fi 6 are draft and are not final. If the final specifications differ from the draft specifications, it may affect the ability of the notebook to communicate with other Wi-Fi 6 devices. Only available in countries where 802.11ax is supported. (9) Bluetooth is a trademark owned by its proprietor and used by Hewlett-Packard Company under license. (10) Based on Wi-Fi 5 80MHz and Wi-Fi 6 160MHz minimum requirements when transferring files between two devices connected to the same router. Requires a wireless router, sold separately, that supports 802.11ax (Wi-Fi 6). Only available in countries where 802.11ax is supported. (11) Wi-Fi supporting gigabit speeds is achievable when transferring files between two devices connected to the same router. Requires a wireless router, sold separately, that supports 160MHz channels. (12) Features may require software or other 3rd party applications to provide the described functionality. Internet service required and not included. (13) ENERGY STAR and the ENERGY STAR mark are registered trademarks owned by the U.S. Environmental Protection Agency. (14) Based on U.S. EPEAT registration according to IEEE 1680.1-2018 EPEAT. EPEAT status varies by country. Visit www.epeat.net for more information. (15) External power supplies, power cords, cables, and peripherals are not Low Halogen. Service parts obtained after purchase may not be Low Halogen.",
    "price": {
      "value": 379.97,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09J1PS4TG"
  },
  {
    "title": "HP 2022 Stream 14\" HD Laptop, Intel Celeron N4120 Processor, 4GB RAM, 64GB eMMC Storage, HD Webcam, HDMI, Wi-Fi, Bluetooth, Rose Gold, Office 365 1-Year, Windows 11 S, 32GB SnowBell USB Card",
    "asin": "B0BQ98FVP3",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 42,
    "thumbnailImage": "https://m.media-amazon.com/images/I/718iqv65iFL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 279,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BQ98FVP3"
  },
  {
    "title": "2022 HP 15.6\" FHD Laptop Computer, AMD Ryzen 5-5500U Processor(Beats Intel i7-1065G7), 32GB RAM, 1TB PCIe SSD, AMD Radeon Graphics, HD Webcam, Bluetooth, Wi-fi, Win 11, Blue, 32GB USB Business Card",
    "asin": "B0B6SBQWGY",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 75,
    "thumbnailImage": "https://m.media-amazon.com/images/I/513wQmRR+QL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "15.6\" diagonal FHD Display】1920 x 1080 resolution boasts impressive color and clarity, Anti-Glare BrightView micro-edge WLED screen.",
    "price": {
      "value": 649.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B6SBQWGY"
  },
  {
    "title": "HP 14\" Laptop Computer, Intel Quad-Core i5-1135G7 up to 4.2GHz (Beat i7-1065G7), 8GB DDR4 RAM, 256GB PCIe SSD, 802.11AC WiFi, Bluetooth 4.2, Natural Silver, Windows 11 Home, BROAG Extension Cable",
    "asin": "B0BSTVB9Z3",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 102,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61TAw+f1uwL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Microprocessor Intel Core i5-1135G7 (up to 4.2 GHz with Intel Turbo Boost Technology, 8 MB L3 cache, 4 cores)Chipset Intel Integrated SoCMemory, standard 8GB DDR4-2666 MHz RAMVideo graphics Intel Iris Xᵉ GraphicsHard drive 256GB PCIe NVMe M.2 SSDOptical drive Optical drive not includedDisplay 14\" diagonal, HD (1366 x 768), micro-edge, BrightView, 250 nits, 45% NTSCWireless connectivity Realtek RTL8821CE-M 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 comboExpansion slots 1 multi-format SD media card readerExternal ports 1 SuperSpeed USB Type-C 5Gbps signaling rate; 2 SuperSpeed USB Type-A 5Gbps signaling rate; 1 HDMI 1.4b; 1 AC smart pin; 1 headphone/microphone comboMinimum dimensions (W x D x H) 32.4 x 22.5 x 1.79 cmWeight 1.46 kgPower supply type 45 W Smart AC power adapterBattery type 3-cell, 41 Wh Li-ionBattery life mixed usage Up to 9 hoursVideo Playback Battery life Up to 11 hours and 30 minutesWebcam HP Wide Vision 720p HD camera with integrated dual array digital microphonesAudio features Dual speakersOperating system Windows 11 Home 64",
    "price": {
      "value": 449,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BSTVB9Z3"
  },
  {
    "title": "2020 HP 15.6\" HD LED Display Laptop, Intel Pentium Gold 6405U Processor, 4GB DDR4 RAM, 128GB SSD, HDMI, Webcam, WI-FI, Windows 10 S, Scarlet Red",
    "asin": "B08HHT31TS",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 1419,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71YNQl3sZRL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "2020 HP 15.6\" HD (1366 x 768) LED Display Laptop PC, Intel Pentium Gold 6405U Dual-Core Processor, 4GB DDR4 RAM, 128GB SSD, HDMI, Webcam, 802.11ac, Bluetooth, Windows 10 S, Red",
    "price": {
      "value": 274,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08HHT31TS"
  },
  {
    "title": "2022 HP Pavilion 17.3 inch IPS FHD Laptop, Intel Core i5-1135G7 (Beats i7-1065G7), Iris Xe Graphics, 16GB RAM, 1TB PCIe SSD, Backlit Keyboard, WiFi 5, Long Battery Life, Webcam, Windows 11",
    "asin": "B09ZYWNQ9N",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 75,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61mmLAb0IhL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "2022 HP Pavilion 17.3 inch IPS FHD Laptop, Intel Core i5-1135G7 (Beats i7-1065G7), Intel Iris Xe Graphics, 16GB RAM, 1TB PCIe SSD, Backlit Keyboard, WiFi 5, Long Battery Life, Webcam, Windows 11",
    "price": {
      "value": 720.25,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09ZYWNQ9N"
  },
  {
    "title": "Dell Inspiron 14 5420 14 inch Student Laptop - 2.2K Display, Intel Core i7-1255U, 16GB DDR4 RAM, 512GB SSD, NVIDIA GeForce MX570, HDMI, USB-C, Bluetooth, Wi-Fi 6, Windows 11 Pro - Silver",
    "asin": "B09VCSW1N1",
    "brand": "Dell",
    "stars": 4.3,
    "reviewsCount": 113,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71o41XLXydL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Inspiron 14 5420 14 inch student laptop features an Intel Core i7-1255U processor that is optimized for fast and smooth performance to keep you connected to what matters most. With a fluid dynamic bearing system, your lightweight laptop's fan is not only long-lasting, but it also runs quietly while keeping your device performing at its best. Our all-new mechanical camera shutter protects against anyone invading your privacy or accidental embarrassments on video calls; so you can read, watch, or chat all day with peace of mind. Your always-ready experience starts as soon as you open your device. Turn on, boot-up, and log-in quickly. A lid-open sensor gets this small laptop started when opened, even if completely off or hibernating, and an optional fingerprint reader will verify identity quickly for login using Windows Hello. ExpressCharge minimizes the time you spend tethered to an outlet and will recharge your battery in a flash.",
    "price": {
      "value": 930,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09VCSW1N1"
  },
  {
    "title": "Dell Inspiron 14 Plus 7420 Laptop - 14 inch, 2.2K 16:10, Intel Core i7-12700H, 16GB DDR5 RAM, 1TB SSD, Intel Iris Xe, 2 Yr Onsite + AntiVirus, Migrate, Windows 11 Pro + Office 365 - Atlantic Blue",
    "asin": "B09YBS4TVK",
    "brand": "Dell",
    "stars": 4.1,
    "reviewsCount": 112,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71ONP9xl3bL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Dell 14 Plus 7420 Notebook - 14-inch 2.2K 16:10 (2240x1400) Non-Touch Display, Intel Core i7-12700H, 16GB DDR5 RAM, 1TB SSD, Intel Iris Xe Graphics, Windows 11 Pro - Atlantic Blue.",
    "price": {
      "value": 1099.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YBS4TVK"
  },
  {
    "title": "HP Envy 17t-cr00 Home & Business Laptop (Intel i7-1260P 12-Core, 64GB RAM, 1TB PCIe SSD, Intel Iris Xe, 17.3\" 60Hz Touch Full HD (1920x1080), WiFi, Bluetooth, Backlit KB, Win 11 Pro) with Hub",
    "asin": "B0BGKBNXK5",
    "brand": "HP",
    "stars": 4.9,
    "reviewsCount": 10,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71m6Q1bJbBL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "GreatPriceTech sells computers with custom/upgraded configurations to enhance system performance. If the computer has modifications as listed above, the manufacturer’s box was opened by our highly skilled technicians for testing, inspection, and installation of the upgrades according to the specifications advertised. All computers and components are brand new.Processor: Intel Core i7-1260P 2.10GHz Processor (12th Gen, upto 4.7 GHz, 18MB Cache, 12-Cores, 16-Threads, 4 Performance-cores)Storage: 1TB PCIe SSD (Solid State Drive)Memory: 64GB DDR4 SO-DIMMGraphics: Intel Iris Xe Integrated Graphics, Operating System: Windows 11 Pro-64Connectivity: Wi-Fi 6E AX211, Bluetooth 5.2, Camera: 720p HD WebcamInput/Output:, Silver Backlit, Display: 17.3\" Full HD (1920x1080) 60Hz 16:9 Touchscreen IPS DisplayPorts/Slots:, 1 HDMI, 2 Thunderbolt 4 (Type-C), SDXC Reader, No Optical Drive, Headphone/Microphone Combo JackBattery: 65W Power Supply, 4-Cell 55 WHr BatteryColor: SilverForm/Style: StandardProduct Dimensions (WxLxH): 10 IN x 15 IN x 0.75 IN. Weight: 5.45lb1 Year Manufacturer warranty from GreatPriceTech (Professionally upgraded by GreatPriceTech)",
    "price": {
      "value": 1274.97,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BGKBNXK5"
  },
  {
    "title": "HP Chromebook 11A G8 Education Edition AMD A4-9120C 4GB DDR4-1866 SDRAM, 32GB eMMC 11.6-inch WLED HD Webcam Chrome OS (Renewed)",
    "asin": "B08NHSPCR6",
    "brand": "Amazon Renewed",
    "stars": 4.3,
    "reviewsCount": 160,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81LUKMXGZJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Chromebook built for schools and designed for learningHelp students reach their potential with cloud-first learning on the durable HP Chromebook 11A G8 that keeps pace with active student lifestyles while the fastbooting Chrome OS makes IT management easy.Give students a Chromebook that can survive a fall off a desk , a splash from a soda or a tugged power cord. It resists spills and attempts to remove keys, has metal-reinforced corners, and is 122 cm drop tested higherthan most desks.Quickly stream and access textbooks, tests, and more with AMD processors and the Chrome OS. Workcontinuously with long battery life and fast recharging. Easy to control and manage student interactions with HP Classroom Manager.",
    "price": {
      "value": 93.88,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08NHSPCR6"
  },
  {
    "title": "HP 15-dw Laptop Intel Core i3-1115G4 8GB 256GB SSD 15.6 Full HD WLED Win 10",
    "asin": "B09BBJVY41",
    "brand": "HP",
    "stars": 4.2,
    "reviewsCount": 294,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81qohiv33aL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "15.6\" FHD (1920 x 1080), IPS, micro-edge, anti-glare The barely visible bezel revolutionizes your display by letting a larger screen fit into a smaller frame. 11th Generation Intel Core i3-1115G4 processor 8GB system memory for advanced multitasking 256GB PCIe NVMe SSD storage Intel UHD Graphics: Smoothly stream content and play your favorite games. HP Fast Charge: Go from 0 to 50% charge in approximately 45 minutes. Fingerprint reader: Seamlessly log in into your device in any position with the touch of your finger. Patented 3-D fingerprint technology ensures secure access. Wi-Fi 5 (1x1) (802.11a/b/g/n/ac) & Bluetooth 4.2 HDMI out: Transmit digital HD video and sound to an external display. HP True Vision HD Camera: Video chat with vibrant clarity, even in low light. Tuned stereo speakers: HP custom tunes the dual speaker setup in every notebook for exceptional stereo quality.",
    "price": {
      "value": 345.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09BBJVY41"
  },
  {
    "title": "HP 15.6\" HD Intel 10th Gen i3-1005G1 3.4GHz 8GB RAM 256GB SSD Win 10 Laptop",
    "asin": "B089T6C53P",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 611,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71FADa695eL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "1",
    "price": {
      "value": 342,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B089T6C53P"
  },
  {
    "title": "HP 15.6 Inch Laptop, Intel Iris Xe Graphics, 11th Generation Intel Core Processor, 8 GB RAM, 256 GB SSD, Windows 11 Home (15-dy2024nr, Natural silver)",
    "asin": "B09FXFDGN3",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 3118,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71RD3vsjIYL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The HP 15 Laptop is designed to keep you productive and entertained from anywhere. With a micro-edge bezel and 82% screen-to-body ratio, your Windows laptop sports a revolutionary display, ideal for multi-monitor setups (1). Get the most of your entertainment wherever you are with a 15.6-inch, Full HD, IPS, micro-edge, and anti-glare display (2). Enjoy impressive graphical performance and best-in-class connectivity with Intel Iris Xe Graphics and 11th Generation Intel Core i5-1135G7 processor (3) (4). Out class traditional hard drives with 256 GB of PCIe NVMe M.2 SSD storage and experience improved multitasking with higher bandwidth thanks to 8 GB of RAM (5). This laptop computer gives you reliable power all day with 7 hours and 15 minutes of battery life (6). Plus, HP Fast Charge gets you from 0 to 50% charge in approximately 45 minutes to get you back up and running in a pinch (7). Work comfortably with the familiar feel of the Windows 10 Home operating system (8). Stay connected on the go as well with Wi-Fi 6 (2x2) and Bluetooth 5.2 combo, now supporting gigabit file transfer speeds (9) (10) (12). Bring the office home and stay as productive as before with a full-sized keyboard, MU-MIMO support, plus everything you need for web-conferencing with the HP True Vision 720p HD camera with integrated dual array digital microphones and advanced noise reduction software (13). Your laptop is built for the needs of tomorrow with its energy-efficient and sustainable design, backed by a 1-year limited hardware warranty. (1) Percent of active plus inactive viewing area to active viewing area plus border. Measure with the lid, vertical to the desk. (2) Full High Definition (FHD) content is required to view FHD images. (3) Shared video memory (UMA) uses part of the total system memory for video performance. System memory dedicated to video performance is not available for other use by other programs. (4) Multi-core is designed to improve performance of certain software products. Not all customers or software applications will necessarily benefit from the use of this technology. Performance and clock frequency will vary depending on the application workload and your hardware and software configurations. Intel’s numbering, branding, and/or naming is not a measurement of higher performance. Intel, Pentium, Intel Core, Celeron, Iris Xe, Intel logo, and the Intel Inside logo are trademarks of Intel Corporation in the U.S. and other countries. (5) Actual formatted capacity is less. A portion of internal storage is reserved for preloaded content. Based on HP internal testing using CrystalDiskMark benchmarking software. Performance is sequentially faster (read-only) compared to traditional 5,400 rpm HDD. (6) Windows 11 MobileMark 18 battery life will vary depending on various factors, including product model, configuration, loaded applications, features, use, wireless functionality, and power management settings. The maximum capacity of the battery will naturally decrease with time and usage. (7) Recharges your battery up to 50% within 45 minutes when the system is off (using the “shutdown” command). Recommended for use with the HP adapter provided with the notebook, not recommended with a smaller capacity battery charger. After charging has reached 50% capacity, charging speed will return to normal speed. Charging time may vary +/-10% due to System tolerance. (8) Not all features are available in all editions or versions of Windows. Systems may require upgraded and/or separately purchased hardware, drivers, software, or BIOS update to take full advantage of Windows functionality. Windows 11 is automatically updated, which is always enabled. ISP fees may apply and additional requirements may apply over time for updates. (9) Wireless access point and internet service required and sold separately. Availability of public wireless access points limited. Wi-Fi 6 (802.11ax) is backwards compatible with prior 802.11 specs. The specifications for Wi-Fi 6 are draft and are not final. If the final specifications differ from the draft specifications, it may affect the ability of the notebook to communicate with other Wi-Fi 6 devices. Only available in countries where 802.11ax is supported. (10) Bluetooth is a trademark owned by its proprietor and used by Hewlett-Packard Company under license. (11) Based on Wi-Fi 5 80MHz and Wi-Fi 6 160MHz minimum requirements when transferring files between two devices connected to the same router. Requires a wireless router, sold separately, that supports 802.11ax (Wi-Fi 6). Only available in countries where 802.11ax is supported. (12) Wi-Fi supporting gigabit speeds is achievable when transferring files between two devices connected to the same router. Requires a wireless router, sold separately, that supports 160MHz channels. (13) Features may require software or other 3rd party applications to provide the described functionality. Internet service required and not included. (14) Energy Star and the Energy Star mark are registered trademarks owned by the U.S. Environmental Protection Agency. (15) Based on U.S. EPEAT registration according to IEEE 1680.1-2018 EPEAT. EPEAT status varies by country. (16) External power supplies, power cords, cables, and peripherals are not Low Halogen. Service parts obtained after purchase may not be Low Halogen.",
    "price": {
      "value": 449,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09FXFDGN3"
  },
  {
    "title": "HP 2022 Notebook Laptop, 15.6\" HD Touchscreen Display, Intel Core i5-1135G7, 8GB DDR4 RAM, 512GB PCIe SSD, Wi-Fi 5, Webcam, Bluetooth, HDMI, Windows 11 Home, Silver | TGCD Bundle",
    "asin": "B0BJ44R3ND",
    "brand": "HP",
    "stars": 4.5,
    "reviewsCount": 547,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61XxCZh0EML.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Key Features and Benefits: CPU: Intel Core i5-1135G7 (2.4 GHz, up to 4.2 GHz, 8 MB Intel Smart Cache, 4 cores, 8 Threads) Memory: Up to 64GB DDR4 RAM Hard Drive: Up to 2TB PCIe NVMe M.2 Solid State Drive Operating System: Windows 11 Home Display: 15.6\" HD touchscreen (1366x768) Ports: 1 x SuperSpeed USB Type-C (5Gbps signaling rate) | 2 x SuperSpeed USB Type-A (5Gbps signaling rate) | 1 x HDMI 1.4b | 1 x AC smart pin | 1 x headphone/microphone combo | 1 x Multi-format SD media card reader Graphics: Intel Iris Xe Graphics Audio: HD Audio with Stereo Speakers Camera: HP Wide Vision 720p HD camera with camera shutter and integrated dual array digital microphones Wireless Connectivity: Realtek Wi-Fi 5 and Bluetooth 4.2 combo Power Supply: 3-cell, 41 Wh Lithium-ion prismatic Battery, 45 W Smart AC power adapter Dimensions: 14.11 x 9.53 x 0.71 in Weight: 3.75 lbs Color: Silver TGC bundle offer: ADATA 64GB microSDXC card",
    "price": {
      "value": 568.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BJ44R3ND"
  },
  {
    "title": "HP Pavilion 15 Laptop, 12th Generation Intel Core i7-1255U Processor, 16 GB RAM, 512 GB SSD, 15.6\" Full HD Display, Windows 11 Pro, Fingerprint Reader, Wi-Fi & Bluetooth, HD Webcam (15-eg2025nr 2022)",
    "asin": "B09T513YCJ",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 1099,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71H6BVX8MkL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "With its sleek, stylish design, full-sized keyboard, and numeric keypad, this eye-catching compact HP Pavilion Laptop looks as good as it performs so you can work from anywhere. Enjoy vibrant, crystal-clear images with 178-degree viewing angles on a 15.6-inch diagonal, FHD (1920 x 1080), IPS, micro-edge, BrightView screen (1), plus experience outstanding performance and visuals thanks to this laptop’s 12th Generation Intel Core i7-1255U processor (2) and Intel Iris Xe graphics (3). With its 512 GB PCIe NVMe M.2 Solid State Drive (4), your HP computer laptop offers the storage you need with up to 15x faster performance than a traditional hard drive (5), plus 16 GB DDR4-3200 MHz RAM (2 x 8 GB) to get things done.",
    "price": {
      "value": 789.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09T513YCJ"
  },
  {
    "title": "HP Chromebook 11-inch Laptop - MediaTek - MT8183 - 4 GB RAM - 32 GB eMMC Storage - 11.6-inch HD Display - with Chrome OS™ - (11a-na0010nr, 2020 model)",
    "asin": "B08HJT1BKQ",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 2285,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81EY2GIfktL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "This Ash Gray HP Chromebook 11a Laptop is light and durable, so you can work or play on the go. It travels well and has a long battery life, letting you stay connected without having to search for an outlet. Switch between using this laptop for gaming, connecting with friends, and getting your schoolwork done with the powerful MediaTek mobile processor, full-size keyboard, and 11-inch display. Also, Google Chrome and Android apps are all seamlessly integrated on Google’s easy-to-use OS. And once you’ve gotten into your workflow, enjoy the anti-glare, 11-inch laptop screen with high-definition detail of 1 million pixels. This beautiful display is paired up with the MediaTek Integrated Graphics card, which has Octa-core CPU and GPU graphics processors and a multimedia engine, so you can watch movies, shows, or seminars without draining the battery. This portable, powerful HP laptop has all the efficiency and technology you need.",
    "price": {
      "value": 124,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08HJT1BKQ"
  },
  {
    "title": "HP 2023 14\" FHD IPS Laptop, Windows 11, Ryzen 3 Processor Up to 3.50GHz, 4GB Ram, 256GB SSD, Super-Fast WiFi, Dale Silver (Renewed)",
    "asin": "B0BTMV5BPY",
    "brand": "Amazon Renewed",
    "stars": null,
    "reviewsCount": null,
    "thumbnailImage": "https://m.media-amazon.com/images/I/7172KtHzK5L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The product is refurbished and is fully functional. Backed by the 90-day Amazon Renewed Guarantee. - This pre-owned product has been professionally inspected, tested and cleaned by Amazon qualified vendors. - Products correspond to one of the following cosmetic conditions: Excellent condition - no signs of cosmetic damage when held 12 inches away. Good condition - Light scratches, barely visible when holding the device 12 inches away. Acceptable condition - Scratches visible when holding the device 12 inches away and perceptible to the touch. - This product will have a battery that exceeds 80% capacity relative to new. - Accessories may not be original, but will be compatible and fully functional. Product may come in generic box. - This product is eligible for a replacement or refund within 90 days of receipt if it does not work as expected.",
    "price": {
      "value": 225.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BTMV5BPY"
  },
  {
    "title": "2020 HP 14\" HD (1366 x 768) Thin and Light Laptop PC, Intel Celeron N4020 Dual-Core Processor, 4GB DDR4 Memory, 64GB eMMC, HDMI, WiFi, Bluetooth, Windows 10 S, 1 Year Microsoft 365, Snowflake White",
    "asin": "B08KLMKLZR",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 757,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71v4Zqi4ruS.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "SBUY ELITEDESK/800G6/DMI510500T8GB/256PC.",
    "price": {
      "value": 226.9,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08KLMKLZR"
  },
  {
    "title": "HP Stream 14 inches HD (1366x768) Display, Intel Celeron N4000 Dual-Core Processor, 4GB RAM, 64GB eMMC, HDMI, WiFi, Webcam, Bluetooth, Win10 S, Royal Blue (Renewed)",
    "asin": "B08F3TNHFJ",
    "brand": "Amazon Renewed",
    "stars": 4.3,
    "reviewsCount": 1235,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71sOrI1hB9L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 219.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08F3TNHFJ"
  },
  {
    "title": "HP Stream 14-inch Laptop, Intel Celeron N4000, 4 GB RAM, 64 GB eMMC, Windows 10 Home in S Mode With Office 365 Personal For 1 Year (14-cb185nr, Royal Blue)",
    "asin": "B084SKWC89",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 1946,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81RCOr3hJOL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Designed for the always connected life, this nimble laptop lets you easily shift from homework workhorse to streaming your favorite shows. With its portable design, long battery life, and powerful Wi-Fi antenna, it delivers the essential productivity and features you want, without ever slowing you down.- With a thin, lightweight design and bold look, this laptop was never meant to stand still. It travels easily and comes in a vibrant, non-traditional color for a uniquely personal look.- Experience the most secure Windows ever built, streamlined for security and superb performance. Add in full access to Microsoft Excel, Word, PowerPoint, OneNote, Access, and 1 TB of OneDrive Storage for one year, for improved productivity.- The improved 802.11 ac 2x2 Wi-Fi antenna delivers a stronger, more reliable Internet connection than before and with over 10 hours of battery life, you'll enjoy enhanced streaming, fast downloads, and smooth web surfing all day.- Easily take this thin and light PC from room to room or on the road. When your PC goes wherever you go, staying productive and entertained has never been easier.",
    "price": {
      "value": 244.97,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B084SKWC89"
  },
  {
    "title": "HP Chromebook 14-inch FHD Laptop, Intel Celeron N4000, 4 GB RAM, 32 GB eMMC, Chrome (14a-na0050nr, Mineral Silver)",
    "asin": "B08529CQPK",
    "brand": "HP",
    "stars": 4.5,
    "reviewsCount": 6081,
    "thumbnailImage": "https://m.media-amazon.com/images/I/91shKLxoedL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The best of work and play in one place. The HP Chromebook with an Intel processor, 14” display sporting more screen space, stereo speakers tuned by the audio experts at B&O and over 12 hours of battery life, you can knock out any assignment while binge watching your favorite shows. - The beauty of a micro-edge high definition display and speakers tuned by the audio experts at B&O, make for a front-row entertainment experience from the convenience of your lap. - Get the responsive performance you're looking for with an Intel processor, ample storage and a long battery life that helps you get everything done. - Redefine how you work and play with the seamless integration of your favorite Chrome browser, always secure and up to date, and access to a huge selection of apps in the Google Play Store. - The millions of Android apps you know and love on your phone and tablet can now run on your Chrome device without compromising their speed, simplicity, or security. - By squeezing a larger screen into a smaller frame, this narrow bezel optimizes your display's appearance with an efficient design. - Your PC runs cool and quiet, with no noisy hardware or unsightly vents, thanks to an innovative design that eliminates the fan. - HP Dual Speakers and audio custom-tuned in collaboration with the experts at B&O deliver rich, authentic audio. Let the sound move you. - When your laptop is low on power, no one has time to wait hours to recharge. Power down your device and go from 0 to 50% charge in approximately 45 minutes.",
    "price": {
      "value": 212,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08529CQPK"
  },
  {
    "title": "HP 2022 New 15 Laptop, 15.6\" HD LED Display, Intel Dual-Core Processor, Intel UHD Graphics, 16GB DDR4 RAM, 1TB SSD, Ethernet Port, USB Type-C, Long Battery Life, Windows 11",
    "asin": "B09SZPSTN1",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 529,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71rmymgVWVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Celeron N4020 (up to 2.8 GHz burst frequency, 4 MB L2 cache, 2 cores) Graphics: Intel UHD Graphics 600 Operating system: Windows 11 Home in S Mode Memory: 16GB DDR4 SDRAM  Hard Drive: 1TB Solid State Drive Optical Drive: No Display: 15.6\" HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSC Connectivity: Realtek RTL8821CE 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 combo Audio: HD Audio with stereo speakers Keyboard: US English, Full Size Keyboard Built-in HD Webcam: HP True Vision 720p HD camera with dual array digital microphones Media Drive: Multi-format SD media card reader Ports:  1 x SuperSpeed USB Type-C 5Gbps signaling rate 2 x SuperSpeed USB Type-A 5Gbps signaling rate 1 x AC smart pin 1 x HDMI 1.4b 1 x RJ-45 1 x Headphone / Mic Combo Jack   Battery: 3-cell, 41 Wh Li-ion Color: Silver Dimensions L x W x H (inches): 14.11 x 9.53 x 0.78 Weight: 3.86 lbs",
    "price": {
      "value": 419,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09SZPSTN1"
  },
  {
    "title": "Dell Inspiron 15 3520 Laptop - 15.6-inch FHD (1920x1080) 120Hz Display, Core i5-1235U Processor, 16GB DDR4 RAM, 512GB SSD, WiFi 6, Iris Xe Graphics, Win 11 Home - Carbon Black",
    "asin": "B09PHB7CS2",
    "brand": "Dell",
    "stars": 4,
    "reviewsCount": 44,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81x8wuiiloS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Dell Inspiron 15 3520 Laptop - 15.6-inch FHD (1920x1080) 120Hz Display, Intel Core i5-1235U Processor, 16GB DDR4 RAM, 512GB SSD, Intel Wifi 6, Intel Iris Xe Graphics, Win 11 Home - Carbon Black",
    "price": {
      "value": 674.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09PHB7CS2"
  },
  {
    "title": "Newest HP 14\" HD Laptop, Windows 11, Intel Celeron Dual-Core Processor Up to 2.60GHz, 4GB RAM, 64GB SSD, Webcam, Dale Pink(Renewed) (Dale Pink)",
    "asin": "B09VRX9YVW",
    "brand": "Amazon Renewed",
    "stars": 4.2,
    "reviewsCount": 837,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61MGsq1ZVaL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
    "price": {
      "value": 245,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09VRX9YVW"
  },
  {
    "title": "HP Stream 14inch HD(1366x768) Display, Intel Celeron N4000 Dual-Core Processor, 4GB RAM, 32GB eMMC, HDMI, WiFi, Webcam, Bluetooth, Win10 S, Rose Pink (Renewed)",
    "asin": "B07WZHW2J3",
    "brand": "Amazon Renewed",
    "stars": 4.3,
    "reviewsCount": 1794,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71SR3JaVu9L._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Newest HP Stream 14\" HD(1366x768) Display, Intel Celeron N4000 Dual-Core Processor, 4GB RAM, 32GB eMMC, HDMI, WiFi, Webcam, Bluetooth, Win10 S, Rose Pink(Renewed)",
    "price": {
      "value": 218.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07WZHW2J3"
  },
  {
    "title": "2022 Newest HP Laptop with Microsoft Office Included 1-Year, 15.6\" HD Screen, AMD Athlon 3050U 16GB RAM 1TB SSD HDMI Port Webcam Gold White Windows 11 | College Student Bundle, ROKC HDMI Cable",
    "asin": "B0B512DM4H",
    "brand": "HP",
    "stars": 4.2,
    "reviewsCount": 121,
    "thumbnailImage": "https://m.media-amazon.com/images/I/716frijAb7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Windows 11 Latest Operation System. 15.6\" HD Display 15.6\" diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSC. AMD Athlon Silver 3050U Processor AMD Athlon Silver 3050U (2.3 GHz base clock, up to 3.2 GHz max boost clock, 4 MB L3 cache, 2 cores). Upgraded tp 16GB DDR4 RAM Upgraded to 1TB Solid State Drive No Optical Drive Optical drive not included. AMD Radeon Graphics Smoothly stream content and play your favorite games. Dual Speakers Dual speaker with exceptional stereo quality. HD Webcam HP True Vision 720p HD camera with integrated dual array digital microphones. Wireless Connectivity Wi-Fi and Bluetooth 4.2 combo. Ports 1x USB Type-C, 2x USB Type-A , 1x HDMI, 1x AC smart pin, 1x headphone/microphone combo, 1x multi-format SD media card reader. Microsoft Office 365 One-year subscription to Microsoft Office 365. Accessories Wireless Mouse, Reversible Protective Sleeve",
    "price": {
      "value": 529.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B512DM4H"
  },
  {
    "title": "HP Newest Pavilion 15.6” Laptop, Intel Pentium Quad-Core Processor, Micro-Edge Display, RJ-45 Ethernet Port, USB Type-C, HDMI, Long Battery Life, NLY MP, Windows OS (8GB RAM | 512GB SSD) Red",
    "asin": "B0BG934S6K",
    "brand": "HP",
    "stars": 3.8,
    "reviewsCount": 23,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71wtPCOevVL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Pentium N5000 1.1GHz Quad-Core Processor (4MB Cache, Up to 2.7GHz)Graphics: Intel UHD GraphicsOperating system: Windows 10 Home in S modeMemory: 8GB DDR4 SDRAM Hard Drive: 512GB Solid State DriveOptical Drive: NoDisplay: 15.6\" diagonal, HD (1366 x 768) Display, micro-edge, anti-glare. BrightView display.Touchscreen: NoConnectivity: Realtek RTL8821CE 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 combo Miracast compatible; MU-MIMO supportedAudio: Dual SpeakersKeyboard: US English, Full-Size Keyboard with Numeric KeypadBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesMedia Drive: Multi-format SD media card readerPorts: ·        1 x SuperSpeed USB Type-C 5Gbps signaling rate·        2 x SuperSpeed USB Type-A 5Gbps signaling rate·        1 x AC smart pin·        1 x HDMI 1.4b·        1 x RJ-45 Ethernet Port·        1 x Headphone / Mic Combo Jack Battery: Up to 10.5 HoursColor: Scarlet RedDimensions L x W x H (inches): 14.11 x 9.53 x 0.78Weight: 3.92 lbs",
    "price": {
      "value": 429.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BG934S6K"
  },
  {
    "title": "HP 2023 Convertible 2-in-1 Chromebook Laptop, 14\" HD IPS Touchscreen, Intel Celeron Processor up to 2.60GHz, 4GB Ram, 64GB SSD, 4K Graphics, Super-Fast 6th Gen WiFi, Chrome OS, Dale Blue(Renewed)",
    "asin": "B0BSZH4QCY",
    "brand": "Amazon Renewed",
    "stars": 2,
    "reviewsCount": 3,
    "thumbnailImage": "https://m.media-amazon.com/images/I/610nIBOhDYL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The product is refurbished and is fully functional. Backed by the 90-day Amazon Renewed Guarantee. - This pre-owned product has been professionally inspected, tested and cleaned by Amazon qualified vendors. - Products correspond to one of the following cosmetic conditions: Excellent condition - no signs of cosmetic damage when held 12 inches away. Good condition - Light scratches, barely visible when holding the device 12 inches away. Acceptable condition - Scratches visible when holding the device 12 inches away and perceptible to the touch. - This product will have a battery that exceeds 80% capacity relative to new. - Accessories may not be original, but will be compatible and fully functional. Product may come in generic box. - This product is eligible for a replacement or refund within 90 days of receipt if it does not work as expected.",
    "price": {
      "value": 206.49,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BSZH4QCY"
  },
  {
    "title": "HP Newest 14\" HD Laptop, Windows 11, Intel Celeron Dual-Core Processor Up to 2.60GHz, 4GB RAM, 64GB SSD, Webcam, Dale Pink(Renewed) (Dale Blue)",
    "asin": "B09VZR2BGN",
    "brand": "Amazon Renewed",
    "stars": 4.1,
    "reviewsCount": 715,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61G9Yr3n6rL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Product works and looks like new. Backed by the 90-day Amazon Renewed Guarantee. - This pre-owned product has been professionally inspected, tested and cleaned by Amazon-qualified suppliers. - There will be no visible cosmetic imperfections when held at an arm’s length. - Products with batteries will exceed 80% capacity relative to new. - Accessories may not be original, but will be compatible and fully functional. Product may come in generic box. - This product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied under the Amazon Renewed Guarantee.",
    "price": {
      "value": 239.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09VZR2BGN"
  },
  {
    "title": "2022 HP Pavilion 15.6\" FHD Touchscreen Laptop, AMD Ryzen 7-5825U Up to 4.5GHz Processor (Beat i7-1180G7), 32GB RAM, 1TB PCIe NVMe SSD, Backlit Keyboard, USB-A&C, Fast Charge, Windows 11, Silver",
    "asin": "B0B27DN3YX",
    "brand": "HP",
    "stars": 4.2,
    "reviewsCount": 95,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71IlnHHTeRL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "We sells computers with professional upgrade and customization. The manufacturer box will be opened by our engineers for customizing and testing. Defects & blemishes are significantly reduced by our in depth inspection & testing. Processor: AMD Ryzen™ 7 5825U (up to 4.5 GHz max boost clock, 16 MB L3 cache, 8 cores, 16 threads)Graphics:AMD Radeon™ GraphicsDisplay: 15.6\" Touchscreen IPS Micro-Edge BrightView FHD (1920 x 1080) 250-Nits DisplayOperating system:Windows 11 Home-64 Operating SystemMemory: Up to 64GB DDR4 SDRAMHard Drive: Up to 2TB PCIe NVMe SSDKeyboard: Full-size Backlit Keyboard with Numeric KeypadTouchscreen: YesBluetooth: Bluetooth 5.2WLAN Connectivity: Realtek Wi-Fi 6 (1x2) and Bluetooth® 5.2 comboAudio: B&O Audio with dual speakersBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesPorts: 1x SuperSpeed USB Type-C (USB Power Delivery, DisplayPort™ 1.4, HP Sleep and Charge), 2x SuperSpeed USB Type-A, 1x HDMI 2.1, 1x Headphone/Microphone Combination JackColor: SilverBattery: 3-Cell 41WHr Li-ion BatteryDimensions L x W x H (inches): ‎ 14.18\" W x 9.21\" L x 0.70\" HWeight: 3.86 pounds",
    "price": {
      "value": 723.34,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B27DN3YX"
  },
  {
    "title": "HP 2022 Stream 14\" HD Laptop, Intel Celeron N4120 Processor, 8GB RAM, 64GB eMMC Storage, HD Webcam, HDMI, Wi-Fi, Bluetooth, Rose Gold, Office 365 1-Year, Windows 11 S, 32GB SnowBell USB Card",
    "asin": "B0BQ98HQ98",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 42,
    "thumbnailImage": "https://m.media-amazon.com/images/I/718iqv65iFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 319,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BQ98HQ98"
  },
  {
    "title": "HP 2022 Newest 17 Laptop, 17.3\" FHD IPS Display, Intel Core i5-1135G7 Quad-Core Processor, Intel Iris Xe Graphics, 16GB RAM, 1TB PCIe SSD, HDMI, Windows 11 + Microfiber Cloth",
    "asin": "B0B44DNGN4",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 353,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71iEZty7r2L._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: 11th Gen Intel Core i5-1135G7 2.40GHz Quad-Core Processor (8MB Intel Smart Cache, up to 4.20GHz)Graphics: Intel Iris Xe GraphicsOperating system: Windows 11 Home 64-bitMemory: 16GB DDR4 SDRAM Hard Drive: 1TB PCIe NVMe M.2 Solid State DriveDisplay: 17.3\" FHD (1920x1080) IPS, Anti-glareConnectivity: 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth comboAudio: HD Audio with stereo speakersKeyboard: US English, Full Size KeyboardBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesMedia Drive: Multi-format SD media card readerPorts: 1 x SuperSpeed USB Type-C 5Gbps signaling rate1 x SuperSpeed USB Type-C 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate1 x AC smart pin1 x AC smart pin1 x HDMI1 x HDMI1 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo Jack Battery: 3-cell, 41 WhColor: SilverDimensions L x W x H (inches): 15.78 in (W) x 10.15 in (D) x 0.78 in (H)Weight: 4.60 lbAccessory: Oydisen Microfiber Cloth",
    "price": {
      "value": 639.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B44DNGN4"
  },
  {
    "title": "HP 14'' Chromebook Laptop, Intel Celeron N4120, 4 GB RAM, 64 eMMC, HD Display, Chrome OS, Intel UHD Graphics 600, Long Battery Life, Ash Gray Keyboard (14a-na0226nr, 2022, Mineral Silver) (Renewed)",
    "asin": "B0B5YB7T57",
    "brand": "Amazon Renewed",
    "stars": 4.3,
    "reviewsCount": 52,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71tXLOE7wIL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
    "price": {
      "value": 152,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B5YB7T57"
  },
  {
    "title": "HP - 14\" Laptop - AMD Ryzen 3 - 8GB Memory - 128GB SSD - Natural Silver - Model 14-fq0033dx",
    "asin": "B0B9DMZVV2",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 45,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81gNI07678L._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "View more, carry less: See more of your screen on the 14 inch micro-edge bezel display. A thin and light design makes it easy to take this PC anywhere. Dependable performance: Tackle your busiest days with the performance of an AMD processor. Save more of what you love with plenty of storage for all your photos, videos and documents. Stay connected: Long-lasting battery life and HP Fast Charge technology lets you work, watch, and stay connected all day. Integrated precision touchpad with multi-touch support speeds up navigation and productivity.",
    "price": {
      "value": 300.9,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0B9DMZVV2"
  },
  {
    "title": "HP 2022 Flagship 15.6 HD Touchscreen IPS Laptop, 4-Core i5-1135G7(Up to 4.2GHz, Beat i7-1060G7), 16GB RAM, 1TBGB PCIe SSD, Iris Xe Graphics, Bluetooth, WiFi, Windows 11 Home S,w/GM Accessories",
    "asin": "B0BKQBCXVV",
    "brand": "HP",
    "stars": 4.1,
    "reviewsCount": 33,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81mCDt1ep5L._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Display Display:15.6\" diagonal, HD (1366 x 768), touch, micro-edge, BrightView, 220 nits, 45% NTSC Touch Screen:Yes Processor Processor:Intel Core i5-1135G7 (up to 4.2 GHz with Intel Turbo Boost Technology, 8 MB L3 cache, 4 cores) Storage Solid State Drive Capacity:Upgraded to 1TB Solid State Drive Interface:NVMe Memory System Memory (RAM):Upgraded to 16 GB DDR4-3200 MHz RAM (2 x 4 GB) Number Of Memory Slots:1 Number of Memory Sticks Included:1 Graphics Graphics Type:Integrated GPU Brand:Intel Graphics:Intel Iris Xe Graphics Video Memory Type:Shared Compatibility Operating System:Windows 11 Home in S Mode Voice Assistant Built-in:No Connectivity Wireless Networking:Wireless-AC Headphone Jack:Yes Microphone Input:Yes GPS Enabled:No Number of VGA Ports:0 Number of HDMI Outputs (Total):1 Number of USB Ports (Total):3 Number of USB 3.0 Type A Ports:2 Number of USB 3.0 Type C Ports:1 Number of DisplayPort Outputs (Total):0 Number of Thunderbolt Ports (Total):0 Wireless:Realtek RTL8822CE 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth 5 combo External ports:1 SuperSpeed USB Type-C 5Gbps signaling rate; 2 SuperSpeed USB Type-A 5Gbps signaling rate; 1 HDMI 1.4b; 1 AC smart pin; 1 headphone/microphone combo Power Battery Type:Lithium-ion Camera Front-Facing Camera:Yes Front Facing Camera Video Resolution:720p Built-In Microphone:Yes Features Backlit Keyboard:No Keyboard Touch Screen:No Touchpad Type:HP Imagepad Media Card Reader:Yes Audio Technology:HD Audio with stereo speakers Speaker Type:HD Audio with stereo speakers Dimension Product Dimension:0.71 x14.11 x 9.53 inches Product Weight:3.75 pounds",
    "price": {
      "value": 649.9,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BKQBCXVV"
  },
  {
    "title": "HP Pavilion Laptop (2022 Model), 15.6\" HD Display, Intel Celeron Quad-Core Processor, 8GB DDR4 RAM, 128GB SSD, Online Conferencing, Webcam, HDMI, WiFi, Bluetooth, Windows 11",
    "asin": "B09BBHXYZ9",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 569,
    "thumbnailImage": "https://m.media-amazon.com/images/I/711yMY-peLL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Pentium Silver N5000 1.1GHz Quad-Core Processor (4MB Intel Smart Cache, up to 2.70GHz)Graphics: Intel UHD Graphics 600Operating system: Windows 11 Home 64-bitMemory: HP 8GB DDR4 SDRAM Hard Drive: 128GB Solid State DriveOptical Drive: NoDisplay: 15.6\" diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSCTouchscreen: NoConnectivity: Realtek RTL8821CE 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 combo Miracast compatible; MU-MIMO supportedAudio: Dual SpeakersKeyboard: US English,  Non-Backlit Full Size Keyboard with Numeric KeypadBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesMedia Drive: Multi-format SD media card readerPorts: 1 x SuperSpeed USB Type-C 5Gbps signaling rate1 x SuperSpeed USB Type-C 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate1 x AC smart pin1 x AC smart pin1 x HDMI 1.4b1 x HDMI 1.4b1 x RJ-45 Ethernet Port1 x RJ-45 Ethernet Port1 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo JackBattery: Up to 10.5 HoursColor: Scarlet RedDimensions L x W x H (inches): 14.11 x 9.53 x 0.78Weight: 3.92 lbs",
    "price": {
      "value": 349,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09BBHXYZ9"
  },
  {
    "title": "2022 Newest HP Premium 14-inch HD Laptop| Intel Celeron N4020 to 2.8GHz 8GB RAM 128GB(64GB SSD+ Card)| Webcam Bluetooth HDMI USB-C Wi-Fi| Win 11 S with 1 Year MS 365| LIONEYE Bundle| Black",
    "asin": "B09XQNN6S3",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 153,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61sUu5crrML.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "We sell computers with upgraded configurations. If the computer has modifications (listed above), then the manufacturer box is opened for it to be tested and inspected and to install the upgrades to achieve the specifications as advertised. If no modifications are listed, the item is unopened and untested. Defects & blemishes are significantly reduced by our in-depth inspection & testing. OFFICE 365 FOR ONE YEAR: Get full access to Microsoft Excel, Word, PowerPoint, OneNote, Access, and 1 TB of OneDrive Storage for one year Processor Intel Dual-Core Celeron N4020 (1.1 GHz base frequency, up to 2.8 GHz burst frequency, 4 MB L2 Cache) Memory 8GB DDR4-2400 SDRAM Graphics Integrated Intel UHD Graphics 600 Hard drive 64 GB eMMC+64GB Storage card Display 14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSC Wireless connectivity WiFi 5 (2x2) Wi-Fi and Bluetooth 5.0 combo Expansion slots 1 media card reader External ports 1 USB Type-C 5Gbps 2 USB Type-A 5Gbps 1 HDMI 1.4b 1 AC Smart pin 1 Headphone/microphone combo Minimum dimensions (W x D x H)12.76 in x 8.86 in x 0.71 Weight3.24 lb",
    "price": {
      "value": 349.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09XQNN6S3"
  },
  {
    "title": "HP Newest 15.6 FHD IPS Flagship Laptop, 11th Gen Intel 4-Core i5-1135G7(Up to 4.2GHz, Beat i7-1060G7), 16GB RAM, 256GB PCIe SSD, Iris Xe Graphics, Bluetooth, WiFi, Win11,w/GM Accessories",
    "asin": "B08VNPGSF6",
    "brand": "HP",
    "stars": 4.4,
    "reviewsCount": 147,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81-O6maZmjL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "We sells computers with upgraded configurations. If the computer has modifications (listed above), then the manufacturer box is opened for it to be tested and inspected and to install the upgrades to achieve the specifications as advertised. If no modifications are listed, the item is unopened and untested. Defects & blemishes are significantly reduced by our in depth inspection & testing. Microprocessor: Intel Core i5-1135G7 (Base 2.4 GHz, up to 4.2 GHz, 8 MB L3 cache, 4 cores) Memory: 16GB DDR4 SDRAM Video graphics: Intel Iris Xe Graphics (Integrated) Hard drive: 256GB PCIe NVMe M.2 SSD Display: 15.6\" diagonal, FHD (1920 x 1080), IPS, micro-edge, anti-glareWireless connectivity: Wi-Fi and Bluetooth Expansion slots: 1 multi-format SD media card reader External ports: 1 SuperSpeed USB Type-C 2 SuperSpeed USB Type-A 1 HDMI 1.4b 1 AC smart pin 1 headphone/microphone combo Dimensions (W x D x H): 14.11 x 9.53 x 0.71 inches Weight: 3.75 lbsBattery type: 3-cell, 41 Wh Li-ionWebcam: HP True Vision 720p HD camera with integrated dual array digital microphones Audio features: Dual speakers System: Windows 11",
    "price": {
      "value": 569,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08VNPGSF6"
  },
  {
    "title": "HP Pavilion 17.3\" FHD IPS Laptop Newest 2022, 11th Gen Intel Core i5-1135G7(up to 4.2 GHz), 16GB DDR4 RAM, 1TB PCIe SSD, Wi-Fi 5, Bluetooth, Windows 11, Silver, w/ 3in1 Accessories",
    "asin": "B09MFCTDZ5",
    "brand": "HP",
    "stars": 4.3,
    "reviewsCount": 425,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71GpmCe7wjL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "SpecificationsProcessor : Intel Core i5-1135G7 (up to 4.2 GHz with Intel Turbo Boost Technology, 8 MB L3 cache, 4 cores) Graphics : Intel Iris Xe GraphicsOperating system : Windows 11 Memory : Upgrade to 16 GB DDR4 SDRAMHard Drive : Upgrade to 1 TB PCIe NVMe M.2 Solid State Drive Optical Drive : NoDisplay : 17.3\" diagonal, FHD (1920 x 1080), IPS, anti-glare, 300 nits, 100% sRGB Connectivity : Realtek RTL8821CE 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 comboAudio  : Dual SpeakersBuilt-in HD Webcam : HP True Vision 720p HD camera with integrated dual array digital microphones Media Drive : Multi-format SD media card readerPorts :1 x USB Type-A2 x SuperSpeed USB Type-A 5Gbps signaling rate1 x AC smart pin1 x HDMI 1.4b1 x Headphone / Mic Combo Jack Battery :3-cell, 41 Wh Li-ion, 45 W Smart AC power adapter, Up to 6.5 HoursColor  : Natural SilverDimensions L x W x H (inches) : 16.33 x 10.72 x 0.96 Weight : 4.6 lbsHow to switch s mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3.On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.",
    "price": {
      "value": 469.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09MFCTDZ5"
  },
  {
    "title": "HP Premium 14-inch HD Thin and Light Laptop, Intel Dual-Core Processor, 8GB RAM, 64GB Storage, Long Battery Life, Webcam, Bluetooth, HDMI, Wi-Fi, Rose Gold, Windows 11 + 1 Year Microsoft 365",
    "asin": "B0BKR6VQ1Y",
    "brand": "HP",
    "stars": 4.2,
    "reviewsCount": 123,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71Zn3apwjmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Celeron N4120 1.1GHz Quad-Core Processor (4MB Cache, Up to 2.6GHz)Graphics: Intel UHD Graphics 600Operating system: Windows 11 Home 64-bitMemory: 8GB DDR4 SDRAM Hard Drive: 64GB eMMCOptical Drive: NoDisplay: 14\" diagonal, HD (1366 x 768), micro-edge, BrightView, 220 nits, 45% NTSCConnectivity: Realtek 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth 5 comboAudio: Dual SpeakersKeyboard: US English,  Non-Backlit Full Size KeyboardBuilt-in HD Webcam: HP True Vision 720p HD camera with integrated dual array digital microphonesMedia Drive: Multi-format SD media card readerPorts: 1 x SuperSpeed USB Type-C 5Gbps signaling rate1 x SuperSpeed USB Type-C 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate2 x SuperSpeed USB Type-A 5Gbps signaling rate1 x AC smart pin1 x AC smart pin1 x HDMI 1.4b1 x HDMI 1.4b1 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo JackBattery: Up to 11 HoursColor: Rose GoldDimensions L x W x H (inches): 12.7 x 8.8 x 0.7Weight: 3.2 lbs",
    "price": {
      "value": 339,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BKR6VQ1Y"
  }
]
