[
  {
    "title": "Lenovo 15.6\" IdeaPad 1 Laptop, AMD Dual-core Processor, 15.6\" HD Anti-Glare Display, Wi-Fi 6 and Bluetooth 5.0, HDMI, Windows 11 Home in S Mode(20GB RAM | 1TB SSD)",
    "asin": "B0BMWBF3B1",
    "brand": "Lenovo",
    "stars": 4,
    "reviewsCount": 64,
    "thumbnailImage": "https://m.media-amazon.com/images/I/6137YYIY24L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: AMD Athlon Silver 3050U (3.2 GHz, 2 cores, 2 threads)Graphics: AMD Radeon GraphicsOperating system: Windows 11 Home in S mode, EnglishMemory: 20GB DDR4 SDRAM (Model #: 7EH99AA#ABB) Hard Drive: 1TB PCIe NVMe M.2 SSD + 128GB eMMC SSD startup diskDisplay: 15.6\" HD (1366 x 768) Anti-glare Display, TN 220nitsKeyboard: Standard Keyboard, Full size, US EnglishPorts: 1 x USB 2.01 x USB 2.01 x USB 3.2 Gen 11 x USB 3.2 Gen 11 x USB-C 3.2 Gen 1 (support data transfer only)1 x USB-C 3.2 Gen 1 (support data transfer only)1 x HDMI 1.4b1 x HDMI 1.4b1 x SD card reader1 x SD card reader1 x Headphone / microphone combo jack (3.5mm)1 x Headphone / microphone combo jack (3.5mm)1 x Power connector1 x Power connector Built-in HD Webcam: 720P Camera with Privacy ShutterMedia Drive: Multi-format SD media card readerConnectivity: Wi-Fi 6, 11ax, 2x2 + BlueTooth 5.0Audio: Stereo speakers, 1.5W x2, Dolby AudioMax Battery Life: Local video playback@150nits: 9.5 hrColor: GreyDimensions L x W x H (inches): 14.18 x 9.29 x 0.70 inchesWeight: 3.53 lbs",
    "price": {
      "value": 399,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BMWBF3B1"
  },
  {
    "title": "Lenovo - 2022 - IdeaPad 3i - Everyday Laptop Computer - Intel Core i5 12th Gen - 14.0\" FHD Display - 8GB Memory - 256GB Storage - Windows 11 Home",
    "asin": "B09YWKJMBD",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 377,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71skYbfsuDL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Experience powerful freedom with the Lenovo IdeaPad 3i laptop. Built with powerful 12th generation Intel® Core™ i5 U series processors, this slim and lightweight Windows laptop is designed to travel – you can study, work, and create anywhere. The 14\" FHD (1920 x 1080) display with 4-sided narrow bezels lets you see more and do more with better color accuracy and contrast. Your classes, calls, and conferences will also be smooth as can be with the integrated HD webcam with a privacy shutter, dual microphones, and two speakers with Dolby Audio®. Plus, you can integrate AI into your everyday work with Lenovo AI Engine features, including Smart Wireless to keep you from dropping your connections.The Lenovo IdeaPad 3i laptop is ready to travel with you, at an exceptionally 0.78\" slim and 3.30 lbs – it's the perfect size to slip into your laptop case and take with you everywhere. Enjoy more than 6 hours* of battery life – up to 10 hours* when streaming 1080p video – and get another 2 hours of battery life when you need it by charging for just 15 minutes with Rapid Charge Boost. You can stay connected at home or out with WiFi and Bluetooth®, plus one full-function USB-C port, two USB-A ports, HDMI™, and an audio jack.* All battery life claims are approximate and based on results using the MobileMark® 2018 v1.0.2.46 battery life benchmark test. Actual battery life will vary and depends on many factors such as product configuration and usage, software use, wireless functionality, power management settings, and screen brightness. The maximum capacity of the battery will decrease with time and use.",
    "price": {
      "value": 429.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YWKJMBD"
  },
  {
    "title": "Lenovo 2022 Ideapad 1i 14\" HD Laptop, Intel Celeron N4020 Processor, 4GB RAM, 64GB eMMC Flash Memory, Intel HD Graphics 500, HD Webcam, Stereo Speakers, Cloud Grey, Windows 11S, 128GB USB Card",
    "asin": "B0BKFZQ2LC",
    "brand": "Lenovo",
    "stars": 4.2,
    "reviewsCount": 49,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71NWyHPS-TL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "2022 Lenovo Ideapad 1i 14\" HD Laptop, Intel Celeron N4020 Processor, 4GB RAM, 64GB eMMC Flash Memory, Intel HD Graphics 500, HD Webcam, Stereo Speakers, Cloud Grey, Windows 11S, 128GB USB Card",
    "price": {
      "value": 199,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BKFZQ2LC"
  },
  {
    "title": "Lenovo IdeaPad Gaming 3 - 2022 - Everyday Gaming Laptop - NVIDIA GeForce RTX 3050 Graphics - 15.6\" FHD Display - 120 Hz - AMD Ryzen 5 6600H - 8GB DDR5 - 258GB SSD - Win 11 - Free 3-month Xbox GamePass",
    "asin": "B09RND1LP2",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 1390,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81zcUyiNcUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Elevate your game and esports experience beyond the realm of the \"acceptable\" with the IdeaPad Gaming 3 - a Windows PC that stands tall among your gaming circle. Engineered with the latest generation AMD Ryzen™ 6000 Series processors and NVIDIA® GeForce® RTX 3050 graphics, DDR5 memory and NVMe SSD storage options, this Lenovo gaming laptop is sleek, slim, and ready to deliver top-notch gaming performance. The 15.6\" FHD (1920 x 1080) IPS screen offers 120Hz refresh rate . Enjoy powerful sound with 2 x 2W stereo speakers with Nahimic Audio. A rear I/O notch streamlines your accessibility, positioning one USB 3.2 Gen 2 Type-C™ (DisplayPort™ 1.4, Power Delivery 3.0), an HDMI™ 2.0, a RJ45 port, and a DC-In port at the rear of the computer, and two USB 3.2 Gen 1 Type-A ports – one on the right side and one on the left. Stay connected using the built-in HD webcam with dual microphone array and physical privacy shutter, along with WiFi and Bluetooth®. Sleek, slim, and designed with simplicity, the IdeaPad Gaming 3 gaming laptop includes our signature Lenovo gaming keyboard, which comes with all the best media control and number pad features stocked out of the box. Don't settle – choose this great hybrid gaming PC.",
    "price": {
      "value": 723.95,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09RND1LP2"
  },
  {
    "title": "Lenovo 2022 Newest Ideapad 3 Laptop, 15.6\" HD Touchscreen, 11th Gen Intel Core i3-1115G4 Processor, 8GB DDR4 RAM, 256GB PCIe NVMe SSD, HDMI, Webcam, Wi-Fi 5, Bluetooth, Windows 11 Home, Almond",
    "asin": "B08B6F1NNR",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 1975,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61QGMX0Qy6L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Key Features and Benefits:CPU: 11th Gen Intel Core i3-1115G4 Dual-Core 3.0GHz Processor (6MB Intel Smart Cache, up to 4.10GHz)Memory: Up to 20GB DDR4 RAMHard Drive: Up to 1TB PCIe NVMe M.2 Solid State DriveOperating System: Windows 11 HomeDisplay: 15.6\" HD TouchscreenScreen Resolution: 1366 x 768Backlit Keyboard: NoPorts: 2 x USB 3.2 Gen 1 Type-A, 1 x USB 2.0 Type-A, 1 x HDMI, 1 x Combination Audio JackVideo: Intel UHD GraphicsAudio: Dolby Audio with Stereo SpeakersMedia Drive: Multi-format SD Media Card ReaderOptical Drive: NoneWireless Connectivity: Wireless-AC Wi-Fi 5 and Bluetooth ComboBuilt-in HD Webcam with Microphone: YesBattery: Lithium-ion, up to 7 HoursBluetooth: YesWeight: 3.64 PoundsColor: Almond",
    "price": {
      "value": 380.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08B6F1NNR"
  },
  {
    "title": "Lenovo IdeaPad 3 11 Chromebook Laptop,11.6\" HD Display,Intel Celeron N4020, 4GB RAM, 64GB Storage, UHD Graphics 600, Chrome OS, Onyx Black",
    "asin": "B087YW8FQB",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 4564,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71XIwK5G75L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Enjoy more simplicity and productivity with the fast, fun, and flexible Lenovo Chromebook 3 11-inch laptop. This convenient and portable Chromebook laptop couldn't be easier to use – just log in with your Google account and you're ready to go! No setup needed to get right to work or play. Plus, with access to the rich library of apps on Google Play, you'll have the latest programs at your fingertips. Work with others using Google's suite of collaboration software, like Google Sheets and Docs; when you work via the cloud, you can access everything you need no matter where you are, even offline. Google Assistant, Google Play Store, and Android™ Studio are preloaded.Chromebook computers are made to be streamlined and responsive, and the Intel Celeron N4020 processor and eMMC flash storage provide fast system response. Enjoy three-side narrow bezels on the HD display, allowing you to watch your favorite movies and videos with great clarity and fewer distractions. The IdeaPad 3-11\" Chromebook also includes two USB-C ports, two USB-A ports, a microSD™ card reader, and an audio jack, plus 802.11 ac WiFi and Bluetooth 4.1 built-in for strong, stable connections. And with up to 10 hours of battery life*, you can take your Chromebook with you everywhere.*Battery life based on testing with PLT (power load test). Battery life varies significantly with settings, usage, and other factors.",
    "price": {
      "value": 126,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B087YW8FQB"
  },
  {
    "title": "Lenovo - 2022 - IdeaPad Flex 5i - 2-in-1 Chromebook Laptop Computer - Intel Core i3-1115G4 - 13.3\" FHD Touch Display - 8GB Memory - 128GB Storage - Chrome OS",
    "asin": "B09RNCN3YV",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 658,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81uDDuBAwpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Hit the ground running with the IdeaPad Flex 5i Chromebook, one of the most versatile Chromebooks on the market. This 13\" notebook computer merges accessibility with power, with an 11th Generation Intel® Core™ i3 processor to handle even the most arduous tasks without a hint of strain. With the slim and light 360° convertible design, you can use it as a laptop, in tablet mode for an intuitive touchscreen experience, or in stand or tent mode to show off your latest photo slideshow or stream your favorite movies. The 10 hours* of battery life means that you can take it with you wherever you go without worry while playing games or browsing the Internet via WiFi. The IdeaPad Flex 5i Chromebook is designed with a physical privacy shutter. When you're not on a video call, simply slide the shutter over the webcam to secure your privacy. And as a Chromebook, you can quickly access all your files, photos, music, and more with ease – just login to your Google account and you're ready to go! Talk to Google to help you multitask, control your smart home devices, and manage your day. Stay connected with built-in WiFi and Bluetooth®, 2 USB-C ports, a USB-A port, a microSD™ card reader, and an audio combo jack.* Battery life based on testing with PLT (power load test). Battery life varies significantly with settings, usage, and other factors.",
    "price": {
      "value": 299.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09RNCN3YV"
  },
  {
    "title": "2022 Newest Lenovo IdeaPad 1 Laptop, 14\" Anti-Glare Display, Intel Quad-Core Processor, Intel UHD Graphics, 4GB RAM, 256GB PCIe SSD, Windows 11 + Microfiber Cloth",
    "asin": "B08NFDW4JS",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 269,
    "thumbnailImage": "https://m.media-amazon.com/images/I/612fUs8+brL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: Intel Pentium Silver N5030 Quad-Core Processor (4C / 4T, 1.1 / 3.1GHz, 4MB)Graphics: Intel UHD GraphicsOperating system: Windows 11 Home 64-bitAccessory: Oydisen Microfiber ClothMemory: 4GB DDR4 SDRAM Hard Drive: 256GB PCIe NVMe M.2 Solid State DriveDisplay: 14\" HD (1366x768) TN 220nits Anti-glareConnectivity: Realtek 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 comboAudio: 2 x 1.5W Speakers with Dolby AudioKeyboard: US EnglishBuilt-in HD Webcam: 720P Camera with Privacy Shutter and Dual Array MicrophonesMedia Drive: Multi-format SD media card readerPorts: 2 x USB 3.2 Gen 12 x USB 3.2 Gen 11 x HDMI 1.41 x HDMI 1.41 x AC smart pin1 x AC smart pin1 x Card reader1 x Card reader1 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo Jack Battery: Integrated 32WhColor: Platinum GreyDimensions L x W x H (inches): 12.88 x 9.25 x 0.69 inches Weight: 3.09 lbs",
    "price": {
      "value": 269,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08NFDW4JS"
  },
  {
    "title": "Lenovo - 2022 - IdeaPad 1i - Browse Laptop Computer - Intel Core i3 - 14.0\" HD Display - 4GB Memory - 128GB Storage - Windows 11 in S Mode",
    "asin": "B09YWPDCP6",
    "brand": "Lenovo",
    "stars": 4.3,
    "reviewsCount": 86,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71Up2mfnQGL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "We've raised the bar with the Lenovo IdeaPad 1i laptop. This Windows notebook is unmatched in efficiency and mobility, powered by ultra-fast Intel 12th Generation processors. The IdeaPad 1i laptop packs responsive performance in a thin and compact 17.9 mm chassis that weighs in at only 3.1 lbs, making multitasking on-the-go a breeze. It's the perfect computer for home, school, WFH professionals, or anyone who needs a light, efficient laptop that's ready to travel with them. The 14\" high-def screen has a generous Active Area Ratio – the amount of screen compared with the size of its borders – so you can maximize your entertainment and make the most of your screentime. Stream your favorite movies, browse and shop online, and connect with others with the Lenovo IdeaPad 1i laptop. WiFi and Bluetooth® are built right in, and you'll enjoy a variety of ports, including USB-C and USB-A, HDMI™, an SD card reader, and an audio jack. Get the most out of your device with Dolby Audio® speakers, along with 10 hours* of battery life and rapid charge. Plus, you can lock down your device with the physical privacy shutter on the 720P camera, keeping prying eyes out — even after video calls. No matter where you travel, this easy to use, portable laptop is ready to help you perform.* All battery life claims are approximate. Actual battery life will vary and depends on many factors such as product configuration and usage, software use, wireless functionality, power management settings, and screen brightness. The maximum capacity of the battery will decrease with time and use.",
    "price": {
      "value": 259,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YWPDCP6"
  },
  {
    "title": "Lenovo T470 14in Laptop, Core i5-6300U 2.4GHz, 8GB RAM, 256GB Solid State Drive, Windows 10 Pro 64Bit (Renewed)",
    "asin": "B07PY922PM",
    "brand": "Amazon Renewed",
    "stars": 4.5,
    "reviewsCount": 33,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51PIOLXXmfL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
    "price": {
      "value": 176.89,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B07PY922PM"
  },
  {
    "title": "Lenovo Legion Pro 7i 16\" QHD+ 500nits Gaming Laptop 240Hz Intel Core i9-13900HX 16GB RAM 1TB SSD NVIDIA GeForce RTX 4080 12GB Windows 11 Onyx Grey",
    "asin": "B0BVRQT7GN",
    "brand": "Lenovo",
    "stars": null,
    "reviewsCount": null,
    "thumbnailImage": "https://m.media-amazon.com/images/I/31MkhZHlIDL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The World's Most Powerful AI Tuned Gaming Laptops AI-tuned via Lenovo AI Engine+ and LA AI chip for tremendous performance, the Legion Pro 7i flaunts fully-powered 13th Gen Intel Core Processors and 40 Series NVIDIA GeForce RTX Graphics for searing processing power. The all-new Legion Coldfront 5.0, with vapor chamber cooling, liquid metal, an expanded intelligent intake, and an upgraded fan and exhaust system with customized fan curve controls keeps things cool as can be while you game, work, and create all-day on a massive up to 99.99Whr battery. Including Lenovo’s proprietary PureSight Gaming Display, coming in at 16\", 16:10, WQXGA with high variable refresh rates, alongside a Legion TrueStrike with per-key RGB powered by Legion Spectrum, gets you truly into your game and ready to play. Now with an more sustainable design forged from recycled aluminum and magnesium, cast in a fittingly-styled Onyx Grey, the Legion Pro 7i is truly the next generation of performance, power, and design. 13th Gen Intel Core Processors. Beyond Performance. Stream, create and compete at the highest levels – 13th Gen Intel Core processors push your gameplay beyond performance, giving you the power to do it all. Fully Powered NVIDIA GeForce RTX Graphics Cards. Beyond Fast. Ray Tracing, Tensor Cores, AI supercharged with DLSS 3 technology. Fully powered NVIDIA GeForce RTX Graphics. Smarter Gaming. Higher Framerates. Lenovo AI Engine+ The Lenovo AI Engine+ and Legion Coldfront 5.0 cooling system, AI augments the Legion Pro Series to boost FPS for the ultimate competitive advantage. A Display Born To Compete Obliterate the competition in stunning detail on a massive 16\" 16:10 WQXGA (2560 x 1600) display with up to 240hz of variable refresh rates. Manufacturer: Lenovo. Manufacturer Part Number: 82WQ0",
    "price": {
      "value": 2729.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BVRQT7GN"
  },
  {
    "title": "Lenovo IdeaPad 3 Laptop, 17.3\" HD+ Display, Intel Core i7-1165G7, Intel Iris Xe Graphics, Wi-Fi 6, Fingerprint Reader, Long Battery Life, Windows 11 (36GB RAM | 1TB PCIe SSD)",
    "asin": "B0BBP254MY",
    "brand": "Lenovo",
    "stars": 4.5,
    "reviewsCount": 34,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71E9U6SK0rL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: 11th Gen Intel Core i7-1165G7 2.80GHz Quad-Core Processor (12MB Intel Smart Cache, up to 4.7GHz) Graphics: Intel Iris Xe Graphics Operating system: Windows 11 Home 64-bit Memory: 36GB DDR4 SDRAM Hard Drive: 1 TB PCIe NVMe M.2 Solid State Drive Optical Drive: No Display: 17.3\" 1600 x 900 TN LCD Display Connectivity: Wi-Fi 6 (802.11ax) and Bluetooth 5 Audio: Dual-Mic Array & Dual 1.5W Speakers Keyboard: US English, Non-Backlit Full Size Keyboard Built-in HD Webcam: HD Webcam with Privacy Shutter and Dual Array Microphones Media Drive: Multi-format SD media card reader Ports:  1 x USB Type-A (USB 3.1 / USB 3.2 Gen 1) 1 x USB Type-A (USB 2.0) 1 x USB 3.1 / USB 3.2 Gen 1 1 x HDMI 1 x 1/8\" / 3.5 mm Headphone/Microphone Input/Output   Battery: Up to 7.5 Hours Color: Arctic Gray Dimensions L x W x H (inches): 10.79 x 15.71 x 0.78 Weight: 4.63 lbs",
    "price": {
      "value": 899,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BBP254MY"
  },
  {
    "title": "Lenovo Yoga 7i 16'' 2-in-1 Laptop 16\" 2.5K IPS Touchscreen 400 nits, 12th Gen Intel 12-Core i7-1260P 16GB RAM 1TB SSD Iris Xe Graphics, Fingerprint , Thunderbolt, Windows11 Home +Zipnology Cloth -New",
    "asin": "B0BLY7SBC7",
    "brand": "Lenovo",
    "stars": null,
    "reviewsCount": null,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51tIbnhQ27L._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor 12th Generation Intel Core i7-1260P Processor (E-cores up to 3.40 GHz P-cores up to 4.70 GHz)  Operating System Windows 11 Home  Graphics Integrated Intel Iris Xe graphics  Display 16\" WQXGA (2560 x 1600) IPS, glossy, touchscreen with Dolby Vision, 400 nits, 100% sRGB, low blue light  Memory 16 GB LPDDR5-4800MHz (Soldered) Memory  Storage 1 TB SSD M.2 2242 PCIe Gen4 TLC Storage  Security Webcam privacy shutter Fingerprint reader  Camera 1080p FHD IR Camera with Privacy Shutter  Keyboard Edge-to-edge keyboard with glass touchpad One-click function keys  Ports / Slots 2 x USB-A 3.2 Gen 1 2 x USB-C Thunderbolt 4 HDMI SD card reader Headphone / mic combo  What's in the box Yoga 7i 16\" Intel Internal Battery AC Adapter Quick Start Guide",
    "price": {
      "value": 1249,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BLY7SBC7"
  },
  {
    "title": "Lenovo Slim 7i: Core i7-12700H, Intel Arc A370M Graphics, 32GB DDR5 RAM, 1TB SSD, 16\" Touchscreen 2560x1600 144Hz Display, Backlit Keyboard, Windows 11",
    "asin": "B0BP2SJ7MG",
    "brand": "Lenovo",
    "stars": 5,
    "reviewsCount": 2,
    "thumbnailImage": "https://m.media-amazon.com/images/I/514qTmlHNtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Slim 7 i7 32G 1TB W11H",
    "price": {
      "value": 1049.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BP2SJ7MG"
  },
  {
    "title": "Lenovo Ideapad 1i 14\" HD Laptop Computer, Dual-Core Intel Celeron N4020, 4GB RAM, 64GB eMMC, HDMI, WiFi, Bluetooth, Type-C, Webcam, Long Battery, 1-Year Microsoft 365, Win 11S, Goldoxis 32GB SD Card",
    "asin": "B0BLBG6L4B",
    "brand": "Lenovo",
    "stars": 4.6,
    "reviewsCount": 6,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51GQBDM+gnL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "SUPERDEALSTORE sells computers with upgraded configurations. If the computer has modifications (listed above), then the manufacturer box is opened for it to be tested and inspected and to install the upgrades to achieve the specifications as advertised. If no modifications are listed, the item is unopened and untested. Through our in-depth inspection and testing, and defects can be significantly reduced. The IdeaPad 1i raises the bar on every affordable laptop with a super-efficient Intel Celeron N4020 processor in a thin and compact 17.9 mm chassis with up-to-10 hours of battery life and rapid charge. Get more value with four-sided narrow bezels for maximum screen, Dolby Audio speakers and Flip to Start for instant bootup. Processor: Intel Celeron N4020 (Base Frequency 1.1GHz, Max Turbo Frequency Up to 2.8GHz, 4MB L3 Cache, 2 Cores, 2 Threads)Memory: 4GB DDR4-SDRAM Storage: 64GB eMMC flash storage+ 32GB SD CARD Display: 14\" HD (1366x768) LCD Display Graphics: Integrated Intel UHD GraphicsNetworking: Intel Wi-Fi 6 AX201 802.11AX (2 x 2) + Bluetooth 5.1 Audio: 2 x 1.5W speakers with Dolby AudioCamera: HD 720p with Privacy Shutter  Battery: Integrated 42Wh, Up to 10 hours Keyboard: Non-Backlit, English Dimensions: 12.8 x 8.52 x 0.70\" Weight: 2.87 pounds Ports: Ports:1 Power in; 1 USB-A 3.2 Gen 1; 1 HDMI; 1 USB-C 3.2 Gen 1; 1 Headphone / mic combo; 1 SD card reader; 1 USB-A 2.0 Operating system: Windows 11 Home in S Mode. 1-year subscription to Microsoft Office 365color: Cloud Grey Accessory: GOLDOXIS 32GB SD CARD",
    "price": {
      "value": 179.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BLBG6L4B"
  },
  {
    "title": "Lenovo IdeaPad 3 14\" FHD Screen, Intel Core i7-1165G7 Processor, 20GB RAM, 1TB PCIe SSD, Webcam, Fingerprint Reader, HDMI, SD Card Reader, Wi-Fi 6, Windows 11 Home, Grey",
    "asin": "B0BCBNSQGP",
    "brand": "Lenovo",
    "stars": 4.8,
    "reviewsCount": 13,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71lK0+UExZL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Key Features and Benefits:CPU: Intel Core i7-1165G7 (4 Cores, 8 Threads, 12MB Cache, Base Frequency at 2.8 GHz, up to 4.7 GHz)Memory: Up to 20GB DDR4 RAMHard Drive: Up to 2TB PCIe Solid State DriveOperating System: Windows 11 HomeDisplay: 14\" Full HD 1920 x 1080, Non-Touch, Anti-GlarePorts: 1 x USB-A 2.0 1 x SD Card Reader1 x Headphone/ Mic Combo1 x USB-C 3.2 Gen 11 x HDMI1 x USB-A 3.2 Gen 1Video: Intel Iris Xe GraphicsAudio: Dolby Audio, 2 x 1.5W SpeakersMedia Drive: SD Card ReaderOptical Drive: NoneFingerprint Reader: YesBacklit Keyboard: NoneWireless Connectivity: Wi-Fi 6 and Bluetooth 5.0Built-in HD Webcam with Microphone: YesBattery: 3 Cell, 45 Wh, Li-PolymerDimensions: 12.76\" x 8.49\" x 0.78\"Weight: 4.55 lbsColor: Arctic Grey",
    "price": {
      "value": 620,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BCBNSQGP"
  },
  {
    "title": "Lenovo 2022 Upgraded Ideapad 1i Laptops, 14 inch HD Computer, Intel Celeron N4020, 4GB RAM, 128GB SSD(64GB SSD+64GB Card), 1-Year Office 365, Webcam, Wi-Fi, Bluetooth, Windows 11, LIONEYE HDMI Cable",
    "asin": "B0BM47K87R",
    "brand": "Lenovo",
    "stars": 4,
    "reviewsCount": 38,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81recNdH9YL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "1",
    "price": {
      "value": 169.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BM47K87R"
  },
  {
    "title": "Lenovo IdeaPad 1 Laptop, 14.0\" HD Display, Intel Celeron N4020, 4GB RAM, 64GB Storage, Intel UHD Graphics 600, Windows 11 in S Mode, Ice Blue",
    "asin": "B09BG85LRV",
    "brand": "Lenovo",
    "stars": 4.2,
    "reviewsCount": 1263,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71hhgeQCrOL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Lenovo IdeaPad™ 1 is your daily computing companion. Not only does this affordable laptop deliver amazing performance with an Intel® Celeron® processor, but it also features 64 GB M.2 PCIe SSD storage and a bigger, wider 14-inch HD display for great productivity. Browse the internet, stream your favorite shows, chat with family, or get work done on this reliable notebook computer. With a stylish Ice Blue case, this everyday laptop is easy to use and durable, with long battery life to let you handle daily tasks easily.Great for students, travelers, and those who like to work from home or the local coffee shop, the IdeaPad 1 is lightweight at just over 3 lbs and is less than 1 inch thick, so it's easy to slip into your Lenovo laptop backpack or carrying sleeve. Plus, with up to 8 hours of battery life, you can stay productive no matter where you are! You'll stay connected with integrated WiFi and Bluetooth® while on the go.",
    "price": {
      "value": 170,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09BG85LRV"
  },
  {
    "title": "Lenovo IdeaPad 1 14 Laptop, 14.0\" HD Display, Intel Celeron N4020, 4GB RAM, 64GB Storage, Intel UHD Graphics 600, Win 10 in S Mode, Ice Blue",
    "asin": "B08YKHYCPW",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 1651,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71IVTMa5JQL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Lenovo IdeaPad™ 1 is your daily computing companion. Not only does this affordable laptop deliver amazing performance with an Intel® Celeron® processor, but it also features 164 GB M.2 PCIe SSD storage and a 14-inch HD display for great productivity. Browse the internet, stream your favorite shows, chat with family, or get work done on this reliable notebook computer. With a stylish Ice Blue case, this everyday laptop is easy to use and durable, with long battery life to let you handle daily tasks easily.Great for students, travelers, and those who like to work from home or the local coffee shop, the IdeaPad 1 is lightweight at just over 3 lbs and is less than 1 inch thick, so it's easy to slip into your Lenovo laptop backpack or carrying sleeve. Plus, with up to 8 hours of battery life, you can stay productive no matter where you are! You'll stay connected with integrated WiFi and Bluetooth® while on the go.",
    "price": {
      "value": 170,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08YKHYCPW"
  },
  {
    "title": "Lenovo - IdeaPad 3 15\" HD Touch Screen Laptop - Intel Core i3-1115G4 - Intel UHD Graphics - 8GB Memory - 256GB SSD - Platinum Grey",
    "asin": "B09MF7DSMQ",
    "brand": "Lenovo",
    "stars": 4.2,
    "reviewsCount": 138,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81iKKYRE89L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "laptop",
    "price": null,
    "url": "https://www.amazon.com/dp/B09MF7DSMQ"
  },
  {
    "title": "Latest Lenovo ThinkPad E15 15.6\" FHD (Intel Quad-Core i5-1135G7 (Beats i7-10510U), 16GB RAM, 512GB SSD) IPS Business Laptop, Backlit Keyboard, Fingeprint, Thunderbolt 4, Win 10 Pro / Win 11 Pro",
    "asin": "B08PYF8DB6",
    "brand": "ist computers",
    "stars": 4.2,
    "reviewsCount": 58,
    "thumbnailImage": "https://m.media-amazon.com/images/I/6162q4lMy7L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 879.98,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08PYF8DB6"
  },
  {
    "title": "Lenovo IdeaPad 1i Student Laptop 14\" HD Display, Intel Pentium Silver N5030 Processor(4-Core, up to 3.1 GHz), 4GB RAM, 256GB Storage, WiFi, Webcam, HDMI, Windows 11 S, 1 Year Microsoft 365",
    "asin": "B0BTP12LBF",
    "brand": "Lenovo",
    "stars": 5,
    "reviewsCount": 7,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71B5z0eg2NL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "How to switch s mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store. Display: 14\" HD (1366x768) TN 220nits Anti-glare Processor: Intel Pentium Silver N5030 (4C / 4T, 1.10 up to 3.10 GHz, 4MB) Graphics: Integrated Intel UHD Graphics 605 Memory: 4GB Soldered DDR4-2400 Storage: Upgraded to 128GB eMMC 5.1 + 128GB PCIe SSD Card Reader: MicroSD Card Reader Optical: None Audio Chip: High Definition (HD) Audio Speakers: Stereo speakers, 1.5W x2, Dolby Audio Camera: 0.3MP Microphone: 2x, Array Touchscreen: None Keyboard: Non-backlit, English Operating System: Windows 11 Home in S mode, 64-bit Power: Integrated 42Wh, 10 hours of battery life  WLAN + Bluetooth: 11ac, 2x2 + BT4.2 Standard Ports: 1x USB 2.0 1x USB 3.2 Gen 1 1x USB-C 3.2 Gen 1 (support data transfer only) 1x HDMI 1.4b 1x Card reader 1x Headphone / microphone combo jack (3.5mm) 1x Power connector Case Color: Platinum Grey Dimensions (WxDxH): 12.8 x 8.52 x 0.70 inches Weight: 2.87 lbs",
    "price": {
      "value": 219.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BTP12LBF"
  },
  {
    "title": "Lenovo Flex 5 Laptop, 14.0\" FHD Touch Display, AMD Ryzen 5 5500U, 16GB RAM, 256GB Storage, AMD Radeon Graphics, Windows 11 Home, Graphite Grey",
    "asin": "B09BG96KFJ",
    "brand": "Lenovo",
    "stars": 4.5,
    "reviewsCount": 1256,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71zZiQGzc5L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Designed to provide excellent all-around performance, graphics, and productivity in a flexible device, the Lenovo Flex 5 14 14-inch laptop is built to be what you need it to be. Proudly powered by AMD Ryzen™ 5000 Series mobile processors with integrated AMD Radeon™ Graphics, the Flex 5 14 has a 360⁰ hinge and touchscreen display, making it easy to watch, work, and create to your heart's content. Reduce the clutter with four-sided narrow bezels for more viewing area on the FHD IPS panel. Plus, with a 12-hour battery* with Quick Charge, this slim and lightweight laptop is your ideal travel companion, whether you're working at the coffee shop or flying across the country.The Flex 5 14 is a 2-in-1 laptop that's made to be used the way you want. Flip the hinge and use the touchscreen in \"tablet\" mode to take notes, draw, or interact with the computer in intuitive ways. Fold it into the familiar \"laptop\" mode for everyday computing and productivity tasks. Put your convertible laptop in \"tent\" mode to share photos, videos, or documents so everyone can see your full HD screen. Or flip it into \"stand\" mode to watch your favorite streaming movies and shows. This easy-to-use laptop also comes with Windows 11 Home, a backlit keyboard, a webcam privacy shutter, and a fingerprint reader.* All battery life claims are approximate and based on results using the MobileMark® 2014 battery life benchmark test. Actual battery life will vary and depends on many factors such as product configuration and usage, software use, wireless functionality, power management settings, and screen brightness. The maximum capacity of the battery will decrease with time and use.",
    "price": {
      "value": 642.92,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09BG96KFJ"
  },
  {
    "title": "Lenovo IdeaPad 1 Laptop, 14\" HD Anti-Glare Display, Intel Quad-Core Pentium Silver N5030 (Beat i3-1005G1), Intel UHD Graphics, 4GB RAM, 256GB PCIe SSD, 1 Year Microsoft 365, Windows 11 + PCM USB Card",
    "asin": "B0BTK6T6BM",
    "brand": "Lenovo",
    "stars": 4.3,
    "reviewsCount": 11,
    "thumbnailImage": "https://m.media-amazon.com/images/I/613opkOG8OL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The premium Lenovo laptop, with powerful computing and connectivity features, is built for speed, multitasking and collaboration. Sleek, small, durable, the high performing PC delivers unparalleled results and snappy experience for intensive applications or everyday tasks at work, school or life. Super thin and light for easy portability  Processor Ultra-responsive Intel Pentium Silver N5030 Quad-Core Processor (4C / 4T, 1.1 / 3.1GHz, 4MB)   Memory 4GB DDR4 RAM invigorates powerful multitasking and seamless experience  Hard Drive 256GB SSD delivers instant boot-up, fast data access  Display & Graphics 14\" HD (1366x768) TN 220nits Anti-glare. Intel UHD Graphics   Operating System Windows 11 Home   Ports 2 x USB 3.2 Gen 1 - Quick data transfer (Data transfer only) HDMI - connect to HDTV or monitor Headphone/Microphone combo jack - true sound quality  Premium Features Connectivity: Realtek 802.11a/b/g/n/ac (1x1) Wi-Fi and Bluetooth 4.2 combo  Audio: 2 x 1.5W Speakers with Dolby Audio  Built-in HD Webcam: 720P Camera with Privacy Shutter and Dual Array Microphones  Media Drive: Multi-format SD media card reader",
    "price": {
      "value": 229,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BTK6T6BM"
  },
  {
    "title": "Lenovo Thinkpad T420 - Intel Core i5 2520M 8GB 320GB Windows 10 Professional (Renewed)",
    "asin": "B00W4AMWCI",
    "brand": "Amazon Renewed",
    "stars": 4,
    "reviewsCount": 509,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61LbBpwGXeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 201.88,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B00W4AMWCI"
  },
  {
    "title": "2022 Newest Lenovo IdeaPad Business Laptop, 15.6\" HD Touchscreen, 11th Gen Intel Core i3-1115G4 Processor, Intel UHD Graphics, 20GB RAM, 512GB PCIe NVMe SSD, Webcam, HDMI, Bluetooth 5.0, Windows 11",
    "asin": "B09YB6L657",
    "brand": "Lenovo",
    "stars": 4.2,
    "reviewsCount": 77,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71Dx5ylcdmL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: 11th Gen Intel Core i3-1115G4 3.0GHz Dual-Core Processor (6MB Intel Smart Cache, up to 4.10GHz)Graphics: Intel UHD GraphicsOperating system: Windows 11 Home 64-bitMemory: 20GB DDR4 SDRAM Hard Drive: 512GB PCIe NVMe M.2 Solid State DriveOptical Drive: NoDisplay: 15.6\" HD (1366x768) TN 220nits Anti-glare, TouchscreenConnectivity: 11ac, 2x2 + BT5.0Audio: 2 x 1.5W Speakers with Dolby AudioKeyboard: US English,  Non-Backlit Full Size KeyboardBuilt-in HD Webcam: 720P Camera with Privacy Shutter and Dual Array MicrophonesMedia Drive: Multi-format SD media card readerPorts: 1 x USB 2.01 x USB 2.02 x USB 3.2 Gen 12 x USB 3.2 Gen 11 x AC smart pin1 x AC smart pin1 x HDMI 1.41 x HDMI 1.41 x Headphone / Mic Combo Jack1 x Headphone / Mic Combo JackBattery: Up to 7.5 HoursColor: Platinum GreyDimensions L x W x H (inches): 14.26 x 9.98 x 0.78Weight: 3.75 lbs",
    "price": {
      "value": 499,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YB6L657"
  },
  {
    "title": "Lenovo Thinkpad 13 Laptop 13.3\" FHD (1920x1080) IPS Business Laptop, Intel 7th gen Celeron 3865U, 16GB DDR4 RAM, 256GB SSD, Webcam, Window 10 pro (Renewed)",
    "asin": "B0BS69XVFY",
    "brand": "Amazon Renewed",
    "stars": 5,
    "reviewsCount": 1,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61vbKvYWI2L._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Lenovo ThinkPad 13 IPS Business Laptop , with 16GB RMA and 256GB of data.Intel Celeron 3865U (2C, 1.8GHz, 2MB), long lasting battery .Operating System: Windows 10 pro 64 Bit – Multi-language supports English/Spanish/French.Display: 13.3\" screen with FHD 1920x1080 resolution.Webcam ,Wi-Fi,Bluetooth.Refurbished: In excellent condition, tested and cleaned by Amazon qualified vendors. 90-days Warranty.",
    "price": {
      "value": 169.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BS69XVFY"
  },
  {
    "title": "Lenovo 14\" Laptop, IdeaPad 1, Intel Quad-core Processor, 14\" HD Anti-Glare Display, 4GB RAM, HDMI, SD Card Reader, Long Battery Life, Includes MS Office 365, Windows 11 Home in S Mode (256GB SSD)",
    "asin": "B0BV7CW929",
    "brand": "Lenovo",
    "stars": 5,
    "reviewsCount": 2,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61W-PdopOgL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Bundled Software: Microsoft Office 365 Personal Processor: Intel Pentium Silver N5030 (4 Cores)Graphics: Intel UHD GraphicsOperating system: Windows 11 Home in S modeMemory: 4GB DDR4 SDRAMHard Drive: 128GB PCIe NVMe M.2 SSD + 128GB eMMC SSD startup diskDisplay: 14\" HD (1366 x 768) Anti-glare Display, TN, 220nitsPorts: 1 x USB 2.01 x USB 2.01 x USB 3.2 Gen 11 x USB 3.2 Gen 12 x USB-C 3.2 Gen 1 (support data transfer only)2 x USB-C 3.2 Gen 1 (support data transfer only)1 x Power connector1 x Power connector1 x HDMI 1.4b1 x HDMI 1.4b1 x Headphone / microphone combo jack (3.5mm)1 x Headphone / microphone combo jack (3.5mm)1 x Card reader1 x Card reader Connectivity: Wi-Fi 6 and Bluetooth 5.1Audio: High Definition (HD) AudioKeyboard: Standard Keyboard, US EnglishBuilt-in HD Webcam: HD 720p with Privacy ShutterMedia Drive: Multi-format SD media card readerBattery: 45W Round Tip (3-pin)Max Battery Life: Local video playback@150nits: 11 hoursColor: GreyDimensions L x W x H (inches): 12.8 x 8.52 x 0.70 inchesWeight: 2.87 lbs",
    "price": {
      "value": 199,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BV7CW929"
  },
  {
    "title": "Lenovo IdeaPad 1 14 Laptop, 14.0\" HD Display, Intel Celeron N4020, 4GB RAM, 64GB Storage, Intel UHD Graphics 600, Win 11 in S Mode, Cloud Grey",
    "asin": "B0BLW25MB7",
    "brand": "Lenovo",
    "stars": 4.2,
    "reviewsCount": 29,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71bphKmt0DL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "1",
    "price": {
      "value": 149,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BLW25MB7"
  },
  {
    "title": "Lenovo IdeaPad 1 Silver Slim Laptop Intel Processor N4020 up to 2.8Ghz 4GB DDR4 128GB SSD 14in FHD LED HDMI Win 11 Webcam (LE14-Renewed)",
    "asin": "B0BKQZJ85H",
    "brand": "Lenovo",
    "stars": 5,
    "reviewsCount": 1,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71GPx1jzqdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "At only 14 inches and light weight, the IdeaPad 1 can go anywhere. Enjoy all of this laptop’s features on a plane, train, bus, or boat, it won’t get in anyone’s way. With a battery the long lasting battery. Engineered with an Intel processors, the IdeaPad 1 laptop delivers dependable performance as you multitask effortlessly. Communicate with friends and family. Enjoy entertainment. Get your work done. Get the reliable performance that’s expected from Intel powered PCs. If you're looking for big picture on a compact screen, the IdeaPad 1 is designed with 2-sided narrow borders giving you more viewing area and less clutter, on a crystal-clear Full HD screen. Dolby Audio delivers robust sound whether you're watching a video or streaming music. With the built-in dual stereo speaker, you're sure to love what you hear on your IdeaPad.",
    "price": {
      "value": 174.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BKQZJ85H"
  },
  {
    "title": "Lenovo IdeaCentre AIO 3i 22\" All-in-One Computer, Intel Core i3-1115G4, FHD Touch Display, 8GB RAM, 256GB SSD, DVD RW Drive, Windows 11",
    "asin": "B09F7Q15JW",
    "brand": "Lenovo",
    "stars": 4.5,
    "reviewsCount": 465,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71ZOH88uZlL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Desktops › All-in-Ones",
    "description": "The IdeaCentre AIO 3i desktop computer is designed to perform and impress. This all-in-one computer is a pint-sized powerhouse, packing a wallop inside a compact chassis. Great things do come in the smallest packages, and housed in a sleek and compact frame, the Lenovo IdeaCentre AIO 3i delivers peak performance an 11th generation Intel® Core™ i3 processor, along with lightning-fast file transfer and boot times thanks to its 256GB SSD. Three-sided narrow bezels on the 22-inch FHD display and Harman®-certified stereo speakers make this the consummate family PC. It's great for personal productivity, working from home, or your child's schoolwork.Your household now has a store for its vast media library. Amass hundreds of movies and thousands of songs or videos with 256GB solid-state disk storage, which offers faster boot times, file transfers, and system responsiveness. Watch all of your favorites on the wide-angle full HD (1920 x 1080) touchscreen display, which also gives you more options for intuitive interaction with your computer - clicking and dragging files is easier than ever. This convenient AIO PC is made to make connecting simple, with a built-in webcam for videoconferencing and video chats that you can shut down for privacy. You'll also connect with wireless LAN (2x2 802.11 ac) and Bluetooth® combo card, plus multiple USB 2.0 and 3.2 ports, 1000 LAN, and HDMI™-out.",
    "price": {
      "value": 549.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09F7Q15JW"
  },
  {
    "title": "Lenovo Flex 5i 14\" Laptop Intel Core i3-1115G4 8GB Ram 256GB SSD W11H in S Mode (Renewed)",
    "asin": "B0BLX8C7ZB",
    "brand": "Amazon Renewed",
    "stars": 5,
    "reviewsCount": 5,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51ZWlFWmXEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The new Lenovo IdeaPad Flex 5i offers more ways to connect, interact, and immerse yourself making it a powerful combination of performance, connectivity, and entertainment with a 11th generation Intel Core i3 processor. Enjoy crisp visuals on the FHD display along with the rich sound of user-facing, Dolby Audio speakers all while connecting to Intel WiFi 5.",
    "price": {
      "value": 249.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BLX8C7ZB"
  },
  {
    "title": "Lenovo 15.6\" IdeaPad Laptop (Latest Model), AMD Athlon Dual Core Processor, 8GB RAM, 640GB SSD (128GB eMMC+512GB PCIe SSD), Webcam, HDMI, WiFi 6, USB Type-C, Long Battery Life, NLY MP, Windows 11",
    "asin": "B0BMSNCPR4",
    "brand": "Lenovo",
    "stars": 4.1,
    "reviewsCount": 7,
    "thumbnailImage": "https://m.media-amazon.com/images/I/812wpMGQ7zL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Product Overview:This Lenovo 15.6\" IdeaPad Laptop is perfect working for Home, Student, Professionals, Small Business, School Education, and Commercial Enterprise, Online Class, Google Classroom, Remote Learning, Zoom Ready.SpecificationsProcessor: Athlon Silver 3050U dual-core processorOperating system: Windows 11 Home 64-bit in S modeGraphics: AMD Radeon GraphicsMemory: 8GB DDR4 SDRAMHard Drive: 512GB PCIe SSD + 128GB eMMCDisplay: 15.6\" HD (1366 x 768) TN 220 nits Anti-GlareConnectivity: Wireless-AX and Bluetooth 4.2 comboAudio: 2 x 1.5W Speakers with Dolby AudioBuilt-in HD Webcam: 720P Camera with Privacy Shutter and Dual Array MicrophonesPorts:1 x USB 3.2 Type A1 x USB 3.2 Type C1 x USB 2.0 Type A1 x HDMI 1.41 x AC Smart Pin1 x Multi-format SD media card reader1 x Headphone / Mic Combo JackBattery Life (up to): 9.50 hoursColor: Cloud GreyDimensions L x W x H (inches): 14.2 x 9.2 x 0.7 inchesWeight: 3.52 lbs",
    "price": {
      "value": 349.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BMSNCPR4"
  },
  {
    "title": "Lenovo IdeaPad 3 Laptop, 14.0\" FHD Display, AMD Ryzen 5 5500U, 8GB RAM, 256GB Storage, AMD Radeon 7 Graphics, Windows 11 Home, Abyss Blue",
    "asin": "B09BG841VC",
    "brand": "Lenovo",
    "stars": 4.6,
    "reviewsCount": 1509,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71eLIuDmIgL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Lenovo IdeaPad 3 14\" laptop is a notebook computer that combines performance with purpose. This lightweight PC pairs an AMD 5000 series processor with lightning-fast responsiveness with tailored learning and work from home solutions that address eye strain, posture problems, and at-home distractions. The 14-inch full HD IPS display offers an anti-glare screen and 4-side narrow bezels, which translate to one of the highest active area ratios of its class. With integrated AMD Radeon™ 7 graphics, you'll enjoy beautifully clear and vibrant images with wider viewing angles and less clutter. Enjoy two 1.5W speakers with Dolby Audio™ plus a 720p camera with dual microphone array for your next video chat or conference call. Plus, the new privacy shutter on the camera lets you reserve complete control over your privacy, so there's no need to worry about malicious actors or accidentally leaving your webcam on.The IdeaPad 3 laptop also deploys intelligent thermals for a cool and whisper-quiet system, allowing you to calibrate performance and battery life. With Q-control, you can cycle through three modes to match your performance needs. This Windows laptop offers hyper-efficient battery life and supports Rapid Charge, so you can enjoy hours of 1080p video streaming and personal productivity. The Lenovo IdeaPad 3 14\" laptop is the ultimate notebook to learn from home and beyond.",
    "price": {
      "value": 491,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09BG841VC"
  },
  {
    "title": "Lenovo 2022 Chromebook Flex 3, 2-in-1 11.6\" HD Touchscreen for Business and Student Laptop, MediaTek MT8173C CPU, 4GB LPDDR3, 32GB eMMC, PowerVR Graphics, Webcam, Chrome OS, Grey, 128GB USB Card",
    "asin": "B08LYYRJ1Q",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 170,
    "thumbnailImage": "https://m.media-amazon.com/images/I/510z83I8JgL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Operating System:Chrome OS, boots up in seconds, updates automatically, and is protected by built-in virus protection. Chromebook is a computer for the way the modern world works, with thousands of apps, built-in virus protection and cloud backups. It is secure, fast, up-to-date, versatile and simple. Display:11.6\" HD 10-point multitouch screen Display, 1366 x 768 resolution boasts impressive color and clarity, Energy-efficient IPS LED-LCD screen. Processor:MediaTek MT8173C Processor, Ultra-low-voltage platform. Quad-core, four-way processing provides maximum high-efficiency power to go. Memory RAM:4GB LPDDR3 RAM, Plenty of high-bandwidth RAM to smoothly run your games as well as multiple programs. Storage Drive:32GB eMMC flash memory, This ultracompact memory system is ideal for mobile devices and applications, providing enhanced storage capabilities, streamlined data management, quick boot-up times and support for high-definition video playback. Graphics:Integrated PowerVR GX6250 graphics with shared video memory provide solid image quality for Internet use, movies, basic photo editing and casual gaming. Keyboard:Standard Keyboard, Allows you to enjoy comfortable and accurate typing. Audio:Dolby Audio with 2 x 2W stereo speakers deliver breathtaking, three-dimensional audio that flows above and around you with depth and precision. Webcam:Built-in HD webcam with microphone makes it easy to video chat with family, friends or teleconference over popular applications. Battery:3-cell Lithium-ion polymer Dimensions (WxDxH):11.5\" x 8.48\" x 0.77\" Ports:1x USB 3.1 Type A Port, 1x USB 3.1 Type C Port, 1x HDMI, 1x Media Card Reader, 1x Headphone/Microphone Combo. Network:Wireless-AC + Bluetooth",
    "price": {
      "value": 176,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B08LYYRJ1Q"
  },
  {
    "title": "Lenovo 2022 Newest Ideapad 3 Laptop, 15.6\" HD Touchscreen, 11th Gen Intel Core i3-1115G4 Processor, 8GB DDR4 RAM, 256GB PCIe NVMe SSD, HDMI, Webcam, Wi-Fi 5, Bluetooth, Windows 11 Home, Platinum Grey",
    "asin": "B09V273F3C",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 170,
    "thumbnailImage": "https://m.media-amazon.com/images/I/81M05PyYgYL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Key Features and Benefits: CPU: 11th Gen Intel Core i3-1115G4 Dual-Core 3.0GHz Processor (6MB Intel Smart Cache, up to 4.10GHz) Memory: Up to 20GB DDR4 RAM Hard Drive: Up to 1TB PCIe NVMe M.2 Solid State Drive Operating System: Windows 11 Home Display: 15.6\" HD Touchscreen Screen Resolution: 1366 x 768 Backlit Keyboard: No Ports: 2 x USB 3.2 Gen 1 Type-A, 1 x USB 2.0 Type-A, 1 x HDMI, 1 x Combination Audio Jack Video: Intel UHD Graphics Audio: Dolby Audio with Stereo Speakers Media Drive: Multi-format SD Media Card Reader Optical Drive: None Wireless Connectivity: Wireless-AC Wi-Fi 5 and Bluetooth Combo Built-in HD Webcam with Microphone: Yes Battery: Lithium-ion, up to 7 Hours Bluetooth: Yes Weight: 3.64 Pounds Color: Platinum Grey",
    "price": {
      "value": 324,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09V273F3C"
  },
  {
    "title": "Lenovo Flex 5 Laptop, 14.0\" FHD Touch Display, AMD Ryzen 5 5500U, 16GB RAM, 512GB Storage, AMD Radeon Graphics, Windows 11 Home, Graphite Grey",
    "asin": "B09YWM1CM1",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 85,
    "thumbnailImage": "https://m.media-amazon.com/images/I/719XEC7nGFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Get more done the way you want with the endlessly adaptable Lenovo Flex 5 2-in-1 touchscreen laptop. Powered by the latest AMD Ryzen™ 5 U series processors and 16GB DDR4 RAM, you can work faster and smarter, in the way that works best for you. The 360° convertible Lenovo Ideapad Flex 5 adapts and fits to your needs, moods, and environments. A tough-tested drop-down hinge lets you position the keyboard for more ergonomic typing, fold the computer into tent mode to stream your favorite show or share a video with friends, or flip it into tablet mode so you can use the touchscreen to use your apps or browse online. The tall and expansive 16:10 WUXGA touch display is a step up from most laptops, expanding your field of view. Use the included Lenovo Digital Pen to draw or take notes. With that big, bright, beautiful screen, you'll also enjoy speakers with Dolby Audio®.The Lenovo Flex 5 2-in-1 touchscreen laptop delivers refreshing speed and performance, bringing your experiences to life in a package that adapts to your needs. Work or play for hours on the go, then plug in for a Rapid Charge Boost that gets you 2 hours of battery on just 15 minutes of charging. Plus, you'll stay connected with a full-function Type-C™ port, WiFi, Bluetooth®, and a webcam with privacy shutter.",
    "price": {
      "value": 599.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YWM1CM1"
  },
  {
    "title": "Lenovo New IdeaPad 3i Business Laptop, 14\" FHD Display, Intel Core i5-10210U, Windows 10 Pro, 8GB RAM 256GB SSD, WiFi, Webcam, Bluetooth, HDMI, 32GB Durlyfish USB Card",
    "asin": "B09SHMLK62",
    "brand": "Lenovo",
    "stars": 4.1,
    "reviewsCount": 8,
    "thumbnailImage": "https://m.media-amazon.com/images/I/711H1QZxD3L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The premium IdeaPad 3i laptop, with powerful computing and connectivity features, is built for speed, multitasking and collaboration. Sleek, small, durable, the high performing PC delivers unparalleled results and snappy experience for intensive applications or everyday tasks at work, school or life. Super thin and light for easy portability  Processor Ultra-responsive 10th Generation Intel Core i5-10210U Processor (4-Core, 1.6 GHz Up to 4.2 GHz, 6 MB Cache)  Memory 8GB DDR4 RAM invigorates powerful multitasking and seamless experience  Hard Drive 256GB PCIe NVMe M.2 SSD (15x faster than HDD, ample storage) delivers instant boot-up, fast data access  Display & Graphics 14.0\" 1920 x 1080 FHD Display; Intel UHD Graphics   Operating System Windows 10 Pro-perfect for business/education  Ports 3 x USB-A - Quick data transfer (Data transfer only) HDMI - connect to HDTV or monitor Headphone/Microphone combo jack - true sound quality  Premium Features 2x2 802.11AC + and Bluetooth 5 delivers a stronger, more reliable Internet connection than before  2x 1.5W Speakers with Dolby Audio: deliver rich, authentic theater level audio",
    "price": {
      "value": 549,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09SHMLK62"
  },
  {
    "title": "Lenovo 2023 Newest Ideapad 14 Inch Student Laptop, Intel Pentium Silver N5030 4-Core, up to 3.1 GHz, 4GB RAM, 256GB Storage, 1 Year Office 365, WIFI6, Webcam, Bluetooth, Windows 11",
    "asin": "B0BPYNVH6B",
    "brand": "Lenovo",
    "stars": 4.8,
    "reviewsCount": 5,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71FDLqxMw2L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Microsoft 365 Personal Activate pre-installed Office: 1.Launch any Office app > 2.Start your activation by signing in with your Microsoft account(Create a account if you don't have one yet) > 3.Click \"Activative Office\" > 4.Sign in your account and follow the next prompts. > 5.Complete Step 1,2 and 3 > 6.Click on Refresh once Office is ready > 7.Open a document and accept the license agreement.How to switch s mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store. Display: 14\" diagonal, HD (1366 x 768)  Processor: Intel Pentium Silver N5030 Graphics: Intel UHD Graphics  Memory: 4GB Soldered DDR4 RAM Storage: Upgraded to 128GB eMMC+ 128GB PCIE SSD Card Reader: MicroSD Card Reader Optical: None Audio Chip: High Definition (HD) Audio Speakers: Stereo speakers, 1.5W x2, Dolby Audio Camera: 0.3MP Microphone: 2x, Array Operating System: Windows 11 S mode Power: Integrated 42Wh, 10 hours of battery life  WLAN + Bluetooth: 11ac, 2x2 + BT4.2 Standard Ports: 1x USB 2.0 1x USB 3.2 Gen 1 1x USB-C 3.2 Gen 1 (support data transfer only) 1x HDMI 1.4b 1x Card reader 1x Headphone / microphone combo jack (3.5mm) 1x Power connector",
    "price": {
      "value": 219,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BPYNVH6B"
  },
  {
    "title": "Lenovo ThinkPad T490 14.0 FHD (1920x1080) 250 nits IPS Anti-Glare Display - Intel Core i5-8265U Processor, 16GB RAM, 512GB PCIe-NVMe SSD, Windows 10 Pro 64-bit (Renewed)",
    "asin": "B083ZMWTNL",
    "brand": "Amazon Renewed",
    "stars": 3.9,
    "reviewsCount": 7,
    "thumbnailImage": "https://m.media-amazon.com/images/I/51mq3ujQrrL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
    "price": {
      "value": 319,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B083ZMWTNL"
  },
  {
    "title": "Lenovo 15.6\" IdeaPad 1 Laptop, AMD Dual-core Processor, 15.6\" HD Anti-Glare Display, Wi-Fi 6 and Bluetooth 5.0, HDMI, Windows 11 Home in S Mode(12GB RAM | 256GB SSD)",
    "asin": "B0BMWDBPCQ",
    "brand": "Lenovo",
    "stars": 3.4,
    "reviewsCount": 5,
    "thumbnailImage": "https://m.media-amazon.com/images/I/6137YYIY24L._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Processor: AMD Athlon Silver 3050U (3.2 GHz, 2 cores, 2 threads)Graphics: AMD Radeon GraphicsOperating system: Windows 11 Home in S mode, EnglishMemory: 12GB DDR4 SDRAMHard Drive: 256GB SSD (128GB PCIe NVMe M.2 SSD + 128GB eMMC SSD startup disk)Display: 15.6\" HD (1366 x 768) Anti-glare Display, TN 220nitsKeyboard: Standard Keyboard, Full size, US EnglishPorts: 1 x USB 2.01 x USB 2.01 x USB 3.2 Gen 11 x USB 3.2 Gen 11 x USB-C 3.2 Gen 1 (support data transfer only)1 x USB-C 3.2 Gen 1 (support data transfer only)1 x HDMI 1.4b1 x HDMI 1.4b1 x SD card reader1 x SD card reader1 x Headphone / microphone combo jack (3.5mm)1 x Headphone / microphone combo jack (3.5mm)1 x Power connector1 x Power connector Built-in HD Webcam: 720P Camera with Privacy ShutterMedia Drive: Multi-format SD media card readerConnectivity: Wi-Fi 6, 11ax, 2x2 + BlueTooth 5.0Audio: Stereo speakers, 1.5W x2, Dolby AudioMax Battery Life: Local video playback@150nits: 9.5 hrColor: GreyDimensions L x W x H (inches): 14.18 x 9.29 x 0.70 inchesWeight: 3.53 lbs",
    "price": {
      "value": 299,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BMWDBPCQ"
  },
  {
    "title": "Lenovo Ideapad 1i Thin Light Laptop, 14.0\" HD Display, Intel Celeron N4020(up to 2.80 GHz), 4GB RAM 64GB eMMC, WiFi 6, Webcam, 10Hr Battery, Windows 11 S, Cloud Grey",
    "asin": "B0BKZJLRTD",
    "brand": "Lenovo",
    "stars": 4.7,
    "reviewsCount": 4,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71GFmKlaYiL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "How to switch S mode to windows 111. On your PC running Windows 11 in S mode, open Settings > Update & Security > Activation.2. In the Switch to Windows 11 Home or Switch to Windows 11 Pro section, select Go to the Store. (If you also see an ''Upgrade your edition of Windows'' section, be careful not to click the ''Go to the Store'' link that appears there.)3. On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store. Display: 14'' HD (1366x768) TN 220nits Anti-glare Processor: Intel Dual-Core Celeron N4020 (1.1 GHz base frequency, up to 2.8 GHz burst frequency, 4 MB L2 Cache) Graphics: Integrated Intel UHD GraphicsMemory: 4GB Soldered DDR4 Storage: 64GB eMMC Card Reader: MicroSD Card Reader Optical: None Audio Chip: High Definition (HD) Audio Speakers: Stereo speakers, 1.5W x2, Dolby Audio Camera: Built-in 720p webcam with Privacy Shutter Microphone: 2x, Array Touchscreen: None Keyboard: Non-backlit, English Operating System: Windows 11 Home in S mode, 64-bit Power: 45 watts, Battery Life (up to) 10 hoursWLAN + Bluetooth: WiFi 6 - 802.11 ax + Bluetooth Standard Ports: 1x USB 2.0 Type A Ports 1x USB 3.2 Type A Ports 1x USB 3.2 Type C Ports 1x HDMI 1.4 1x Card reader 1x Headphone / microphone combo jack (3.5mm) 1x Power connector Case Color: Cloud Grey Dimensions (WxDxH): 12.81 x 8.52 x 0.7 inches Weight: 3.08 lbs",
    "price": {
      "value": 159,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BKZJLRTD"
  },
  {
    "title": "Lenovo - 2022 - IdeaPad 3i - Essential Laptop Computer - Intel Core i5 12th Gen - 15.6\" FHD Display - 8GB Memory - 512GB Storage - Windows 11 Pro",
    "asin": "B09RNC69K8",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 377,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71LsYu32caL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Travel farther and do more with the Lenovo IdeaPad 3i laptop computer. Designed with ultimate portability in mind, you can work, study, or play wherever you need. The powerful 12th generation Intel® Core™ i5 U series processors keep you performing at your best, while the Intel® Iris® Xe graphics – as well as plenty of screen real estate on the 15.6\" FHD IPS display – lets you enjoy better color accuracy and contrast. Plus, the IdeaPad 3i laptop is slim, sleek, and lightweight, making it easy to carry no matter where you go. Slip it into your favorite Lenovo laptop bag and carry it to school, to work, when you're traveling, or even to your favorite coffee shop when you need a break from working from home. The full-function Type-C™ port on this Windows laptop helps you connect displays, power your devices, and enables faster data transfer. But that's not your only option for connectivity – in addition to that USB-C port, the IdeaPad 3i also has two USB-A ports (one USB 3.2 and one 2.0), an HDMI™ port, an SD card reader, and an audio jack, plus built-in WiFi and Bluetooth®. Chat with colleagues or friends on the 720p HD camera with dual microphones, Dolby Audio®, and Smart Noise Cancelling. And when your call is done, just slide the physical privacy shutter over the webcam to ensure your privacy. The long-life battery will keep you going, and you can grab another 2 hours of battery life when you're on the go by charging just 15 minutes with Rapid Charge Boost.",
    "price": {
      "value": 529.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09RNC69K8"
  },
  {
    "title": "Lenovo Ideapad 1 15.6\" HD Laptop, Athlon Silver 3050U (Beats i3-1005G1) Dual-core Processor, 8GB RAM, 256GB SSD, WiFi, Webcam, Bluetooth, Win 11 S, Cloud Grey, TGC Bundle",
    "asin": "B0BM749LF7",
    "brand": "Lenovo",
    "stars": 5,
    "reviewsCount": 2,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71XdAQhhMwL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "TGCUS sells computers with upgraded configurations. If the computer has modifications (listed above), then the manufacturer box is opened for it to be tested and inspected and to install the upgrades to achieve the specifications as advertised. If no modifications are listed, the item is unopened and untested.  Processor:  Athlon Silver 3050U dual-core processorOperating system: Windows 11 Home 64-bit in S modeGraphics: AMD Radeon GraphicsMemory: 8GB DDR4 SDRAM Hard Drive: 256GB SSDDisplay: 15.6\" HD (1366x768) TN 220nits Anti-glareConnectivity:  Wireless-AX and Bluetooth 4.2 comboAudio: 2 x 1.5W Speakers with Dolby AudioBuilt-in HD Webcam: 720P Camera with Privacy Shutter and Dual Array MicrophonesPorts:   1 x USB 3.2 type A 1 x USB 3.2 type C 1 x USB 2.0 type A 1 x HDMI 1.4 1 x AC smart pin 1 x Multi-format SD media card reader 1 x Headphone / Mic Combo Jack Battery Life (up to): 9.50hoursColor: Cloud GreyDimensions L x W x H (inches): 12.81 x 9.51 x 0.7 inchesWeight: 3.52 lbsTGC Accessories: 64GB ADATA microSDXC SD card",
    "price": {
      "value": 298.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BM749LF7"
  },
  {
    "title": "Lenovo ThinkPad X1 Carbon Gen 10 Intel 14\", Touchscreen Laptop- 12th Gen Intel Core Windows 11 Pro i7-1270P vPro ,512 GB SSD - 32 GB IPS LPDDR5 5200MHz,Wi-Fi 6 Black + Zipnology Screen Cloth – New",
    "asin": "B0BRLBZTXT",
    "brand": "Lenovo",
    "stars": null,
    "reviewsCount": null,
    "thumbnailImage": "https://m.media-amazon.com/images/I/519mINCFkpL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "ThinkPad X1 Carbon Gen 10 Intel (14\") – Black with Zipnology Screen Cleaning Cloth Bundle – New System Specs:Processor: 12th Generation Intel Core i7-1270P vPro Processor (E-cores up to 3.50 GHz P-cores up to 4.80 GHz)Operating System: Windows 11 Pro 64Graphic Card: Integrated Intel Iris Xe GraphicsMemory: 32 GB LPDDR5 5200MHz (Soldered)Storage: 512 GB SSD M.2 2280 PCIe Gen4 Performance TLC OpalDisplay: 14.0\" WUXGA (1920x1200), IPS, Anti-Glare, Touch, 100%sRGB, 400nits, LED Backlight, Narrow Bezel, 60Hz, Low Blue LightCamera: 1080P FHD RGB with ThinkShutter and Integrated MicrophoneFingerprint ReaderKeyboard: Backlit, Black - English (US)WLAN: Intel Wi-Fi 6E AX211 2x2 AX vPro & Bluetooth 5.1 or above  Security as unique as your DNABiometrics provides extra security on the ThinkPad X1 Carbon Gen 10 laptop—from the power button integrated with the fingerprint reader that lets you log in and boot up instantaneously to the facial recognition software that works with the optional IR camera. Plus, Computer Vision-based presence detection automatically locks your device when you move away, and with the optional PrivacyGuard display, no wandering eyes see what’s on your screen.  Zipnology Screen Cleaning Cloth;Microfiber - safe way to clean sensitive laptop screen without scratching the surfaceMulti-purpose - clean all kinds of mirrors, lenses, Musical Instruments, mobile phones, cameras, watches, jewelry, etc",
    "price": {
      "value": 1799,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BRLBZTXT"
  },
  {
    "title": "Lenovo 2022 Ideapad 1i 14\" HD Laptop, Intel Pentium Silver N5030 Processor, 4GB RAM, 128GB eMMC TLC SSD, Intel HD Graphics, HD Webcam, 1-Year Offfice 365 Gray, Windows 11 S, 32GB SnowBell USB Card",
    "asin": "B0BPB134TM",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 17,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61GMrxmJ0KL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": null,
    "price": {
      "value": 189,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BPB134TM"
  },
  {
    "title": "Lenovo - Legion 5 - Gaming Laptop - 15.6\" FHD - AMD Ryzen 5 5600H - 8GB DDR4 RAM - 512GB NVMe TLC SSD - NVIDIA GeForce RTX 3050 Ti Graphics - Windows 11 Home - Phantom Blue",
    "asin": "B09S5MG6K6",
    "brand": "Lenovo",
    "stars": 4.8,
    "reviewsCount": 20,
    "thumbnailImage": "https://m.media-amazon.com/images/I/71fUOX30BdL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The Lenovo Legion 5 is purpose-built for gaming performance. Experience today's top AAA games on this high-performance Lenovo gaming laptop. Inside the clean, minimalist chassis of the Legion 5 is everything you ever need to compete on equal footing with the pros. This includes the latest generation AMD Ryzen™ processor and NVIDIA® GeForce RTX™ 30 Series graphics for performance that’s AI-optimized by the Legion AI Engine powering the revolutionary Legion Coldfront 3.0 and Q Control. The 15\" FHD display will let you play your best with a combination of lightning-fast frame rates, 120 Hz refresh rate, and <3 ms response time, plus deep colors for full-fidelity gaming. Immerse yourself in the experience with Nahimic 3D Audio for Gamers, while the legendary Legion TrueStrike keyboard lets you make your move with pinpoint precision.The Lenovo Legion 5 keeps you connected, with WiFi 6 and Bluetooth® 5.0 built in. And we've made sure that you have the ports you need, with 3 USB 3.2 Gen 1, a USB 3.2 Gen 1 (Always On), a USB-C 3.2 Gen 2 (supports data transfer and DisplayPort 1.4), a USB-C 3.2 Gen 2 (supports data transfer, Power Delivery, and DisplayPort 1.4), HDMI 2.1, Ethernet (RJ-45), and a 3.5mm Headphone / microphone combo jack. And there's an E-Shutter webcam kill switch to help protect your privacy.",
    "price": {
      "value": 717.94,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09S5MG6K6"
  },
  {
    "title": "Lenovo IdeaPad 3 14\" FHD Laptop, 11th Gen Intel 4-Core i7-1165G7, Intel Iris Xe Graphics, 20GB RAM, 512GB PCIe SSD, FP Reader, Webcam, USB-C, HDMI, SD Card Reader, WiFi 6, SPS HDMI Cable, Win 11 Home",
    "asin": "B0BL3YXLT9",
    "brand": "Lenovo",
    "stars": 3,
    "reviewsCount": 2,
    "thumbnailImage": "https://m.media-amazon.com/images/I/61JbljC+oWL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "The computer is professionally upgraded and customized. The manufacturer box will be opened by our professional engineers for customizing and testing. Factory defects & blemishes are significantly reduced by our in-depth inspection & testing. We offer a 12-month warranty, please feel free to contact us if you need any support from our team.Processor ModelIntel Core i7-1165G7# of Cores4Max Turbo FrequencyUp to 4.70 GHzProcessor Base Frequency2.80 GHzIntegrated GraphicsIntel Iris Xe GraphicsDisplay14 Full HD (1920 x 1080) Micro-Edge DisplayInterface2 x USB Type-A1 x USB Type-C Ports1 x HDMI1 x Headphone/Microphone Combo Port1 x SD Card ReaderConnectivityWi-Fi 6 + BT 5.0Operating SystemWindows 11 HomeOthersDimensions: 12.76 x 8.49 x .78 inchWeight: 4.55 lbs",
    "price": {
      "value": 589.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BL3YXLT9"
  },
  {
    "title": "Lenovo - 2022 - IdeaPad 3 - Travel Laptop Computer - AMD Ryzen 5 - 17.3\" FHD Display - 8GB Memory - 512GB Storage - Windows 11 Home",
    "asin": "B09YWMXYQG",
    "brand": "Lenovo",
    "stars": 4.4,
    "reviewsCount": 377,
    "thumbnailImage": "https://m.media-amazon.com/images/I/714zwulp9QL._AC_SY300_SX300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "Travel light and pack heavy AI-infused firepower with the slim and light Lenovo IdeaPad 3 laptop. This Windows laptop computer is full of features that you're looking for, whether you're a WFH pro, an on-the-go college student, or anyone who needs a fast processor in a sleek, easy-to-pack PC with a gorgeous hairline-sheet cover. The IdeaPad 3 is built with an AMD Ryzen 5 5625U processor – part of the powerful AMD 5000 series – and Lenovo AI Engine features that keep your sessions stable, productive and fast. Expand your horizons with the 17.3\" FHD (1920 x 1080) IPS display that gives you a great view from any angle , while the narrow bezels give you more screen space with an 88% active area ratio (that's the amount of screen compared with the size of its borders). With AMD Radeon Vega 7 Graphics, you can work, browse, play games, or stream your favorite shows. Designed to keep your life simple and uncluttered, WiFi 6 and Bluetooth® 5.0 are built into the laptop, and you can connect with two USB-A ports, HDMI™, an audio jack, plus a full-function USB-C port. You'll also enjoy video calls that look and sound better on the crystal-clear HD camera with Smart Noise Cancellation and Dolby Audio® to let you hear everything clearly. With up to 10 hours* of battery life, you can take the Lenovo IdeaPad 3 laptop everywhere you go.* All battery life claims are approximate and based on results using the MobileMark® 2018 v1.0.2.46 battery life benchmark test. Actual battery life will vary and depends on many factors such as product configuration and usage, software use, wireless functionality, power management settings, and screen brightness. The maximum capacity of the battery will decrease with time and use.",
    "price": {
      "value": 479.99,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B09YWMXYQG"
  },
  {
    "title": "Lenovo Legion 5 Gaming Laptop, 15.6\" FHD Display, AMD Ryzen 7 5800H, 32GB RAM,2TB SSD Storage, NVIDIA GeForce RTX 3050Ti, Windows 10H, Phantom Blue, TGCUS Accessories",
    "asin": "B0BTTTSQ8M",
    "brand": "Lenovo",
    "stars": 4.6,
    "reviewsCount": 1370,
    "thumbnailImage": "https://m.media-amazon.com/images/I/710WePb6WtL._AC_SX300_SY300_.jpg",
    "breadCrumbs": "Electronics › Computers & Accessories › Computers & Tablets › Laptops › Traditional Laptops",
    "description": "TGC Distributors sells computers with upgraded configurations. If the computer has modifications (listed above), then the manufacturer box is opened for it to be tested and inspected and to install the upgrades to achieve the specifications as advertised.  Purpose-built for gaming performance, the Lenovo Legion 5 is the perfect platform for experiencing today's top AAA games. Inside the clean, minimalist chassis of this gaming laptop, you'll find a powerful AMD Ryzen 7 5800H processor and NVIDIA GeForce RTX 3050Ti graphics, along with 32GB DDR4 RAM and 2TB NVMe SSD storage. Performance is optimized by the Legion AI Engine, powering the revolutionary Legion Coldfront 3.0 and Q Control. The 15.6-inch full HD IPS display performs at up to 165Hz refresh rate with <3 ms response time and features 100% sRGB color accuracy – along with support for Dolby Vision and AMD FreeSync Premium. You'll also enjoy 2 x 2W speakers with the new Nahimic 3D audio for gamers.The Legion 5 gaming PC offers a plethora of performance options for any gamer in a clean, minimalist design. With the latest generation AMD Ryzen mobile processor, you'll get a combination of lightning-fast frame rates with uncompromised battery life. The NVIDIA GeForce RTX 30 Series graphics bring 2nd Generation Ray Tracing, 3rd Generation AI Tensor Cores and more for a huge leap in graphical performance. Enjoy fast, deep colors on the FHD (1920 x 1080) screen, while the exclusive Lenovo Legion AI Engine dynamically shifts power between the CPU and GPU for more FPS on today's top AAA titles.  TGC Accessories64GB ADATA microSDXC card",
    "price": {
      "value": 1429,
      "currency": "$"
    },
    "url": "https://www.amazon.com/dp/B0BTTTSQ8M"
  }
]
